breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
#include "core_cm4.h"             /* Cortex-M4 processor and core peripherals */
#include "system_py32f4xx.h"
#include <stdint.h>
typedef struct
{
  __IO uint32_t CCR;              /*!< DMA channel x configuration register        */
  __IO uint32_t CNDTR;            /*!< DMA channel x number of data register       */
  __IO uint32_t CPAR;             /*!< DMA channel x peripheral address register   */
  __IO uint32_t CMAR;             /*!< DMA channel x memory address register       */
  __IO uint32_t CNBTR;            /*!< DMA channel x CNBTR register               */
} DMA_Channel_TypeDef;






/**
* @brief FLASH Registers
*/
typedef struct
{
   __IO uint32_t ACR;                             /*!<  FLASH_ACR Register,                          Address offset: 0x00  */
   __IO uint32_t RESERVED1;                        
   __IO uint32_t KEYR;                            /*!<  FLASH_KEYR Register,                         Address offset: 0x08  */
   __IO uint32_t OPTKEYR;                         /*!<  FLASH_OPTKEYR Register,                      Address offset: 0x0C  */
   __IO uint32_t SR;                              /*!<  FLASH_SR Register,                           Address offset: 0x10  */
   __IO uint32_t CR;                              /*!<  FLASH_CR Register,                           Address offset: 0x14  */
   __IO uint32_t RESERVED2[2];                     
   __IO uint32_t OPTR1;                           /*!<  FLASH_OPTR1 Register,                        Address offset: 0x20  */
   __IO uint32_t OPTR2;                           /*!<  FLASH_OPTR2 Register,                        Address offset: 0x24  */
   __IO uint32_t WRPR0;                           /*!<  FLASH_WRPR0 Register,                        Address offset: 0x28  */
   __IO uint32_t PCROPR0;                         /*!<  FLASH_PCROPR0 Register,                      Address offset: 0x2C  */
   __IO uint32_t SECR0;                           /*!<  FLASH_SECR0 Register,                        Address offset: 0x30  */
   __IO uint32_t WRPR1;                           /*!<  FLASH_WRPR1 Register,                        Address offset: 0x34  */
   __IO uint32_t PCROPR1;                         /*!<  FLASH_PCROPR1 Register,                      Address offset: 0x38  */
   __IO uint32_t SECR1;                           /*!<  FLASH_SECR1 Register,                        Address offset: 0x3C  */
   __IO uint32_t RESERVED3[8];                     
   __IO uint32_t OPTBFB;                          /*!<  FLASH_OPTBFB Register,                       Address offset: 0x60  */
   __IO uint32_t RESERVED4[39];                    
   __IO uint32_t TS0;                             /*!<  FLASH_TS0 Register,                          Address offset: 0x100  */
   __IO uint32_t TS1;                             /*!<  FLASH_TS1 Register,                          Address offset: 0x104  */
   __IO uint32_t TS2P;                            /*!<  FLASH_TS2P Register,                         Address offset: 0x108  */
   __IO uint32_t TPS3;                            /*!<  FLASH_TPS3 Register,                         Address offset: 0x10C  */
   __IO uint32_t TS3;                             /*!<  FLASH_TS3 Register,                          Address offset: 0x110  */
   __IO uint32_t ERSTPE;                          /*!<  FLASH_ERSTPE Register,                       Address offset: 0x114  */
   __IO uint32_t PRGTPE;                          /*!<  FLASH_PRGTPE Register,                       Address offset: 0x118  */
   __IO uint32_t PRETPE;                          /*!<  FLASH_PRETPE Register,                       Address offset: 0x11C  */
} FLASH_TypeDef;

/**
* @brief RCC Registers
*/
typedef struct
{
   __IO uint32_t CR;                              /*!<  RCC_CR Register,                             Address offset: 0x00  */
   __IO uint32_t RESERVED1;                        
   __IO uint32_t ICSCR;                           /*!<  RCC_ICSCR Register,                          Address offset: 0x08  */
   __IO uint32_t RESERVED2[2];                     
   __IO uint32_t CFGR1;                           /*!<  RCC_CFGR1 Register,                          Address offset: 0x14  */
   __IO uint32_t CFGR2;                           /*!<  RCC_CFGR2 Register,                          Address offset: 0x18  */
   __IO uint32_t RESERVED3[2];                     
   __IO uint32_t PLLCFGR1;                        /*!<  RCC_PLLCFGR1 Register,                       Address offset: 0x24  */
   __IO uint32_t RESERVED4[4];                     
   __IO uint32_t ECSCR;                           /*!<  RCC_ECSCR Register,                          Address offset: 0x38  */
   __IO uint32_t CIER;                            /*!<  RCC_CIER Register,                           Address offset: 0x3C  */
   __IO uint32_t CIFR;                            /*!<  RCC_CIFR Register,                           Address offset: 0x40  */
   __IO uint32_t CICR;                            /*!<  RCC_CICR Register,                           Address offset: 0x44  */
   __IO uint32_t AHBRSTR1;                        /*!<  RCC_AHBRSTR1 Register,                       Address offset: 0x48  */
   __IO uint32_t AHBRSTR2;                        /*!<  RCC_AHBRSTR2 Register,                       Address offset: 0x4C  */
   __IO uint32_t RESERVED5[2];                     
   __IO uint32_t APBRSTR1;                        /*!<  RCC_APBRSTR1 Register,                       Address offset: 0x58  */
   __IO uint32_t APBRSTR2;                        /*!<  RCC_APBRSTR2 Register,                       Address offset: 0x5C  */
   __IO uint32_t APBRSTR3;                        /*!<  RCC_APBRSTR3 Register,                       Address offset: 0x60  */
   __IO uint32_t APBRSTR4;                        /*!<  RCC_APBRSTR4 Register,                       Address offset: 0x64  */
   __IO uint32_t RESERVED6[2];                     
   __IO uint32_t AHBENR1;                         /*!<  RCC_AHBENR1 Register,                        Address offset: 0x70  */
   __IO uint32_t AHBENR2;                         /*!<  RCC_AHBENR2 Register,                        Address offset: 0x74  */
   __IO uint32_t RESERVED7[2];                     
   __IO uint32_t APBENR1;                         /*!<  RCC_APBENR1 Register,                        Address offset: 0x80  */
   __IO uint32_t APBENR2;                         /*!<  RCC_APBENR2 Register,                        Address offset: 0x84  */
   __IO uint32_t APBENR3;                         /*!<  RCC_APBENR3 Register,                        Address offset: 0x88  */
   __IO uint32_t APBENR4;                         /*!<  RCC_APBENR4 Register,                        Address offset: 0x8C  */
   __IO uint32_t RESERVED8[2];                     
   __IO uint32_t CCIPR1;                          /*!<  RCC_CCIPR1 Register,                         Address offset: 0x98  */
   __IO uint32_t CCIPR2;                          /*!<  RCC_CCIPR2 Register,                         Address offset: 0x9C  */
   __IO uint32_t CCIPR3;                          /*!<  RCC_CCIPR3 Register,                         Address offset: 0xA0  */
   __IO uint32_t RESERVED9[3];                     
   __IO uint32_t BDCR;                            /*!<  RCC_BDCR Register,                           Address offset: 0xB0  */
   __IO uint32_t RESERVED10;                       
   __IO uint32_t CSR;                             /*!<  RCC_CSR Register,                            Address offset: 0xB8  */
} RCC_TypeDef;

/**
* @brief CRC Registers
*/
typedef struct
{
   __IO uint32_t DR;                              /*!<  CRC_DR Register,                             Address offset: 0x00  */
   __IO uint32_t IDR;                             /*!<  CRC_IDR Register,                            Address offset: 0x04  */
   __IO uint32_t CR;                              /*!<  CRC_CR Register,                             Address offset: 0x08  */
} CRC_TypeDef;

/**
* @brief GPIO Registers
*/
typedef struct
{
   __IO uint32_t MODER;                           /*!<  GPIO_MODER Register,                         Address offset: 0x00  */
   __IO uint32_t OTYPER;                          /*!<  GPIO_OTYPER Register,                        Address offset: 0x04  */
   __IO uint32_t OSPEEDR;                         /*!<  GPIO_OSPEEDR Register,                       Address offset: 0x08  */
   __IO uint32_t PUPDR;                           /*!<  GPIO_PUPDR Register,                         Address offset: 0x0C  */
   __IO uint32_t IDR;                             /*!<  GPIO_IDR Register,                           Address offset: 0x10  */
   __IO uint32_t ODR;                             /*!<  GPIO_ODR Register,                           Address offset: 0x14  */
   __IO uint32_t BSRR;                            /*!<  GPIO_BSRR Register,                          Address offset: 0x18  */
   __IO uint32_t LCKR;                            /*!<  GPIO_LCKR Register,                          Address offset: 0x1C  */
    __IO uint32_t AFR[2];      /*!< GPIO alternate function registers,     Address offset: 0x20-0x24 */
   __IO uint32_t BRR;                             /*!<  GPIO_BRR Register,                           Address offset: 0x28  */
} GPIO_TypeDef;

/**
* @brief SYSCFG Registers
*/
typedef struct
{
   __IO uint32_t CFGR[4];                           /*!<  SYSCFG_CFGR1 Register,                       Address offset: 0x00  */
//   __IO uint32_t CFGR2;                           /*!<  SYSCFG_CFGR2 Register,                       Address offset: 0x04  */
//   __IO uint32_t CFGR3;                           /*!<  SYSCFG_CFGR3 Register,                       Address offset: 0x08  */
//   __IO uint32_t CFGR4;                           /*!<  SYSCFG_CFGR4 Register,                       Address offset: 0x0C  */
   __IO uint32_t RESERVED1;                        
   __IO uint32_t EXTICR[4];                         /*!<  SYSCFG_EXTICR1 Register,                     Address offset: 0x14  */
//   __IO uint32_t EXTICR2;                         /*!<  SYSCFG_EXTICR2 Register,                     Address offset: 0x18  */
//   __IO uint32_t EXTICR3;                         /*!<  SYSCFG_EXTICR3 Register,                     Address offset: 0x1C  */
//   __IO uint32_t EXTICR4;                         /*!<  SYSCFG_EXTICR4 Register,                     Address offset: 0x20  */
   __IO uint32_t PAENS;                           /*!<  SYSCFG_PAENS Register,                       Address offset: 0x24  */
   __IO uint32_t PBENS;                           /*!<  SYSCFG_PBENS Register,                       Address offset: 0x28  */
   __IO uint32_t PCENS;                           /*!<  SYSCFG_PCENS Register,                       Address offset: 0x2C  */
   __IO uint32_t PDENS;                           /*!<  SYSCFG_PDENS Register,                       Address offset: 0x30  */
} SYSCFG_TypeDef;

/**
* @brief RTC Registers
*/
typedef struct
{
   __IO uint32_t CRH;                             /*!<  RTC_CRH Register,                            Address offset: 0x00  */
   __IO uint32_t CRL;                             /*!<  RTC_CRL Register,                            Address offset: 0x04  */
   __IO uint32_t PRLH;                            /*!<  RTC_PRLH Register,                           Address offset: 0x08  */
   __IO uint32_t PRLL;                            /*!<  RTC_PRLL Register,                           Address offset: 0x0C  */
   __IO uint32_t DIVH;                            /*!<  RTC_DIVH Register,                           Address offset: 0x10  */
   __IO uint32_t DIVL;                            /*!<  RTC_DIVL Register,                           Address offset: 0x14  */
   __IO uint32_t CNTH;                            /*!<  RTC_CNTH Register,                           Address offset: 0x18  */
   __IO uint32_t CNTL;                            /*!<  RTC_CNTL Register,                           Address offset: 0x1C  */
   __IO uint32_t ALRH;                            /*!<  RTC_ALRH Register,                           Address offset: 0x20  */
   __IO uint32_t ALRL;                            /*!<  RTC_ALRL Register,                           Address offset: 0x24  */
   __IO uint32_t RESERVED1[2];                     
   __IO uint32_t TMPCFGR;                         /*!<  RTC_TMPCFGR Register,                        Address offset: 0x30  */
   __IO uint32_t TMPCSR;                          /*!<  RTC_TMPCSR Register,                         Address offset: 0x34  */
   __IO uint32_t CALIBR;                          /*!<  RTC_CALIBR Register,                         Address offset: 0x38  */
   __IO uint32_t RESERVED2;                        
   __IO uint32_t BKPDR0;                          /*!<  RTC_BKPDR0 Register,                         Address offset: 0x40  */
   __IO uint32_t BKPDR1;                          /*!<  RTC_BKPDR1 Register,                         Address offset: 0x44  */
   __IO uint32_t BKPDR2;                          /*!<  RTC_BKPDR2 Register,                         Address offset: 0x48  */
   __IO uint32_t BKPDR3;                          /*!<  RTC_BKPDR3 Register,                         Address offset: 0x4C  */
   __IO uint32_t BKPDR4;                          /*!<  RTC_BKPDR4 Register,                         Address offset: 0x50  */
} RTC_TypeDef;

/**
* @brief DMA Registers
*/
typedef struct
{
   __IO uint32_t ISR;                             /*!<  DMA_ISR Register,                            Address offset: 0x00  */
   __IO uint32_t IFCR;                            /*!<  DMA_IFCR Register,                           Address offset: 0x04  */
   __IO uint32_t CCR1;                            /*!<  DMA_CCR1 Register,                           Address offset: 0x08  */
   __IO uint32_t CNDTR1;                          /*!<  DMA_CNDTR1 Register,                         Address offset: 0x0C  */
   __IO uint32_t CPAR1;                           /*!<  DMA_CPAR1 Register,                          Address offset: 0x10  */
   __IO uint32_t CMAR1;                           /*!<  DMA_CMAR1 Register,                          Address offset: 0x14  */
   __IO uint32_t CCCFGR1;                         /*!<  DMA_CCCFGR1 Register,                        Address offset: 0x18  */
   __IO uint32_t CCR2;                            /*!<  DMA_CCR2 Register,                           Address offset: 0x1C  */
   __IO uint32_t CNDTR2;                          /*!<  DMA_CNDTR2 Register,                         Address offset: 0x20  */
   __IO uint32_t CPAR2;                           /*!<  DMA_CPAR2 Register,                          Address offset: 0x24  */
   __IO uint32_t CMAR2;                           /*!<  DMA_CMAR2 Register,                          Address offset: 0x28  */
   __IO uint32_t CCCFGR2;                         /*!<  DMA_CCCFGR2 Register,                        Address offset: 0x2C  */
   __IO uint32_t CCR3;                            /*!<  DMA_CCR3 Register,                           Address offset: 0x30  */
   __IO uint32_t CNDTR3;                          /*!<  DMA_CNDTR3 Register,                         Address offset: 0x34  */
   __IO uint32_t CPAR3;                           /*!<  DMA_CPAR3 Register,                          Address offset: 0x38  */
   __IO uint32_t CMAR3;                           /*!<  DMA_CMAR3 Register,                          Address offset: 0x3C  */
   __IO uint32_t CCCFGR3;                         /*!<  DMA_CCCFGR3 Register,                        Address offset: 0x40  */
   __IO uint32_t CCR4;                            /*!<  DMA_CCR4 Register,                           Address offset: 0x44  */
   __IO uint32_t CNDTR4;                          /*!<  DMA_CNDTR4 Register,                         Address offset: 0x48  */
   __IO uint32_t CPAR4;                           /*!<  DMA_CPAR4 Register,                          Address offset: 0x4C  */
   __IO uint32_t CMAR4;                           /*!<  DMA_CMAR4 Register,                          Address offset: 0x50  */
   __IO uint32_t CCCFGR4;                         /*!<  DMA_CCCFGR4 Register,                        Address offset: 0x54  */
   __IO uint32_t CCR5;                            /*!<  DMA_CCR5 Register,                           Address offset: 0x58  */
   __IO uint32_t CNDTR5;                          /*!<  DMA_CNDTR5 Register,                         Address offset: 0x5C  */
   __IO uint32_t CPAR5;                           /*!<  DMA_CPAR5 Register,                          Address offset: 0x60  */
   __IO uint32_t CMAR5;                           /*!<  DMA_CMAR5 Register,                          Address offset: 0x64  */
   __IO uint32_t CCCFGR5;                         /*!<  DMA_CCCFGR5 Register,                        Address offset: 0x68  */
} DMA_TypeDef;

/**
* @brief EXTI Registers
*/
typedef struct
{
   __IO uint32_t IMR;                             /*!<  EXTI_IMR Register,                           Address offset: 0x00  */
   __IO uint32_t EMR;                             /*!<  EXTI_EMR Register,                           Address offset: 0x04  */
   __IO uint32_t RTSR;                            /*!<  EXTI_RTSR Register,                          Address offset: 0x08  */
   __IO uint32_t FTSR;                            /*!<  EXTI_FTSR Register,                          Address offset: 0x0C  */
   __IO uint32_t SWIER;                           /*!<  EXTI_SWIER Register,                         Address offset: 0x10  */
   __IO uint32_t PR;                              /*!<  EXTI_PR Register,                            Address offset: 0x14  */
} EXTI_TypeDef;

/**
* @brief ADC Registers
*/
typedef struct
{
   __IO uint32_t ISR;                             /*!<  ADC_ISR Register,                            Address offset: 0x00  */
   __IO uint32_t IER;                             /*!<  ADC_IER Register,                            Address offset: 0x04  */
   __IO uint32_t CR;                              /*!<  ADC_CR Register,                             Address offset: 0x08  */
   __IO uint32_t CFGR;                            /*!<  ADC_CFGR Register,                           Address offset: 0x0C  */
   __IO uint32_t CFGR2;                           /*!<  ADC_CFGR2 Register,                          Address offset: 0x10  */
   __IO uint32_t SMPR1;                           /*!<  ADC_SMPR1 Register,                          Address offset: 0x14  */
   __IO uint32_t SMPR2;                           /*!<  ADC_SMPR2 Register,                          Address offset: 0x18  */
   __IO uint32_t RESERVED1;                        
   __IO uint32_t SMPR3;                           /*!<  ADC_SMPR3 Register,                          Address offset: 0x20  */
   __IO uint32_t TR1;                             /*!<  ADC_TR1 Register,                            Address offset: 0x24  */
   __IO uint32_t TR2;                             /*!<  ADC_TR2 Register,                            Address offset: 0x28  */
   __IO uint32_t TR3;                             /*!<  ADC_TR3 Register,                            Address offset: 0x2C  */
   __IO uint32_t SQR1;                            /*!<  ADC_SQR1 Register,                           Address offset: 0x30  */
   __IO uint32_t SQR2;                            /*!<  ADC_SQR2 Register,                           Address offset: 0x34  */
   __IO uint32_t SQR3;                            /*!<  ADC_SQR3 Register,                           Address offset: 0x38  */
   __IO uint32_t SQR4;                            /*!<  ADC_SQR4 Register,                           Address offset: 0x3C  */
   __IO uint32_t DR;                              /*!<  ADC_DR Register,                             Address offset: 0x40  */
   __IO uint32_t RESERVED2[2];                     
   __IO uint32_t JSQR;                            /*!<  ADC_JSQR Register,                           Address offset: 0x4C  */
   __IO uint32_t RESERVED3[4];                     
   __IO uint32_t OFR1;                            /*!<  ADC_OFR1 Register,                           Address offset: 0x60  */
   __IO uint32_t OFR2;                            /*!<  ADC_OFR2 Register,                           Address offset: 0x64  */
   __IO uint32_t OFR3;                            /*!<  ADC_OFR3 Register,                           Address offset: 0x68  */
   __IO uint32_t OFR4;                            /*!<  ADC_OFR4 Register,                           Address offset: 0x6C  */
   __IO uint32_t RESERVED4[4];                     
   __IO uint32_t JDR1;                            /*!<  ADC_JDR1 Register,                           Address offset: 0x80  */
   __IO uint32_t JDR2;                            /*!<  ADC_JDR2 Register,                           Address offset: 0x84  */
   __IO uint32_t JDR3;                            /*!<  ADC_JDR3 Register,                           Address offset: 0x88  */
   __IO uint32_t JDR4;                            /*!<  ADC_JDR4 Register,                           Address offset: 0x8C  */
   __IO uint32_t RESERVED5[4];                     
   __IO uint32_t AWD2CR;                          /*!<  ADC_AWD2CR Register,                         Address offset: 0xA0  */
   __IO uint32_t AWD3CR;                          /*!<  ADC_AWD3CR Register,                         Address offset: 0xA4  */
   __IO uint32_t RESERVED6[2];                     
   __IO uint32_t DIFSEL;                          /*!<  ADC_DIFSEL Register,                         Address offset: 0xB0  */
   __IO uint32_t CALFACT;                         /*!<  ADC_CALFACT Register,                        Address offset: 0xB4  */
   __IO uint32_t RESERVED7[2];                     
   __IO uint32_t GCOMP;                           /*!<  ADC_GCOMP Register,                          Address offset: 0xC0  */
   __IO uint32_t ANACR;                           /*!<  ADC_ANACR Register,                          Address offset: 0xC4  */
   __IO uint32_t RESERVED8[143];                   
   __IO uint32_t CSR;                             /*!<  ADC_CSR Register,                            Address offset: 0x304  */
   __IO uint32_t CCR;                             /*!<  ADC_CCR Register,                            Address offset: 0x308  */
   __IO uint32_t CDR;                             /*!<  ADC_CDR Register,                            Address offset: 0x30C  */
} ADC_TypeDef;

