breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/**
* @brief DAC Registers
*/
typedef struct
{
   __IO uint32_t CR;                              /*!<  DAC_CR Register,                             Address offset: 0x00  */
   __IO uint32_t SWTRIGR;                         /*!<  DAC_SWTRIGR Register,                        Address offset: 0x04  */
   __IO uint32_t DHR12R1;                         /*!<  DAC_DHR12R1 Register,                        Address offset: 0x08  */
   __IO uint32_t DHR12L1;                         /*!<  DAC_DHR12L1 Register,                        Address offset: 0x0C  */
   __IO uint32_t DHR8R1;                          /*!<  DAC_DHR8R1 Register,                         Address offset: 0x10  */
   __IO uint32_t DHR12R2;                         /*!<  DAC_DHR12R2 Register,                        Address offset: 0x14  */
   __IO uint32_t DHR12L2;                         /*!<  DAC_DHR12L2 Register,                        Address offset: 0x18  */
   __IO uint32_t DHR8R2;                          /*!<  DAC_DHR8R2 Register,                         Address offset: 0x1C  */
   __IO uint32_t DHR12RD;                         /*!<  DAC_DHR12RD Register,                        Address offset: 0x20  */
   __IO uint32_t DHR12LD;                         /*!<  DAC_DHR12LD Register,                        Address offset: 0x24  */
   __IO uint32_t DHR8RD;                          /*!<  DAC_DHR8RD Register,                         Address offset: 0x28  */
   __IO uint32_t DOR1;                            /*!<  DAC_DOR1 Register,                           Address offset: 0x2C  */
   __IO uint32_t DOR2;                            /*!<  DAC_DOR2 Register,                           Address offset: 0x30  */
   __IO uint32_t SR;                              /*!<  DAC_SR Register,                             Address offset: 0x34  */
   __IO uint32_t OC;                              /*!<  DAC_OC Register,                             Address offset: 0x38  */
   __IO uint32_t RESERVED1[7];                     
   __IO uint32_t RAMPCFGR1;                       /*!<  DAC_RAMPCFGR1 Register,                      Address offset: 0x58  */
   __IO uint32_t RAMPCFGR2;                       /*!<  DAC_RAMPCFGR2 Register,                      Address offset: 0x5C  */
   __IO uint32_t RESERVED2;                        
   __IO uint32_t RAMPDLYS;                        /*!<  DAC_RAMPDLYS Register,                       Address offset: 0x64  */
   __IO uint32_t RAMPCR;                          /*!<  DAC_RAMPCR Register,                         Address offset: 0x68  */
   __IO uint32_t CLKCR;                           /*!<  DAC_CLKCR Register,                          Address offset: 0x6C  */
} DAC_TypeDef;

/**
  * @brief Comparator
  */
typedef struct
{
  __IO uint32_t CSR;              /*!< COMP control and status register,           Address offset: 0x00 */
  __IO uint32_t FR;               /*!< COMP filter register,                       Address offset: 0x04 */
} COMP_TypeDef;

typedef struct
{
  __IO uint32_t CSR_ODD;       /*!< COMP control and status register located in register of comparator instance 1, used for bits common to several COMP instances,  Address offset: 0x00 */
  __IO uint32_t FR_ODD;
  uint32_t RESERVED0[2];        /*Reserved*/
  __IO uint32_t CSR_EVEN;      /*!< COMP control and status register located in register of comparator instance 2, used for bits common to several COMP instances, Address offset: 0x010 */
  __IO uint32_t FR_EVEN;
} COMP_Common_TypeDef;

/**
* @brief OPA Registers
*/
typedef struct
{
   __IO uint32_t CSR;                            /*!<  OPA1_CSR Register,                           Address offset: 0x00  */
} OPA_TypeDef;

/**
* @brief TIM Registers
*/
typedef struct
{
   __IO uint32_t CR1;                             /*!<  TIM_CR1 Register,                            Address offset: 0x00  */
   __IO uint32_t CR2;                             /*!<  TIM_CR2 Register,                            Address offset: 0x04  */
   __IO uint32_t SMCR;                            /*!<  TIM_SMCR Register,                           Address offset: 0x08  */
   __IO uint32_t DIER;                            /*!<  TIM_DIER Register,                           Address offset: 0x0C  */
   __IO uint32_t SR;                              /*!<  TIM_SR Register,                             Address offset: 0x10  */
   __IO uint32_t EGR;                             /*!<  TIM_EGR Register,                            Address offset: 0x14  */
    __IO uint32_t CCMR1;       /*!< TIM desc CCMR1:OUTPUT, Address offset: 0x18 */
    __IO uint32_t CCMR2;       /*!< TIM desc CCMR2:OUTPUT, Address offset: 0x1C */
   __IO uint32_t CCER;                            /*!<  TIM_CCER Register,                           Address offset: 0x20  */
   __IO uint32_t CNT;                             /*!<  TIM_CNT Register,                            Address offset: 0x24  */
   __IO uint32_t PSC;                             /*!<  TIM_PSC Register,                            Address offset: 0x28  */
   __IO uint32_t ARR;                             /*!<  TIM_ARR Register,                            Address offset: 0x2C  */
   __IO uint32_t RCR;                             /*!<  TIM_RCR Register,                            Address offset: 0x30  */
   __IO uint32_t CCR1;                            /*!<  TIM_CCR1 Register,                           Address offset: 0x34  */
   __IO uint32_t CCR2;                            /*!<  TIM_CCR2 Register,                           Address offset: 0x38  */
   __IO uint32_t CCR3;                            /*!<  TIM_CCR3 Register,                           Address offset: 0x3C  */
   __IO uint32_t CCR4;                            /*!<  TIM_CCR4 Register,                           Address offset: 0x40  */
   __IO uint32_t BDTR;                            /*!<  TIM_BDTR Register,                           Address offset: 0x44  */
   __IO uint32_t CCR5;                            /*!<  TIM_CCR5 Register,                           Address offset: 0x48  */
   __IO uint32_t CCR6;                            /*!<  TIM_CCR6 Register,                           Address offset: 0x4C  */
   __IO uint32_t CCMR3;                           /*!<  TIM_CCMR3 Register,                          Address offset: 0x50  */
   __IO uint32_t DTR2;                            /*!<  TIM_DTR2 Register,                           Address offset: 0x54  */
   __IO uint32_t ECR;                             /*!<  TIM_ECR Register,                            Address offset: 0x58  */
   __IO uint32_t TISEL;                           /*!<  TIM_TISEL Register,                          Address offset: 0x5C  */
   __IO uint32_t AF1;                             /*!<  TIM_AF1 Register,                            Address offset: 0x60  */
   __IO uint32_t AF2;                             /*!<  TIM_AF2 Register,                            Address offset: 0x64  */
   __IO uint32_t OR1;                             /*!<  TIM_OR1 Register,                            Address offset: 0x68  */
   __IO uint32_t MTADCCR;                         /*!<  TIM_MTADCCR Register,                        Address offset: 0x6C  */
   __IO uint32_t RESERVED3[219];                   
   __IO uint32_t DCR;                             /*!<  TIM_DCR Register,                            Address offset: 0x3DC  */
   __IO uint32_t DMAR;                            /*!<  TIM_DMAR Register,                           Address offset: 0x3E0  */
} TIM_TypeDef;

/**
* @brief LPTIM Registers
*/
typedef struct
{
   __IO uint32_t ISR;                             /*!<  LPTIM_ISR Register,                          Address offset: 0x00  */
   __IO uint32_t ICR;                             /*!<  LPTIM_ICR Register,                          Address offset: 0x04  */
   __IO uint32_t IER;                             /*!<  LPTIM_IER Register,                          Address offset: 0x08  */
   __IO uint32_t CFGR;                            /*!<  LPTIM_CFGR Register,                         Address offset: 0x0C  */
   __IO uint32_t CR;                              /*!<  LPTIM_CR Register,                           Address offset: 0x10  */
   __IO uint32_t CMP;                             /*!<  LPTIM_CMP Register,                          Address offset: 0x14  */
   __IO uint32_t ARR;                             /*!<  LPTIM_ARR Register,                          Address offset: 0x18  */
   __IO uint32_t CNT;                             /*!<  LPTIM_CNT Register,                          Address offset: 0x1C  */
   __IO uint32_t OR;                              /*!<  LPTIM_OR Register,                           Address offset: 0x20  */
} LPTIM_TypeDef;

/**
* @brief IWDG Registers
*/
typedef struct
{
   __IO uint16_t KR;                              /*!<  IWDG_KR Register,                            Address offset: 0x00  */
   __IO uint16_t RESERVED1;                        
   __IO uint16_t PR;                              /*!<  IWDG_PR Register,                            Address offset: 0x04  */
   __IO uint16_t RESERVED2;                        
   __IO uint16_t RLR;                             /*!<  IWDG_RLR Register,                           Address offset: 0x08  */
   __IO uint16_t RESERVED3;                        
   __IO uint16_t SR;                              /*!<  IWDG_SR Register,                            Address offset: 0x0C  */
} IWDG_TypeDef;

/**
* @brief WWDG Registers
*/
typedef struct
{
   __IO uint32_t CR;                              /*!<  WWDG_CR Register,                            Address offset: 0x00  */
   __IO uint32_t CFR;                             /*!<  WWDG_CFR Register,                           Address offset: 0x04  */
   __IO uint32_t SR;                              /*!<  WWDG_SR Register,                            Address offset: 0x08  */
} WWDG_TypeDef;

/**
* @brief SPI Registers
*/
typedef struct
{
   __IO uint32_t CR1;                             /*!<  SPI_CR1 Register,                            Address offset: 0x00  */
   __IO uint32_t CR2;                             /*!<  SPI_CR2 Register,                            Address offset: 0x04  */
   __IO uint32_t SR;                              /*!<  SPI_SR Register,                             Address offset: 0x08  */
   __IO uint32_t DR;                              /*!<  SPI_DR Register,                             Address offset: 0x0C  */
   __IO uint32_t CRCPR;                           /*!<  SPI_CRCPR Register,                          Address offset: 0x10  */
   __IO uint32_t RXCRCR;                          /*!<  SPI_RXCRCR Register,                         Address offset: 0x14  */
   __IO uint32_t TXCRCR;                          /*!<  SPI_TXCRCR Register,                         Address offset: 0x18  */
   __IO uint32_t I2S_CFGR;                        /*!<  SPI_I2S_CFGR Register,                       Address offset: 0x1C  */
   __IO uint32_t I2SPR;                           /*!<  SPI_I2SPR Register,                          Address offset: 0x20  */
} SPI_TypeDef;

/**
* @brief FDCAN Registers
*/
typedef struct
{
   __IO uint32_t CREL;                            /*!<  FDCAN_CREL Register,                         Address offset: 0x00  */
   __IO uint32_t ENDN;                            /*!<  FDCAN_ENDN Register,                         Address offset: 0x04  */
   __IO uint32_t RESERVED1;                        
   __IO uint32_t DBTP;                            /*!<  FDCAN_DBTP Register,                         Address offset: 0x0C  */
   __IO uint32_t TEST;                            /*!<  FDCAN_TEST Register,                         Address offset: 0x10  */
   __IO uint32_t RWD;                             /*!<  FDCAN_RWD Register,                          Address offset: 0x14  */
   __IO uint32_t CCCR;                            /*!<  FDCAN_CCCR Register,                         Address offset: 0x18  */
   __IO uint32_t NBTP;                            /*!<  FDCAN_NBTP Register,                         Address offset: 0x1C  */
   __IO uint32_t TSCC;                            /*!<  FDCAN_TSCC Register,                         Address offset: 0x20  */
   __IO uint32_t TSCV;                            /*!<  FDCAN_TSCV Register,                         Address offset: 0x24  */
   __IO uint32_t TOCC;                            /*!<  FDCAN_TOCC Register,                         Address offset: 0x28  */
   __IO uint32_t TOCV;                            /*!<  FDCAN_TOCV Register,                         Address offset: 0x2C  */
   __IO uint32_t RESERVED2[4];                     
   __IO uint32_t ECR;                             /*!<  FDCAN_ECR Register,                          Address offset: 0x40  */
   __IO uint32_t PSR;                             /*!<  FDCAN_PSR Register,                          Address offset: 0x44  */
   __IO uint32_t TDCR;                            /*!<  FDCAN_TDCR Register,                         Address offset: 0x48  */
   __IO uint32_t RESERVED3;                        
   __IO uint32_t IR;                              /*!<  FDCAN_IR Register,                           Address offset: 0x50  */
   __IO uint32_t IE;                              /*!<  FDCAN_IE Register,                           Address offset: 0x54  */
   __IO uint32_t ILS;                             /*!<  FDCAN_ILS Register,                          Address offset: 0x58  */
   __IO uint32_t ILE;                             /*!<  FDCAN_ILE Register,                          Address offset: 0x5C  */
   __IO uint32_t RESERVED4[8];                     
   __IO uint32_t GFC;                             /*!<  FDCAN_GFC Register,                          Address offset: 0x80  */
   __IO uint32_t SIDFC;                           /*!<  FDCAN_SIDFC Register,                        Address offset: 0x84  */
   __IO uint32_t XIDFC;                           /*!<  FDCAN_XIDFC Register,                        Address offset: 0x88  */
   __IO uint32_t RESERVED5;                        
   __IO uint32_t XIDAM;                           /*!<  FDCAN_XIDAM Register,                        Address offset: 0x90  */
   __IO uint32_t HPMS;                            /*!<  FDCAN_HPMS Register,                         Address offset: 0x94  */
   __IO uint32_t NDAT1;                           /*!<  FDCAN_NDAT1 Register,                        Address offset: 0x98  */
   __IO uint32_t NDAT2;                           /*!<  FDCAN_NDAT2 Register,                        Address offset: 0x9C  */
   __IO uint32_t RXF0C;                           /*!<  FDCAN_RXF0C Register,                        Address offset: 0xA0  */
   __IO uint32_t RXF0S;                           /*!<  FDCAN_RXF0S Register,                        Address offset: 0xA4  */
   __IO uint32_t RXF0A;                           /*!<  FDCAN_RXF0A Register,                        Address offset: 0xA8  */
   __IO uint32_t RXBC;                            /*!<  FDCAN_RXBC Register,                         Address offset: 0xAC  */
   __IO uint32_t RXF1C;                           /*!<  FDCAN_RXF1C Register,                        Address offset: 0xB0  */
   __IO uint32_t RXF1S;                           /*!<  FDCAN_RXF1S Register,                        Address offset: 0xB4  */
   __IO uint32_t RXF1A;                           /*!<  FDCAN_RXF1A Register,                        Address offset: 0xB8  */
   __IO uint32_t RXESC;                           /*!<  FDCAN_RXESC Register,                        Address offset: 0xBC  */
   __IO uint32_t TXBC;                            /*!<  FDCAN_TXBC Register,                         Address offset: 0xC0  */
   __IO uint32_t TXFQS;                           /*!<  FDCAN_TXFQS Register,                        Address offset: 0xC4  */
   __IO uint32_t TXESC;                           /*!<  FDCAN_TXESC Register,                        Address offset: 0xC8  */
   __IO uint32_t TXBRP;                           /*!<  FDCAN_TXBRP Register,                        Address offset: 0xCC  */
   __IO uint32_t TXBAR;                           /*!<  FDCAN_TXBAR Register,                        Address offset: 0xD0  */
   __IO uint32_t TXBCR;                           /*!<  FDCAN_TXBCR Register,                        Address offset: 0xD4  */
   __IO uint32_t TXBTO;                           /*!<  FDCAN_TXBTO Register,                        Address offset: 0xD8  */
   __IO uint32_t TXBCF;                           /*!<  FDCAN_TXBCF Register,                        Address offset: 0xDC  */
   __IO uint32_t TXBTIE;                          /*!<  FDCAN_TXBTIE Register,                       Address offset: 0xE0  */
   __IO uint32_t TXBCIE;                          /*!<  FDCAN_TXBCIE Register,                       Address offset: 0xE4  */
   __IO uint32_t RESERVED6[2];                     
   __IO uint32_t TXEFC;                           /*!<  FDCAN_TXEFC Register,                        Address offset: 0xF0  */
   __IO uint32_t TXEFS;                           /*!<  FDCAN_TXEFS Register,                        Address offset: 0xF4  */
   __IO uint32_t TXEFA;                           /*!<  FDCAN_TXEFA Register,                        Address offset: 0xF8  */
} FDCAN_TypeDef;

/**
* @brief I2C Registers
*/
typedef struct
{
   __IO uint32_t CR1;                             /*!<  I2C_CR1 Register,                            Address offset: 0x00  */
   __IO uint32_t CR2;                             /*!<  I2C_CR2 Register,                            Address offset: 0x04  */
   __IO uint32_t OAR1;                            /*!<  I2C_OAR1 Register,                           Address offset: 0x08  */
   __IO uint32_t OAR2;                            /*!<  I2C_OAR2 Register,                           Address offset: 0x0C  */
   __IO uint32_t DR;                              /*!<  I2C_DR Register,                             Address offset: 0x10  */
   __IO uint32_t SR1;                             /*!<  I2C_SR1 Register,                            Address offset: 0x14  */
   __IO uint32_t SR2;                             /*!<  I2C_SR2 Register,                            Address offset: 0x18  */
   __IO uint32_t CCR;                             /*!<  I2C_CCR Register,                            Address offset: 0x1C  */
   __IO uint32_t TRISE;                           /*!<  I2C_TRISE Register,                          Address offset: 0x20  */
   __IO uint32_t TIMEOUTR;                        /*!<  I2C_TIMEOUTR Register,                       Address offset: 0x24  */
   __IO uint32_t OAR3;                            /*!<  I2C_OAR3 Register,                           Address offset: 0x28  */
} I2C_TypeDef;

/**
* @brief USART Registers
*/
typedef struct
{
   __IO uint32_t SR;                              /*!<  USART_SR Register,                           Address offset: 0x00  */
   __IO uint32_t DR;                              /*!<  USART_DR Register,                           Address offset: 0x04  */
   __IO uint32_t BRR;                             /*!<  USART_BRR Register,                          Address offset: 0x08  */
   __IO uint32_t CR1;                             /*!<  USART_CR1 Register,                          Address offset: 0x0C  */
   __IO uint32_t CR2;                             /*!<  USART_CR2 Register,                          Address offset: 0x10  */
   __IO uint32_t CR3;                             /*!<  USART_CR3 Register,                          Address offset: 0x14  */
   __IO uint32_t GTPR;                            /*!<  USART_GTPR Register,                         Address offset: 0x18  */
   __IO uint32_t RTOR;                            /*!<  USART_RTOR Register,                         Address offset: 0x1C  */
} USART_TypeDef;

/**
* @brief UART Registers
*/
typedef struct
{
   __IO uint32_t DR;                              /*!<  UART_DR Register,                            Address offset: 0x00  */
   __IO uint32_t BRR;                             /*!<  UART_BRR Register,                           Address offset: 0x04  */
   __IO uint32_t RESERVED1[2];                     
   __IO uint32_t SR;                              /*!<  UART_SR Register,                            Address offset: 0x10  */
   __IO uint32_t CR1;                             /*!<  UART_CR1 Register,                           Address offset: 0x14  */
   __IO uint32_t CR2;                             /*!<  UART_CR2 Register,                           Address offset: 0x18  */
   __IO uint32_t CR3;                             /*!<  UART_CR3 Register,                           Address offset: 0x1C  */
   __IO uint32_t RAR;                             /*!<  UART_RAR Register,                           Address offset: 0x20  */
   __IO uint32_t TAR;                             /*!<  UART_TAR Register,                           Address offset: 0x24  */
   __IO uint32_t BRRF;                            /*!<  UART_BRRF Register,                          Address offset: 0x28  */
} UART_TypeDef;

/**
* @brief LPUART Registers
*/
typedef struct
{
   __IO uint32_t CR1;                             /*!<  LPUART_CR1 Register,                         Address offset: 0x00  */
   __IO uint32_t CR2;                             /*!<  LPUART_CR2 Register,                         Address offset: 0x04  */
   __IO uint32_t CR3;                             /*!<  LPUART_CR3 Register,                         Address offset: 0x08  */
   __IO uint32_t BRR;                             /*!<  LPUART_BRR Register,                         Address offset: 0x0C  */
   __IO uint32_t RESERVED1[2];                     
   __IO uint32_t RQR;                             /*!<  LPUART_RQR Register,                         Address offset: 0x18  */
   __IO uint32_t ISR;                             /*!<  LPUART_ISR Register,                         Address offset: 0x1C  */
   __IO uint32_t ICR;                             /*!<  LPUART_ICR Register,                         Address offset: 0x20  */
   __IO uint32_t RDR;                             /*!<  LPUART_RDR Register,                         Address offset: 0x24  */
   __IO uint32_t TDR;                             /*!<  LPUART_TDR Register,                         Address offset: 0x28  */
   __IO uint32_t PRESC;                           /*!<  LPUART_PRESC Register,                       Address offset: 0x2C  */
} LPUART_TypeDef;

/**
* @brief DBGMCU Registers
*/
typedef struct
{
   __IO uint32_t IDCODE;                          /*!<  DBGMCU_IDCODE Register,                      Address offset: 0x00  */
   __IO uint32_t CR1;                             /*!<  DBGMCU_CR1 Register,                         Address offset: 0x04  */
   __IO uint32_t CR2;                             /*!<  DBGMCU_CR2 Register,                         Address offset: 0x08  */
} DBGMCU_TypeDef;

/**
* @brief VREFBUF Registers
*/
typedef struct
{
   __IO uint32_t CR;                              /*!<  VREFBUF_CR Register,                         Address offset: 0x00  */
} VREFBUF_TypeDef;

/**
* @brief PWR Registers
*/
typedef struct
{
   __IO uint32_t CR1;                             /*!<  PWR_CR1 Register,                            Address offset: 0x00  */
   __IO uint32_t CR2;                             /*!<  PWR_CR2 Register,                            Address offset: 0x04  */
   __IO uint32_t CR3;                             /*!<  PWR_CR3 Register,                            Address offset: 0x08  */
   __IO uint32_t CR4;                             /*!<  PWR_CR4 Register,                            Address offset: 0x0C  */
   __IO uint32_t SR;                              /*!<  PWR_SR Register,                             Address offset: 0x10  */
   __IO uint32_t SCR;                             /*!<  PWR_SCR Register,                            Address offset: 0x14  */
} PWR_TypeDef;

