breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/**
* @brief HRPWMC Registers
*/
typedef struct
{
   __IO uint32_t IXBSEL1_2;                       /*!<  HRPWMC_IXBSEL1_2 Register,                   Address offset: 0x00  */
   __IO uint32_t IXBSEL3_4;                       /*!<  HRPWMC_IXBSEL3_4 Register,                   Address offset: 0x04  */
   __IO uint32_t IXBSEL5_6;                       /*!<  HRPWMC_IXBSEL5_6 Register,                   Address offset: 0x08  */
   __IO uint32_t IXBSEL7_8;                       /*!<  HRPWMC_IXBSEL7_8 Register,                   Address offset: 0x0C  */
   __IO uint32_t IXBSEL9_10;                      /*!<  HRPWMC_IXBSEL9_10 Register,                  Address offset: 0x10  */
   __IO uint32_t IXBSEL11_12;                     /*!<  HRPWMC_IXBSEL11_12 Register,                 Address offset: 0x14  */
   __IO uint32_t IXBSEL13_14;                     /*!<  HRPWMC_IXBSEL13_14 Register,                 Address offset: 0x18  */
   __IO uint32_t IXBAQSEL;                        /*!<  HRPWMC_IXBAQSEL Register,                    Address offset: 0x1C  */
   __IO uint32_t IXBSEL_LOCK;                     /*!<  HRPWMC_IXBSEL_LOCK Register,                 Address offset: 0x20  */
   __IO uint32_t IXBCTRL;                         /*!<  HRPWMC_IXBCTRL Register,                     Address offset: 0x24  */
   __IO uint32_t RESERVED1[6];                     
   __IO uint32_t HXB4_0;                          /*!<  HRPWMC_HXB4_0 Register,                      Address offset: 0x40  */
   __IO uint32_t HXB4_1;                          /*!<  HRPWMC_HXB4_1 Register,                      Address offset: 0x44  */
   __IO uint32_t HXB5_0;                          /*!<  HRPWMC_HXB5_0 Register,                      Address offset: 0x48  */
   __IO uint32_t HXB5_1;                          /*!<  HRPWMC_HXB5_1 Register,                      Address offset: 0x4C  */
   __IO uint32_t HXB7_0;                          /*!<  HRPWMC_HXB7_0 Register,                      Address offset: 0x50  */
   __IO uint32_t HXB7_1;                          /*!<  HRPWMC_HXB7_1 Register,                      Address offset: 0x54  */
   __IO uint32_t HXB8_0;                          /*!<  HRPWMC_HXB8_0 Register,                      Address offset: 0x58  */
   __IO uint32_t HXB8_1;                          /*!<  HRPWMC_HXB8_1 Register,                      Address offset: 0x5C  */
   __IO uint32_t HXB9_0;                          /*!<  HRPWMC_HXB9_0 Register,                      Address offset: 0x60  */
   __IO uint32_t HXB9_1;                          /*!<  HRPWMC_HXB9_1 Register,                      Address offset: 0x64  */
   __IO uint32_t HXB10_0;                         /*!<  HRPWMC_HXB10_0 Register,                     Address offset: 0x68  */
   __IO uint32_t HXB10_1;                         /*!<  HRPWMC_HXB10_1 Register,                     Address offset: 0x6C  */
   __IO uint32_t HXB11_0;                         /*!<  HRPWMC_HXB11_0 Register,                     Address offset: 0x70  */
   __IO uint32_t HXB11_1;                         /*!<  HRPWMC_HXB11_1 Register,                     Address offset: 0x74  */
   __IO uint32_t HXB12_0;                         /*!<  HRPWMC_HXB12_0 Register,                     Address offset: 0x78  */
   __IO uint32_t HXB12_1;                         /*!<  HRPWMC_HXB12_1 Register,                     Address offset: 0x7C  */
   __IO uint32_t HXB4_MUX;                        /*!<  HRPWMC_HXB4_MUX Register,                    Address offset: 0x80  */
   __IO uint32_t HXB5_MUX;                        /*!<  HRPWMC_HXB5_MUX Register,                    Address offset: 0x84  */
   __IO uint32_t HXB7_MUX;                        /*!<  HRPWMC_HXB7_MUX Register,                    Address offset: 0x88  */
   __IO uint32_t HXB8_MUX;                        /*!<  HRPWMC_HXB8_MUX Register,                    Address offset: 0x8C  */
   __IO uint32_t HXB9_MUX;                        /*!<  HRPWMC_HXB9_MUX Register,                    Address offset: 0x90  */
   __IO uint32_t HXB10_MUX;                       /*!<  HRPWMC_HXB10_MUX Register,                   Address offset: 0x94  */
   __IO uint32_t HXB11_MUX;                       /*!<  HRPWMC_HXB11_MUX Register,                   Address offset: 0x98  */
   __IO uint32_t HXB12_MUX;                       /*!<  HRPWMC_HXB12_MUX Register,                   Address offset: 0x9C  */
   __IO uint32_t HXB_POL;                         /*!<  HRPWMC_HXB_POL Register,                     Address offset: 0xA0  */
   __IO uint32_t HXB_LOCK;                        /*!<  HRPWMC_HXB_LOCK Register,                    Address offset: 0xA4  */
   __IO uint32_t RESERVED2[6];                     
   __IO uint32_t SYNCI_SEL1_4;                    /*!<  HRPWMC_SYNCI_SEL1_4 Register,                Address offset: 0xC0  */
   __IO uint32_t SYNCI_SEL5_6;                    /*!<  HRPWMC_SYNCI_SEL5_6 Register,                Address offset: 0xC4  */
   __IO uint32_t SYNCO_SEL1_4;                    /*!<  HRPWMC_SYNCO_SEL1_4 Register,                Address offset: 0xC8  */
   __IO uint32_t SYNCO_SEL5_6;                    /*!<  HRPWMC_SYNCO_SEL5_6 Register,                Address offset: 0xCC  */
   __IO uint32_t ADCOUT;                          /*!<  HRPWMC_ADCOUT Register,                      Address offset: 0xD0  */
   __IO uint32_t SCOUT_CFG;                       /*!<  HRPWMC_SCOUT_CFG Register,                   Address offset: 0xD4  */
   __IO uint32_t SYNCSOCLOCK;                     /*!<  HRPWMC_SYNCSOCLOCK Register,                 Address offset: 0xD8  */
   __IO uint32_t EALLOW;                          /*!<  HRPWMC_EALLOW Register,                      Address offset: 0xDC  */
   __IO uint32_t CLKEN;                           /*!<  HRPWMC_CLKEN Register,                       Address offset: 0xE0  */
   __IO uint32_t RESERVED3[3];                     
   __IO uint32_t XBARFLG1;                        /*!<  HRPWMC_XBARFLG1 Register,                    Address offset: 0xF0  */
   __IO uint32_t XBARFLG2;                        /*!<  HRPWMC_XBARFLG2 Register,                    Address offset: 0xF4  */
   __IO uint32_t XBARCLR1;                        /*!<  HRPWMC_XBARCLR1 Register,                    Address offset: 0xF8  */
   __IO uint32_t XBARCLR2;                        /*!<  HRPWMC_XBARCLR2 Register,                    Address offset: 0xFC  */
   __IO uint32_t RESERVED4[188];                   
   __IO uint32_t FPGA_SFO_DBG;                    /*!<  HRPWMC_FPGA_SFO_DBG Register,                Address offset: 0x3F0  */
} HRPWMC_TypeDef;

/**
* @brief HRPWM Registers
*/
typedef struct
{
   __IO uint16_t TBCTL;                           /*!<  HRPWM_TBCTL Register,                        Address offset: 0x00  */
   __IO uint16_t TBCTL2;                          /*!<  HRPWM_TBCTL2 Register,                       Address offset: 0x02  */
   __IO uint16_t RESERVED1[2];                     
   __IO uint16_t TBCTR;                           /*!<  HRPWM_TBCTR Register,                        Address offset: 0x08  */
   __IO uint16_t TBSTS;                           /*!<  HRPWM_TBSTS Register,                        Address offset: 0x0A  */
   __IO uint16_t RESERVED2[2];                     
   __IO uint16_t CMPCTL;                          /*!<  HRPWM_CMPCTL Register,                       Address offset: 0x10  */
   __IO uint16_t CMPCTL2;                         /*!<  HRPWM_CMPCTL2 Register,                      Address offset: 0x12  */
   __IO uint16_t RESERVED3[2];                     
   __IO uint16_t DBCTL;                           /*!<  HRPWM_DBCTL Register,                        Address offset: 0x18  */
   __IO uint16_t DBCTL2;                          /*!<  HRPWM_DBCTL2 Register,                       Address offset: 0x1A  */
   __IO uint16_t RESERVED4[2];                     
   __IO uint16_t AQCTL;                           /*!<  HRPWM_AQCTL Register,                        Address offset: 0x20  */
   __IO uint16_t AQTSRCSEL;                       /*!<  HRPWM_AQTSRCSEL Register,                    Address offset: 0x22  */
   __IO uint16_t RESERVED5[2];                     
   __IO uint16_t PCCTL;                           /*!<  HRPWM_PCCTL Register,                        Address offset: 0x28  */
   __IO uint16_t RESERVED6[3];                     
   __IO uint16_t VCAPCTL;                         /*!<  HRPWM_VCAPCTL Register,                      Address offset: 0x30  */
   __IO uint16_t VCNTCFG;                         /*!<  HRPWM_VCNTCFG Register,                      Address offset: 0x32  */
   __IO uint16_t RESERVED7[6];                     
   __IO uint16_t HRCNFG;                          /*!<  HRPWM_HRCNFG Register,                       Address offset: 0x40  */
   __IO uint16_t HRPWR;                           /*!<  HRPWM_HRPWR Register,                        Address offset: 0x42  */
   __IO uint16_t RESERVED8[4];                     
   __IO uint16_t HRMSTEP;                         /*!<  HRPWM_HRMSTEP Register,                      Address offset: 0x4C  */
   __IO uint16_t HRCNFG2;                         /*!<  HRPWM_HRCNFG2 Register,                      Address offset: 0x4E  */
   __IO uint16_t RESERVED9[5];                     
   __IO uint16_t HRPCTL;                          /*!<  HRPWM_HRPCTL Register,                       Address offset: 0x5A  */
   __IO uint16_t TRREM;                           /*!<  HRPWM_TRREM Register,                        Address offset: 0x5C  */
   __IO uint16_t RESERVED10[5];                    
   __IO uint16_t GLDCTL;                          /*!<  HRPWM_GLDCTL Register,                       Address offset: 0x68  */
   __IO uint16_t GLDCFG;                          /*!<  HRPWM_GLDCFG Register,                       Address offset: 0x6A  */
   __IO uint16_t RESERVED11[2];                    
   __IO uint32_t PWMXLINK;                        /*!<  HRPWM_PWMXLINK Register,                     Address offset: 0x70  */
   __IO uint32_t RESERVED12[3];                    
   __IO uint16_t AQCTLA;                          /*!<  HRPWM_AQCTLA Register,                       Address offset: 0x80  */
   __IO uint16_t AQCTLA2;                         /*!<  HRPWM_AQCTLA2 Register,                      Address offset: 0x82  */
   __IO uint16_t AQCTLB;                          /*!<  HRPWM_AQCTLB Register,                       Address offset: 0x84  */
   __IO uint16_t AQCTLB2;                         /*!<  HRPWM_AQCTLB2 Register,                      Address offset: 0x86  */
   __IO uint16_t RESERVED13[3];                    
   __IO uint16_t AQSFRC;                          /*!<  HRPWM_AQSFRC Register,                       Address offset: 0x8E  */
   __IO uint16_t RESERVED14;                       
   __IO uint16_t AQCSPFRC;                        /*!<  HRPWM_AQCSPFRC Register,                     Address offset: 0x92  */
   __IO uint16_t RESERVED15[6];                    
   __IO uint16_t DBREDHR;                         /*!<  HRPWM_DBREDHR Register,                      Address offset: 0xA0  */
   __IO uint16_t DBRED;                           /*!<  HRPWM_DBRED Register,                        Address offset: 0xA2  */
   __IO uint16_t DBFEDHR;                         /*!<  HRPWM_DBFEDHR Register,                      Address offset: 0xA4  */
   __IO uint16_t DBFED;                           /*!<  HRPWM_DBFED Register,                        Address offset: 0xA6  */
   __IO uint16_t RESERVED16[12];                   
   __IO uint32_t TBPHS;                           /*!<  HRPWM_TBPHS Register,                        Address offset: 0xC0  */
   __IO uint16_t TBPRDHR;                         /*!<  HRPWM_TBPRDHR Register,                      Address offset: 0xC4  */
   __IO uint16_t TBPRD;                           /*!<  HRPWM_TBPRD Register,                        Address offset: 0xC6  */
   __IO uint16_t RESERVED17[6];                    
   __IO uint32_t CMPA;                            /*!<  HRPWM_CMPA Register,                         Address offset: 0xD4  */
   __IO uint32_t CMPB;                            /*!<  HRPWM_CMPB Register,                         Address offset: 0xD8  */
   __IO uint16_t RESERVED18[1];                    
   __IO uint16_t CMPC;                            /*!<  HRPWM_CMPC Register,                         Address offset: 0xDE  */
   __IO uint16_t RESERVED19;                       
   __IO uint16_t CMPD;                            /*!<  HRPWM_CMPD Register,                         Address offset: 0xE2  */
   __IO uint16_t RESERVED20[2];                    
   __IO uint16_t GLDCTL2;                         /*!<  HRPWM_GLDCTL2 Register,                      Address offset: 0xE8  */
   __IO uint16_t RESERVED21[2];                    
   __IO uint16_t SWVDELVAL;                       /*!<  HRPWM_SWVDELVAL Register,                    Address offset: 0xEE  */
   __IO uint16_t RESERVED22[8];                    
   __IO uint16_t TZSEL;                           /*!<  HRPWM_TZSEL Register,                        Address offset: 0x100  */
   __IO uint16_t RESERVED23;                       
   __IO uint16_t TZDCSEL;                         /*!<  HRPWM_TZDCSEL Register,                      Address offset: 0x104  */
   __IO uint16_t RESERVED24;                       
   __IO uint16_t TZCTL;                           /*!<  HRPWM_TZCTL Register,                        Address offset: 0x108  */
   __IO uint16_t TZCTL2;                          /*!<  HRPWM_TZCTL2 Register,                       Address offset: 0x10A  */
   __IO uint16_t TZCTLDCA;                        /*!<  HRPWM_TZCTLDCA Register,                     Address offset: 0x10C  */
   __IO uint16_t TZCTLDCB;                        /*!<  HRPWM_TZCTLDCB Register,                     Address offset: 0x10E  */
   __IO uint16_t RESERVED25[5];                    
   __IO uint16_t TZEINT;                          /*!<  HRPWM_TZEINT Register,                       Address offset: 0x11A  */
   __IO uint16_t RESERVED26[5];                    
   __IO uint16_t TZFLG;                           /*!<  HRPWM_TZFLG Register,                        Address offset: 0x126  */
   __IO uint16_t TZCBCFLG;                        /*!<  HRPWM_TZCBCFLG Register,                     Address offset: 0x128  */
   __IO uint16_t TZOSTFLG;                        /*!<  HRPWM_TZOSTFLG Register,                     Address offset: 0x12A  */
   __IO uint16_t RESERVED27;                       
   __IO uint16_t TZCLR;                           /*!<  HRPWM_TZCLR Register,                        Address offset: 0x12E  */
   __IO uint16_t TZCBCCLR;                        /*!<  HRPWM_TZCBCCLR Register,                     Address offset: 0x130  */
   __IO uint16_t TZOSTCLR;                        /*!<  HRPWM_TZOSTCLR Register,                     Address offset: 0x132  */
   __IO uint16_t RESERVED28;                       
   __IO uint16_t TZFRC;                           /*!<  HRPWM_TZFRC Register,                        Address offset: 0x136  */
   __IO uint16_t RESERVED29[8];                    
   __IO uint16_t ETSEL;                           /*!<  HRPWM_ETSEL Register,                        Address offset: 0x148  */
   __IO uint16_t RESERVED30;                       
   __IO uint16_t ETPS;                            /*!<  HRPWM_ETPS Register,                         Address offset: 0x14C  */
   __IO uint16_t RESERVED31;                       
   __IO uint16_t ETFLG;                           /*!<  HRPWM_ETFLG Register,                        Address offset: 0x150  */
   __IO uint16_t RESERVED32;                       
   __IO uint16_t ETCLR;                           /*!<  HRPWM_ETCLR Register,                        Address offset: 0x154  */
   __IO uint16_t RESERVED33;                       
   __IO uint16_t ETFRC;                           /*!<  HRPWM_ETFRC Register,                        Address offset: 0x158  */
   __IO uint16_t RESERVED34;                       
   __IO uint16_t ETINTPS;                         /*!<  HRPWM_ETINTPS Register,                      Address offset: 0x15C  */
   __IO uint16_t RESERVED35;                       
   __IO uint16_t ETSOCPS;                         /*!<  HRPWM_ETSOCPS Register,                      Address offset: 0x160  */
   __IO uint16_t RESERVED36;                       
   __IO uint16_t ETCNTINITCTL;                    /*!<  HRPWM_ETCNTINITCTL Register,                 Address offset: 0x164  */
   __IO uint16_t RESERVED37;                       
   __IO uint16_t ETCNTINIT;                       /*!<  HRPWM_ETCNTINIT Register,                    Address offset: 0x168  */
   __IO uint16_t RESERVED38[11];                   
   __IO uint16_t DCTRIPSEL;                       /*!<  HRPWM_DCTRIPSEL Register,                    Address offset: 0x180  */
   __IO uint16_t RESERVED39[2];                    
   __IO uint16_t DCACTL;                          /*!<  HRPWM_DCACTL Register,                       Address offset: 0x186  */
   __IO uint16_t DCBCTL;                          /*!<  HRPWM_DCBCTL Register,                       Address offset: 0x188  */
   __IO uint16_t RESERVED40[2];                    
   __IO uint16_t DCFCTL;                          /*!<  HRPWM_DCFCTL Register,                       Address offset: 0x18E  */
   __IO uint16_t DCCAPCTL;                        /*!<  HRPWM_DCCAPCTL Register,                     Address offset: 0x190  */
   __IO uint16_t DCFOFFSET;                       /*!<  HRPWM_DCFOFFSET Register,                    Address offset: 0x192  */
   __IO uint16_t DCFOFFSETCNT;                    /*!<  HRPWM_DCFOFFSETCNT Register,                 Address offset: 0x194  */
   __IO uint16_t DCFWINDOW;                       /*!<  HRPWM_DCFWINDOW Register,                    Address offset: 0x196  */
   __IO uint16_t DCFWINDOWCNT;                    /*!<  HRPWM_DCFWINDOWCNT Register,                 Address offset: 0x198  */
   __IO uint16_t RESERVED41[2];                    
   __IO uint16_t DCCAP;                           /*!<  HRPWM_DCCAP Register,                        Address offset: 0x19E  */
   __IO uint16_t RESERVED42[2];                    
   __IO uint16_t DCAHTRIPSEL;                     /*!<  HRPWM_DCAHTRIPSEL Register,                  Address offset: 0x1A4  */
   __IO uint16_t DCALTRIPSEL;                     /*!<  HRPWM_DCALTRIPSEL Register,                  Address offset: 0x1A6  */
   __IO uint16_t DCBHTRIPSEL;                     /*!<  HRPWM_DCBHTRIPSEL Register,                  Address offset: 0x1A8  */
   __IO uint16_t DCBLTRIPSEL;                     /*!<  HRPWM_DCBLTRIPSEL Register,                  Address offset: 0x1AA  */
   __IO uint16_t RESERVED43[36];                   
   __IO uint32_t PWMLOCK;                         /*!<  HRPWM_PWMLOCK Register,                      Address offset: 0x1F4  */
   __IO uint16_t RESERVED44[1];                    
   __IO uint16_t HWVDELVAL;                       /*!<  HRPWM_HWVDELVAL Register,                    Address offset: 0x1FA  */
   __IO uint16_t VCNTVAL;                         /*!<  HRPWM_VCNTVAL Register,                      Address offset: 0x1FC  */
} HRPWM_TypeDef;

/*!< Peripheral memory map */
#define FLASH_BASE            (0x08000000UL)                         /*!< FLASH base address */
#define FLASH_END             (0x0803FFFFUL)                         /*!< FLASH end address */
#define FLASH_SIZE            (FLASH_END - FLASH_BASE + 1)
#define FLASH_PAGE_SIZE       (0x00000080UL)                         /*!< FLASH Page Size, 128 Bytes */
#define FLASH_PAGE_NB         (FLASH_SIZE / FLASH_PAGE_SIZE)
#define FLASH_SECTOR_SIZE     (0x00001000UL)                         /*!< FLASH Sector Size, 4096 Bytes */
#define FLASH_SECTOR_NB       (FLASH_SIZE / FLASH_SECTOR_SIZE)
#define SRAM1_BASE            (0x20000000UL)                         /*!< SRAM1(up to 96 KB) base address */
#define PERIPH_BASE           (0x40000000UL)                         /*!< Peripheral base address */
#define SRAM1_BB_BASE         (0x22000000UL)                         /*!< SRAM1(96 KB) base address in the bit-band region */
#define PERIPH_BB_BASE        (0x42000000UL)                         /*!< Peripheral base address in the bit-band region */
#define OB_BASE               (0x1FFF1B00UL)                         /*!< Flash Option Bytes base address */
#define UID_BASE              (0x1FFF1380UL)                         /*!< Unique device ID register base address */
#define OTP_BASE              (0x1FFF1080UL)

