breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/* Legacy defines */
#define SRAM_BASE             SRAM1_BASE

#define APB1PERIPH_BASE                        PERIPH_BASE
#define APB2PERIPH_BASE                        (PERIPH_BASE + 0x00010000UL)
#define AHBPERIPH_BASE                         (PERIPH_BASE + 0x00020000UL)

/*!< APB1 peripherals */
#define TIM2_BASE                              (0x40000000UL)
#define TIM3_BASE                              (0x40000400UL)
#define TIM6_BASE                              (0x40001000UL)
#define TIM7_BASE                              (0x40001400UL)
#define BKP_BASE                               (0x40002800UL)
#define WWDG_BASE                              (0x40002C00UL)
#define IWDG_BASE                              (0x40003000UL)
#define SPI2_BASE                              (0x40003800UL)
#define UART1_BASE                             (0x40004C00UL)
#define UART2_BASE                             (0x40005000UL)
#define I2C1_BASE                              (0x40005400UL)
#define I2C2_BASE                              (0x40005800UL)
#define PWR_BASE                               (0x40007000UL)
#define DAC_BASE                               (0x40007400UL)
#define LPTIM_BASE                             (0x40007C00UL)
#define LPUART1_BASE                           (0x40008000UL)
#define CANMEM_BASE                            (0x4000AC00UL)
#define CANM_BASE                              (0x4000CC00UL)

/*!< APB2 peripherals */
#define SYSCFG_BASE                            (0x40010000UL)
#define EXTI_BASE                              (0x40010400UL)
#define VREFBUF_BASE                           (0x40012000UL)
#define ADC1_BASE                              (0x40012400UL)
#define ADC_COMMON_BASE                        (ADC1_BASE + 0x00000308UL)
#define ADC2_BASE                              (0x40012800UL)
#define TIM1_BASE                              (0x40012C00UL)
#define SPI1_BASE                              (0x40013000UL)
#define TIM8_BASE                              (0x40013400UL)
#define USART1_BASE                            (0x40013800UL)
#define COMP1_BASE                             (0x40016C00UL)
#define COMP2_BASE                             (0x40016C10UL)
#define COMP3_BASE                             (0x40016C20UL)
#define COMP4_BASE                             (0x40016C30UL)
#define OPA_BASE                               (0x40017000UL)
#define OPA1_BASE                              (0x40017000UL)
#define OPA2_BASE                              (0x40017004UL)
#define OPA3_BASE                              (0x40017008UL)
#define OPA4_BASE                              (0x4001700CUL)
#define HRPWM1_BASE                            (0x40018000UL)
#define HRPWM2_BASE                            (0x40018400UL)
#define HRPWM3_BASE                            (0x40018800UL)
#define HRPWM4_BASE                            (0x40018C00UL)
#define HRPWM5_BASE                            (0x40019000UL)
#define HRPWM6_BASE                            (0x40019400UL)
#define HRPWMC_BASE                            (0x40019800UL)

/*!< AHB1 peripherals */
#define DMA1_BASE                              (AHBPERIPH_BASE + 0x00000000UL)
#define RCC_BASE                               (AHBPERIPH_BASE + 0x1000)
#define FLASH_R_BASE                           (AHBPERIPH_BASE + 0x2000) /*!< Flash registers base address */
#define CRC_BASE                               (AHBPERIPH_BASE + 0x3000)
#define GPIOA_BASE                             (AHBPERIPH_BASE + 0x4000)
#define GPIOB_BASE                             (AHBPERIPH_BASE + 0x4400)
#define GPIOC_BASE                             (AHBPERIPH_BASE + 0x4800)
#define GPIOD_BASE                             (AHBPERIPH_BASE + 0x4C00)

#define DMA1_Channel1_BASE                     (AHBPERIPH_BASE + 0x00000008UL)
#define DMA1_Channel2_BASE                     (AHBPERIPH_BASE + 0x0000001CUL)
#define DMA1_Channel3_BASE                     (AHBPERIPH_BASE + 0x00000030UL)
#define DMA1_Channel4_BASE                     (AHBPERIPH_BASE + 0x00000044UL)
#define DMA1_Channel5_BASE                     (AHBPERIPH_BASE + 0x00000058UL)

/* Debug MCU registers base address */
#define DBGMCU_BASE                            (0xE0042000UL)
#define DBGMCU                                 ((DBGMCU_TypeDef *) DBGMCU_BASE)
#define OB                                     ((OB_TypeDef *) OB_BASE)

/* APB1 */
#define TIM2                                   ((TIM_TypeDef *) TIM2_BASE)
#define TIM3                                   ((TIM_TypeDef *) TIM3_BASE)
#define TIM6                                   ((TIM_TypeDef *) TIM6_BASE)
#define TIM7                                   ((TIM_TypeDef *) TIM7_BASE)
#define BKP                                    ((BKP_TypeDef *) BKP_BASE)
#define WWDG                                   ((WWDG_TypeDef *) WWDG_BASE)
#define IWDG                                   ((IWDG_TypeDef *) IWDG_BASE)
#define SPI2                                   ((SPI_TypeDef *) SPI2_BASE)
#define UART1                                  ((UART_TypeDef *) UART1_BASE)
#define UART2                                  ((UART_TypeDef *) UART2_BASE)
#define I2C1                                   ((I2C_TypeDef *) I2C1_BASE)
#define I2C2                                   ((I2C_TypeDef *) I2C2_BASE)
#define PWR                                    ((PWR_TypeDef *) PWR_BASE)
#define DAC                                    ((DAC_TypeDef *) DAC_BASE)
#define LPTIM                                  ((LPTIM_TypeDef *) LPTIM_BASE)
#define LPUART1                                ((LPUART_TypeDef *) LPUART1_BASE)
#define CAN                                    ((CAN_TypeDef *) CAN_BASE)

/* APB2 */
#define SYSCFG                                 ((SYSCFG_TypeDef *) SYSCFG_BASE)
#define EXTI                                   ((EXTI_TypeDef *) EXTI_BASE)
#define VREFBUF                                ((VREFBUF_TypeDef *) VREFBUF_BASE)
#define ADC1                                   ((ADC_TypeDef *) ADC1_BASE)
#define ADC_COMMON                             ((ADC_Common_TypeDef *) ADC_COMMON_BASE)
#define ADC2                                   ((ADC_TypeDef *) ADC2_BASE)
#define TIM1                                   ((TIM_TypeDef *) TIM1_BASE)
#define SPI1                                   ((SPI_TypeDef *) SPI1_BASE)
#define TIM8                                   ((TIM_TypeDef *) TIM8_BASE)
#define USART1                                 ((USART_TypeDef *) USART1_BASE)
#define COMP1                                  ((COMP_TypeDef *) COMP1_BASE)
#define COMP2                                  ((COMP_TypeDef *) COMP2_BASE)
#define COMP3                                  ((COMP_TypeDef *) COMP3_BASE)
#define COMP4                                  ((COMP_TypeDef *) COMP4_BASE)
#define COMP12_COMMON                          ((COMP_Common_TypeDef *) COMP1_BASE)
#define OPA                                    ((OPA_TypeDef *) OPA_BASE)
#define OPA1                                   ((OPA_TypeDef *) OPA1_BASE)
#define OPA2                                   ((OPA_TypeDef *) OPA2_BASE)
#define OPA3                                   ((OPA_TypeDef *) OPA3_BASE)
#define OPA4                                   ((OPA_TypeDef *) OPA4_BASE)
#define HRPWM1                                 ((HRPWM_TypeDef *) HRPWM1_BASE)
#define HRPWM2                                 ((HRPWM_TypeDef *) HRPWM2_BASE)
#define HRPWM3                                 ((HRPWM_TypeDef *) HRPWM3_BASE)
#define HRPWM4                                 ((HRPWM_TypeDef *) HRPWM4_BASE)
#define HRPWM5                                 ((HRPWM_TypeDef *) HRPWM5_BASE)
#define HRPWM6                                 ((HRPWM_TypeDef *) HRPWM6_BASE)
#define HRPWMC                                 ((HRPWMC_TypeDef *) HRPWMC_BASE)

