breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************************************************************************************************/
/********************************* RCC ******************************************************************************/
/********************************************************************************************************************/
#define RCC_HSE_SUPPORT
#define RCC_LSE_SUPPORT
#define RCC_PLL_SUPPORT


#define RCC_CFGR_SW_HSISYS                        (0x00000000U)                                     /*!< HSI selected as system clock */
#define RCC_CFGR_SW_HSE                           (0x00000001U)                                     /*!< HSE selected as system clock */
#define RCC_CFGR_SW_PLL                           (0x00000002U)
#define RCC_CFGR_SW_LSI                           (0x00000003U)
#define RCC_CFGR_SW_LSE                           (0x00000004U)
#define RCC_CFGR_SW_MSISYS                        (0x00000005U)

#define RCC_CFGR_SWS_HSISYS                       (0x00000000U)                                     /*!< HSISYS used as system clock */
#define RCC_CFGR_SWS_HSE                          (0x00000008U)                                     /*!< HSE used as system clock */
#define RCC_CFGR_SWS_PLL                          (0x00000010U)                                     /*!< PLL used as system clock */
#define RCC_CFGR_SWS_LSI                          (0x00000018U)                                     /*!< LSI used as system clock */
#define RCC_CFGR_SWS_LSE                          (0x00000020U)                                     /*!< LSE used as system clock */
#define RCC_CFGR_SWS_MSISYS                       (0x00000028U)                                     /*!< MSISYS used as system clock */

#define SPI_I2S_SUPPORT       /*!< I2S support */



/********************************* Bit definition for TIM_CCMR1 register *******************************************/
#define TIM_CCMR1_CC1S_Pos                       (0U)
#define TIM_CCMR1_CC1S_Msk                       (0x3UL<<TIM_CCMR1_CC1S_Pos)                      /*!< 0x00000003 */
#define TIM_CCMR1_CC1S                           TIM_CCMR1_CC1S_Msk
#define TIM_CCMR1_CC1S_0                         (0x1UL<<TIM_CCMR1_CC1S_Pos)                      /*!< 0x00000001 */
#define TIM_CCMR1_CC1S_1                         (0x2UL<<TIM_CCMR1_CC1S_Pos)                      /*!< 0x00000002 */
#define TIM_CCMR1_OC1FE_Pos                      (2U)
#define TIM_CCMR1_OC1FE_Msk                      (0x1UL<<TIM_CCMR1_OC1FE_Pos)                     /*!< 0x00000004 */
#define TIM_CCMR1_OC1FE                          TIM_CCMR1_OC1FE_Msk                              
#define TIM_CCMR1_OC1PE_Pos                      (3U)
#define TIM_CCMR1_OC1PE_Msk                      (0x1UL<<TIM_CCMR1_OC1PE_Pos)                     /*!< 0x00000008 */
#define TIM_CCMR1_OC1PE                          TIM_CCMR1_OC1PE_Msk                              
#define TIM_CCMR1_OC1M_Pos                       (4U)
#define TIM_CCMR1_OC1M_Msk                       (0x1007UL<<TIM_CCMR1_OC1M_Pos)                   /*!< 0x00010070 */
#define TIM_CCMR1_OC1M                           TIM_CCMR1_OC1M_Msk
#define TIM_CCMR1_OC1M_0                         (0x1UL<<TIM_CCMR1_OC1M_Pos)                      /*!< 0x00000010 */
#define TIM_CCMR1_OC1M_1                         (0x2UL<<TIM_CCMR1_OC1M_Pos)                      /*!< 0x00000020 */
#define TIM_CCMR1_OC1M_2                         (0x4UL<<TIM_CCMR1_OC1M_Pos)                      /*!< 0x00000040 */
#define TIM_CCMR1_OC1M_3                         (0x1000UL<<TIM_CCMR1_OC1M_Pos)                   /*!< 0x00010000 */
#define TIM_CCMR1_OC1CE_Pos                      (7U)
#define TIM_CCMR1_OC1CE_Msk                      (0x1UL<<TIM_CCMR1_OC1CE_Pos)                     /*!< 0x00000080 */
#define TIM_CCMR1_OC1CE                          TIM_CCMR1_OC1CE_Msk                              
#define TIM_CCMR1_CC2S_Pos                       (8U)
#define TIM_CCMR1_CC2S_Msk                       (0x3UL<<TIM_CCMR1_CC2S_Pos)                      /*!< 0x00000300 */
#define TIM_CCMR1_CC2S                           TIM_CCMR1_CC2S_Msk
#define TIM_CCMR1_CC2S_0                         (0x1UL<<TIM_CCMR1_CC2S_Pos)                      /*!< 0x00000100 */
#define TIM_CCMR1_CC2S_1                         (0x2UL<<TIM_CCMR1_CC2S_Pos)                      /*!< 0x00000200 */
#define TIM_CCMR1_OC2FE_Pos                      (10U)
#define TIM_CCMR1_OC2FE_Msk                      (0x1UL<<TIM_CCMR1_OC2FE_Pos)                     /*!< 0x00000400 */
#define TIM_CCMR1_OC2FE                          TIM_CCMR1_OC2FE_Msk                              
#define TIM_CCMR1_OC2PE_Pos                      (11U)
#define TIM_CCMR1_OC2PE_Msk                      (0x1UL<<TIM_CCMR1_OC2PE_Pos)                     /*!< 0x00000800 */
#define TIM_CCMR1_OC2PE                          TIM_CCMR1_OC2PE_Msk                              
#define TIM_CCMR1_OC2M_Pos                       (12U)
#define TIM_CCMR1_OC2M_Msk                       (0x1007UL<<TIM_CCMR1_OC2M_Pos)                   /*!< 0x01007000 */
#define TIM_CCMR1_OC2M                           TIM_CCMR1_OC2M_Msk
#define TIM_CCMR1_OC2M_0                         (0x1UL<<TIM_CCMR1_OC2M_Pos)                      /*!< 0x00001000 */
#define TIM_CCMR1_OC2M_1                         (0x2UL<<TIM_CCMR1_OC2M_Pos)                      /*!< 0x00002000 */
#define TIM_CCMR1_OC2M_2                         (0x4UL<<TIM_CCMR1_OC2M_Pos)                      /*!< 0x00004000 */
#define TIM_CCMR1_OC2M_3                         (0x1000UL<<TIM_CCMR1_OC2M_Pos)                   /*!< 0x01000000 */
#define TIM_CCMR1_OC2CE_Pos                      (15U)
#define TIM_CCMR1_OC2CE_Msk                      (0x1UL<<TIM_CCMR1_OC2CE_Pos)                     /*!< 0x00008000 */
#define TIM_CCMR1_OC2CE                          TIM_CCMR1_OC2CE_Msk                              
#define TIM_CCMR1_CC1S_Pos                       (0U)
#define TIM_CCMR1_CC1S_Msk                       (0x3UL<<TIM_CCMR1_CC1S_Pos)                      /*!< 0x00000003 */
#define TIM_CCMR1_CC1S                           TIM_CCMR1_CC1S_Msk
#define TIM_CCMR1_CC1S_0                         (0x1UL<<TIM_CCMR1_CC1S_Pos)                      /*!< 0x00000001 */
#define TIM_CCMR1_CC1S_1                         (0x2UL<<TIM_CCMR1_CC1S_Pos)                      /*!< 0x00000002 */
#define TIM_CCMR1_IC1PSC_Pos                     (2U)
#define TIM_CCMR1_IC1PSC_Msk                     (0x3UL<<TIM_CCMR1_IC1PSC_Pos)                    /*!< 0x0000000C */
#define TIM_CCMR1_IC1PSC                         TIM_CCMR1_IC1PSC_Msk
#define TIM_CCMR1_IC1PSC_0                       (0x1UL<<TIM_CCMR1_IC1PSC_Pos)                    /*!< 0x00000004 */
#define TIM_CCMR1_IC1PSC_1                       (0x2UL<<TIM_CCMR1_IC1PSC_Pos)                    /*!< 0x00000008 */
#define TIM_CCMR1_IC1F_Pos                       (4U)
#define TIM_CCMR1_IC1F_Msk                       (0xFUL<<TIM_CCMR1_IC1F_Pos)                      /*!< 0x000000F0 */
#define TIM_CCMR1_IC1F                           TIM_CCMR1_IC1F_Msk
#define TIM_CCMR1_IC1F_0                         (0x1UL<<TIM_CCMR1_IC1F_Pos)                      /*!< 0x00000010 */
#define TIM_CCMR1_IC1F_1                         (0x2UL<<TIM_CCMR1_IC1F_Pos)                      /*!< 0x00000020 */
#define TIM_CCMR1_IC1F_2                         (0x4UL<<TIM_CCMR1_IC1F_Pos)                      /*!< 0x00000040 */
#define TIM_CCMR1_IC1F_3                         (0x8UL<<TIM_CCMR1_IC1F_Pos)                      /*!< 0x00000080 */
#define TIM_CCMR1_CC2S_Pos                       (8U)
#define TIM_CCMR1_CC2S_Msk                       (0x3UL<<TIM_CCMR1_CC2S_Pos)                      /*!< 0x00000300 */
#define TIM_CCMR1_CC2S                           TIM_CCMR1_CC2S_Msk
#define TIM_CCMR1_CC2S_0                         (0x1UL<<TIM_CCMR1_CC2S_Pos)                      /*!< 0x00000100 */
#define TIM_CCMR1_CC2S_1                         (0x2UL<<TIM_CCMR1_CC2S_Pos)                      /*!< 0x00000200 */
#define TIM_CCMR1_IC2PSC_Pos                     (10U)
#define TIM_CCMR1_IC2PSC_Msk                     (0x3UL<<TIM_CCMR1_IC2PSC_Pos)                    /*!< 0x00000C00 */
#define TIM_CCMR1_IC2PSC                         TIM_CCMR1_IC2PSC_Msk
#define TIM_CCMR1_IC2PSC_0                       (0x1UL<<TIM_CCMR1_IC2PSC_Pos)                    /*!< 0x00000400 */
#define TIM_CCMR1_IC2PSC_1                       (0x2UL<<TIM_CCMR1_IC2PSC_Pos)                    /*!< 0x00000800 */
#define TIM_CCMR1_IC2F_Pos                       (12U)
#define TIM_CCMR1_IC2F_Msk                       (0xFUL<<TIM_CCMR1_IC2F_Pos)                      /*!< 0x0000F000 */
#define TIM_CCMR1_IC2F                           TIM_CCMR1_IC2F_Msk
#define TIM_CCMR1_IC2F_0                         (0x1UL<<TIM_CCMR1_IC2F_Pos)                      /*!< 0x00001000 */
#define TIM_CCMR1_IC2F_1                         (0x2UL<<TIM_CCMR1_IC2F_Pos)                      /*!< 0x00002000 */
#define TIM_CCMR1_IC2F_2                         (0x4UL<<TIM_CCMR1_IC2F_Pos)                      /*!< 0x00004000 */
#define TIM_CCMR1_IC2F_3                         (0x8UL<<TIM_CCMR1_IC2F_Pos)                      /*!< 0x00008000 */

