breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for TIM_CCMR2 register ********************************************/
#define TIM_CCMR2_CC3S_Pos                        (0U)
#define TIM_CCMR2_CC3S_Msk                        (0x3UL<<TIM_CCMR2_CC3S_Pos)                       /*!< 0x00000003 */
#define TIM_CCMR2_CC3S                            TIM_CCMR2_CC3S_Msk
#define TIM_CCMR2_CC3S_0                          (0x1UL<<TIM_CCMR2_CC3S_Pos)                       /*!< 0x00000001 */
#define TIM_CCMR2_CC3S_1                          (0x2UL<<TIM_CCMR2_CC3S_Pos)                       /*!< 0x00000002 */
#define TIM_CCMR2_OC3FE_Pos                       (2U)
#define TIM_CCMR2_OC3FE_Msk                       (0x1UL<<TIM_CCMR2_OC3FE_Pos)                      /*!< 0x00000004 */
#define TIM_CCMR2_OC3FE                           TIM_CCMR2_OC3FE_Msk                               
#define TIM_CCMR2_OC3PE_Pos                       (3U)
#define TIM_CCMR2_OC3PE_Msk                       (0x1UL<<TIM_CCMR2_OC3PE_Pos)                      /*!< 0x00000008 */
#define TIM_CCMR2_OC3PE                           TIM_CCMR2_OC3PE_Msk                               
#define TIM_CCMR2_OC3M_Pos                        (4U)
#define TIM_CCMR2_OC3M_Msk                        (0x1007UL<<TIM_CCMR2_OC3M_Pos)                    /*!< 0x00000070 */
#define TIM_CCMR2_OC3M                            TIM_CCMR2_OC3M_Msk
#define TIM_CCMR2_OC3M_0                          (0x1UL<<TIM_CCMR2_OC3M_Pos)                       /*!< 0x00000010 */
#define TIM_CCMR2_OC3M_1                          (0x2UL<<TIM_CCMR2_OC3M_Pos)                       /*!< 0x00000020 */
#define TIM_CCMR2_OC3M_2                          (0x4UL<<TIM_CCMR2_OC3M_Pos)                       /*!< 0x00000040 */
#define TIM_CCMR2_OC3M_3                          (0x1000UL<<TIM_CCMR2_OC3M_Pos)                    /*!< 0x00010000 */
#define TIM_CCMR2_OC3CE_Pos                       (7U)
#define TIM_CCMR2_OC3CE_Msk                       (0x1UL<<TIM_CCMR2_OC3CE_Pos)                      /*!< 0x00000080 */
#define TIM_CCMR2_OC3CE                           TIM_CCMR2_OC3CE_Msk                               
#define TIM_CCMR2_CC4S_Pos                        (8U)
#define TIM_CCMR2_CC4S_Msk                        (0x3UL<<TIM_CCMR2_CC4S_Pos)                       /*!< 0x00000300 */
#define TIM_CCMR2_CC4S                            TIM_CCMR2_CC4S_Msk
#define TIM_CCMR2_CC4S_0                          (0x1UL<<TIM_CCMR2_CC4S_Pos)                       /*!< 0x00000100 */
#define TIM_CCMR2_CC4S_1                          (0x2UL<<TIM_CCMR2_CC4S_Pos)                       /*!< 0x00000200 */
#define TIM_CCMR2_OC4FE_Pos                       (10U)
#define TIM_CCMR2_OC4FE_Msk                       (0x1UL<<TIM_CCMR2_OC4FE_Pos)                      /*!< 0x00000400 */
#define TIM_CCMR2_OC4FE                           TIM_CCMR2_OC4FE_Msk                               
#define TIM_CCMR2_OC4PE_Pos                       (11U)
#define TIM_CCMR2_OC4PE_Msk                       (0x1UL<<TIM_CCMR2_OC4PE_Pos)                      /*!< 0x00000800 */
#define TIM_CCMR2_OC4PE                           TIM_CCMR2_OC4PE_Msk                               
#define TIM_CCMR2_OC4M_Pos                        (12U)
#define TIM_CCMR2_OC4M_Msk                        (0x1007UL<<TIM_CCMR2_OC4M_Pos)                    /*!< 0x01007000 */
#define TIM_CCMR2_OC4M                            TIM_CCMR2_OC4M_Msk
#define TIM_CCMR2_OC4M_0                          (0x1UL<<TIM_CCMR2_OC4M_Pos)                       /*!< 0x00001000 */
#define TIM_CCMR2_OC4M_1                          (0x2UL<<TIM_CCMR2_OC4M_Pos)                       /*!< 0x00002000 */
#define TIM_CCMR2_OC4M_2                          (0x4UL<<TIM_CCMR2_OC4M_Pos)                       /*!< 0x00004000 */
#define TIM_CCMR2_OC4M_3                          (0x1000UL<<TIM_CCMR2_OC4M_Pos)                    /*!< 0x01000000 */
#define TIM_CCMR2_OC4CE_Pos                       (15U)
#define TIM_CCMR2_OC4CE_Msk                       (0x1UL<<TIM_CCMR2_OC4CE_Pos)                      /*!< 0x00008000 */
#define TIM_CCMR2_OC4CE                           TIM_CCMR2_OC4CE_Msk                               
#define TIM_CCMR2_CC3S_Pos                        (0U)
#define TIM_CCMR2_CC3S_Msk                        (0x3UL<<TIM_CCMR2_CC3S_Pos)                       /*!< 0x00000003 */
#define TIM_CCMR2_CC3S                            TIM_CCMR2_CC3S_Msk
#define TIM_CCMR2_CC3S_0                          (0x1UL<<TIM_CCMR2_CC3S_Pos)                       /*!< 0x00000001 */
#define TIM_CCMR2_CC3S_1                          (0x2UL<<TIM_CCMR2_CC3S_Pos)                       /*!< 0x00000002 */
#define TIM_CCMR2_IC3PSC_Pos                      (2U)
#define TIM_CCMR2_IC3PSC_Msk                      (0x3UL<<TIM_CCMR2_IC3PSC_Pos)                     /*!< 0x0000000C */
#define TIM_CCMR2_IC3PSC                          TIM_CCMR2_IC3PSC_Msk
#define TIM_CCMR2_IC3PSC_0                        (0x1UL<<TIM_CCMR2_IC3PSC_Pos)                     /*!< 0x00000004 */
#define TIM_CCMR2_IC3PSC_1                        (0x2UL<<TIM_CCMR2_IC3PSC_Pos)                     /*!< 0x00000008 */
#define TIM_CCMR2_IC3F_Pos                        (4U)
#define TIM_CCMR2_IC3F_Msk                        (0xFUL<<TIM_CCMR2_IC3F_Pos)                       /*!< 0x000000F0 */
#define TIM_CCMR2_IC3F                            TIM_CCMR2_IC3F_Msk
#define TIM_CCMR2_IC3F_0                          (0x1UL<<TIM_CCMR2_IC3F_Pos)                       /*!< 0x00000010 */
#define TIM_CCMR2_IC3F_1                          (0x2UL<<TIM_CCMR2_IC3F_Pos)                       /*!< 0x00000020 */
#define TIM_CCMR2_IC3F_2                          (0x4UL<<TIM_CCMR2_IC3F_Pos)                       /*!< 0x00000040 */
#define TIM_CCMR2_IC3F_3                          (0x8UL<<TIM_CCMR2_IC3F_Pos)                       /*!< 0x00000080 */
#define TIM_CCMR2_CC4S_Pos                        (8U)
#define TIM_CCMR2_CC4S_Msk                        (0x3UL<<TIM_CCMR2_CC4S_Pos)                       /*!< 0x00000300 */
#define TIM_CCMR2_CC4S                            TIM_CCMR2_CC4S_Msk
#define TIM_CCMR2_CC4S_0                          (0x1UL<<TIM_CCMR2_CC4S_Pos)                       /*!< 0x00000100 */
#define TIM_CCMR2_CC4S_1                          (0x2UL<<TIM_CCMR2_CC4S_Pos)                       /*!< 0x00000200 */
#define TIM_CCMR2_IC4PSC_Pos                      (10U)
#define TIM_CCMR2_IC4PSC_Msk                      (0x3UL<<TIM_CCMR2_IC4PSC_Pos)                     /*!< 0x00000C00 */
#define TIM_CCMR2_IC4PSC                          TIM_CCMR2_IC4PSC_Msk
#define TIM_CCMR2_IC4PSC_0                        (0x1UL<<TIM_CCMR2_IC4PSC_Pos)                     /*!< 0x00000400 */
#define TIM_CCMR2_IC4PSC_1                        (0x2UL<<TIM_CCMR2_IC4PSC_Pos)                     /*!< 0x00000800 */
#define TIM_CCMR2_IC4F_Pos                        (12U)
#define TIM_CCMR2_IC4F_Msk                        (0xFUL<<TIM_CCMR2_IC4F_Pos)                       /*!< 0x0000F000 */
#define TIM_CCMR2_IC4F                            TIM_CCMR2_IC4F_Msk
#define TIM_CCMR2_IC4F_0                          (0x1UL<<TIM_CCMR2_IC4F_Pos)                       /*!< 0x00001000 */
#define TIM_CCMR2_IC4F_1                          (0x2UL<<TIM_CCMR2_IC4F_Pos)                       /*!< 0x00002000 */
#define TIM_CCMR2_IC4F_2                          (0x4UL<<TIM_CCMR2_IC4F_Pos)                       /*!< 0x00004000 */
#define TIM_CCMR2_IC4F_3                          (0x8UL<<TIM_CCMR2_IC4F_Pos)                       /*!< 0x00008000 */


















