breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for FLASH_CR register *********************************************/
#define FLASH_CR_PG_Pos                           (0U)
#define FLASH_CR_PG_Msk                           (0x1UL<<FLASH_CR_PG_Pos)                          /*!< 0x00000001 */
#define FLASH_CR_PG                               FLASH_CR_PG_Msk                                   /*!< Page Program */
#define FLASH_CR_PER_Pos                          (1U)
#define FLASH_CR_PER_Msk                          (0x1UL<<FLASH_CR_PER_Pos)                         /*!< 0x00000002 */
#define FLASH_CR_PER                              FLASH_CR_PER_Msk                                  /*!< Page Erase */
#define FLASH_CR_MER_Pos                          (2U)
#define FLASH_CR_MER_Msk                          (0x1UL<<FLASH_CR_MER_Pos)                         /*!< 0x00000004 */
#define FLASH_CR_MER                              FLASH_CR_MER_Msk                                  /*!< Bank 0 Mass Erase */
#define FLASH_CR_UPG_Pos                          (4U)
#define FLASH_CR_UPG_Msk                          (0x1UL<<FLASH_CR_UPG_Pos)                         /*!< 0x00000010 */
#define FLASH_CR_UPG                              FLASH_CR_UPG_Msk                                  /*!< User data��Program */
#define FLASH_CR_UPER_Pos                         (5U)
#define FLASH_CR_UPER_Msk                         (0x1UL<<FLASH_CR_UPER_Pos)                        /*!< 0x00000020 */
#define FLASH_CR_UPER                             FLASH_CR_UPER_Msk                                 /*!< User data Page erase */
#define FLASH_CR_SER_Pos                          (11U)
#define FLASH_CR_SER_Msk                          (0x1UL<<FLASH_CR_SER_Pos)                         /*!< 0x00000800 */
#define FLASH_CR_SER                              FLASH_CR_SER_Msk                                  /*!< Sector Erase */
#define FLASH_CR_OPTSTRT_Pos                      (17U)
#define FLASH_CR_OPTSTRT_Msk                      (0x1UL<<FLASH_CR_OPTSTRT_Pos)                     /*!< 0x00020000 */
#define FLASH_CR_OPTSTRT                          FLASH_CR_OPTSTRT_Msk                              /*!< Option bytes Programming Start */
#define FLASH_CR_PGSTRT_Pos                       (19U)
#define FLASH_CR_PGSTRT_Msk                       (0x1UL<<FLASH_CR_PGSTRT_Pos)                      /*!< 0x00080000 */
#define FLASH_CR_PGSTRT                           FLASH_CR_PGSTRT_Msk                               /*!< Programming Start */
#define FLASH_CR_VRPRGERRIE_Pos                   (20U)
#define FLASH_CR_VRPRGERRIE_Msk                   (0x1UL<<FLASH_CR_VRPRGERRIE_Pos)                  /*!< 0x00100000 */
#define FLASH_CR_VRPRGERRIE                       FLASH_CR_VRPRGERRIE_Msk                           
#define FLASH_CR_VRERSERRIE_Pos                   (21U)
#define FLASH_CR_VRERSERRIE_Msk                   (0x1UL<<FLASH_CR_VRERSERRIE_Pos)                  /*!< 0x00200000 */
#define FLASH_CR_VRERSERRIE                       FLASH_CR_VRERSERRIE_Msk                           
#define FLASH_CR_RDERRIE_Pos                      (22U)
#define FLASH_CR_RDERRIE_Msk                      (0x1UL<<FLASH_CR_RDERRIE_Pos)                     /*!< 0x00400000 */
#define FLASH_CR_RDERRIE                          FLASH_CR_RDERRIE_Msk                              /*!< bank1 read error */
#define FLASH_CR_EOPIE_Pos                        (24U)
#define FLASH_CR_EOPIE_Msk                        (0x1UL<<FLASH_CR_EOPIE_Pos)                       /*!< 0x01000000 */
#define FLASH_CR_EOPIE                            FLASH_CR_EOPIE_Msk                                /*!< End of operation interrupt enable */
#define FLASH_CR_ERRIE_Pos                        (25U)
#define FLASH_CR_ERRIE_Msk                        (0x1UL<<FLASH_CR_ERRIE_Pos)                       /*!< 0x02000000 */
#define FLASH_CR_ERRIE                            FLASH_CR_ERRIE_Msk                                /*!< Error interrupt enable */
#define FLASH_CR_OBL_LAUNCH_Pos                   (27U)
#define FLASH_CR_OBL_LAUNCH_Msk                   (0x1UL<<FLASH_CR_OBL_LAUNCH_Pos)                  /*!< 0x08000000 */
#define FLASH_CR_OBL_LAUNCH                       FLASH_CR_OBL_LAUNCH_Msk                           /*!< Force the option bytes loading */
#define FLASH_CR_SECPROT0_Pos                     (28U)
#define FLASH_CR_SECPROT0_Msk                     (0x1UL<<FLASH_CR_SECPROT0_Pos)                    /*!< 0x10000000 */
#define FLASH_CR_SECPROT0                         FLASH_CR_SECPROT0_Msk                             /*!< bank0 sec protect */
#define FLASH_CR_SECPROT1_Pos                     (29U)
#define FLASH_CR_SECPROT1_Msk                     (0x1UL<<FLASH_CR_SECPROT1_Pos)                    /*!< 0x20000000 */
#define FLASH_CR_SECPROT1                         FLASH_CR_SECPROT1_Msk                             /*!< bank1 sec protect */
#define FLASH_CR_OPTLOCK_Pos                      (30U)
#define FLASH_CR_OPTLOCK_Msk                      (0x1UL<<FLASH_CR_OPTLOCK_Pos)                     /*!< 0x40000000 */
#define FLASH_CR_OPTLOCK                          FLASH_CR_OPTLOCK_Msk                              /*!< Option Lock */
#define FLASH_CR_LOCK_Pos                         (31U)
#define FLASH_CR_LOCK_Msk                         (0x1UL<<FLASH_CR_LOCK_Pos)                        /*!< 0x80000000 */
#define FLASH_CR_LOCK                             FLASH_CR_LOCK_Msk                                 /*!< Lock */

/********************************* Bit definition for FLASH_OPTR1 register ******************************************/
#define FLASH_OPTR1_RDP_Pos                       (0U)
#define FLASH_OPTR1_RDP_Msk                       (0xFFUL<<FLASH_OPTR1_RDP_Pos)                     /*!< 0x000000FF */
#define FLASH_OPTR1_RDP                           FLASH_OPTR1_RDP_Msk                               /*!< Read Protection */
#define FLASH_OPTR1_NRST_STDBY_Pos                (8U)
#define FLASH_OPTR1_NRST_STDBY_Msk                (0x1UL<<FLASH_OPTR1_NRST_STDBY_Pos)               /*!< 0x00000100 */
#define FLASH_OPTR1_NRST_STDBY                    FLASH_OPTR1_NRST_STDBY_Msk                        
#define FLASH_OPTR1_NRST_STOP_Pos                 (9U)
#define FLASH_OPTR1_NRST_STOP_Msk                 (0x1UL<<FLASH_OPTR1_NRST_STOP_Pos)                /*!< 0x00000200 */
#define FLASH_OPTR1_NRST_STOP                     FLASH_OPTR1_NRST_STOP_Msk                         
#define FLASH_OPTR1_NRST_MODE_Pos                 (10U)
#define FLASH_OPTR1_NRST_MODE_Msk                 (0x3UL<<FLASH_OPTR1_NRST_MODE_Pos)                /*!< 0x00000C00 */
#define FLASH_OPTR1_NRST_MODE                     FLASH_OPTR1_NRST_MODE_Msk
#define FLASH_OPTR1_NRST_MODE_0                   (0x1UL<<FLASH_OPTR1_NRST_MODE_Pos)                /*!< 0x00000400 */
#define FLASH_OPTR1_NRST_MODE_1                   (0x2UL<<FLASH_OPTR1_NRST_MODE_Pos)                /*!< 0x00000800 */
#define FLASH_OPTR1_IWDG_STDBY_Pos                (12U)
#define FLASH_OPTR1_IWDG_STDBY_Msk                (0x1UL<<FLASH_OPTR1_IWDG_STDBY_Pos)               /*!< 0x00001000 */
#define FLASH_OPTR1_IWDG_STDBY                    FLASH_OPTR1_IWDG_STDBY_Msk                        
#define FLASH_OPTR1_IWDG_STOP_Pos                 (13U)
#define FLASH_OPTR1_IWDG_STOP_Msk                 (0x1UL<<FLASH_OPTR1_IWDG_STOP_Pos)                /*!< 0x00002000 */
#define FLASH_OPTR1_IWDG_STOP                     FLASH_OPTR1_IWDG_STOP_Msk                         
#define FLASH_OPTR1_IWDG_SW_Pos                   (14U)
#define FLASH_OPTR1_IWDG_SW_Msk                   (0x1UL<<FLASH_OPTR1_IWDG_SW_Pos)                  /*!< 0x00004000 */
#define FLASH_OPTR1_IWDG_SW                       FLASH_OPTR1_IWDG_SW_Msk                           /*!< IWDG Software Enable */
#define FLASH_OPTR1_WWDG_SW_Pos                   (15U)
#define FLASH_OPTR1_WWDG_SW_Msk                   (0x1UL<<FLASH_OPTR1_WWDG_SW_Pos)                  /*!< 0x00008000 */
#define FLASH_OPTR1_WWDG_SW                       FLASH_OPTR1_WWDG_SW_Msk                           
#define FLASH_OPTR1_NBOOT0_Pos                    (16U)
#define FLASH_OPTR1_NBOOT0_Msk                    (0x1UL<<FLASH_OPTR1_NBOOT0_Pos)                   /*!< 0x00010000 */
#define FLASH_OPTR1_NBOOT0                        FLASH_OPTR1_NBOOT0_Msk                            
#define FLASH_OPTR1_NBOOT1_Pos                    (17U)
#define FLASH_OPTR1_NBOOT1_Msk                    (0x1UL<<FLASH_OPTR1_NBOOT1_Pos)                   /*!< 0x00020000 */
#define FLASH_OPTR1_NBOOT1                        FLASH_OPTR1_NBOOT1_Msk                            
#define FLASH_OPTR1_NSWBOOT0_Pos                  (18U)
#define FLASH_OPTR1_NSWBOOT0_Msk                  (0x1UL<<FLASH_OPTR1_NSWBOOT0_Pos)                 /*!< 0x00040000 */
#define FLASH_OPTR1_NSWBOOT0                      FLASH_OPTR1_NSWBOOT0_Msk                          
#define FLASH_OPTR1_BOOT_LOCK_Pos                 (20U)
#define FLASH_OPTR1_BOOT_LOCK_Msk                 (0x1UL<<FLASH_OPTR1_BOOT_LOCK_Pos)                /*!< 0x00100000 */
#define FLASH_OPTR1_BOOT_LOCK                     FLASH_OPTR1_BOOT_LOCK_Msk                         
#define FLASH_OPTR1_SWD_MODE_Pos                  (25U)
#define FLASH_OPTR1_SWD_MODE_Msk                  (0x3UL<<FLASH_OPTR1_SWD_MODE_Pos)                 /*!< 0x06000000 */
#define FLASH_OPTR1_SWD_MODE                      FLASH_OPTR1_SWD_MODE_Msk
#define FLASH_OPTR1_SWD_MODE_0                    (0x1UL<<FLASH_OPTR1_SWD_MODE_Pos)                 /*!< 0x02000000 */
#define FLASH_OPTR1_SWD_MODE_1                    (0x2UL<<FLASH_OPTR1_SWD_MODE_Pos)                 /*!< 0x04000000 */

/********************************* Bit definition for FLASH_OPTR2 register ******************************************/
#define FLASH_OPTR2_ACC_CTRL_Pos                  (0U)
#define FLASH_OPTR2_ACC_CTRL_Msk                  (0x7UL<<FLASH_OPTR2_ACC_CTRL_Pos)                 /*!< 0x00000007 */
#define FLASH_OPTR2_ACC_CTRL                      FLASH_OPTR2_ACC_CTRL_Msk
#define FLASH_OPTR2_ACC_CTRL_0                    (0x1UL<<FLASH_OPTR2_ACC_CTRL_Pos)                 /*!< 0x00000001 */
#define FLASH_OPTR2_ACC_CTRL_1                    (0x2UL<<FLASH_OPTR2_ACC_CTRL_Pos)                 /*!< 0x00000002 */
#define FLASH_OPTR2_ACC_CTRL_2                    (0x4UL<<FLASH_OPTR2_ACC_CTRL_Pos)                 /*!< 0x00000004 */
#define FLASH_OPTR2_PLL_UNLOCK_RSTEN_Pos          (3U)
#define FLASH_OPTR2_PLL_UNLOCK_RSTEN_Msk          (0x1UL<<FLASH_OPTR2_PLL_UNLOCK_RSTEN_Pos)         /*!< 0x00000008 */
#define FLASH_OPTR2_PLL_UNLOCK_RSTEN              FLASH_OPTR2_PLL_UNLOCK_RSTEN_Msk                  

