breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for FLASH_WRPR0 register ******************************************/
#define FLASH_WRPR0_BANK0_WRPR_Pos                (0U)
#define FLASH_WRPR0_BANK0_WRPR_Msk                (0xFFFFUL<<FLASH_WRPR0_BANK0_WRPR_Pos)            /*!< 0x0000FFFF */
#define FLASH_WRPR0_BANK0_WRPR                    FLASH_WRPR0_BANK0_WRPR_Msk                        /*!< Write Protection Disable */

/********************************* Bit definition for FLASH_PCROPR0 register ****************************************/
#define FLASH_PCROPR0_PCROP0SR_Pos                (0U)
#define FLASH_PCROPR0_PCROP0SR_Msk                (0x1FFUL<<FLASH_PCROPR0_PCROP0SR_Pos)             /*!< 0x000001FF */
#define FLASH_PCROPR0_PCROP0SR                    FLASH_PCROPR0_PCROP0SR_Msk
#define FLASH_PCROPR0_PCROP0ER_Pos                (16U)
#define FLASH_PCROPR0_PCROP0ER_Msk                (0x1FFUL<<FLASH_PCROPR0_PCROP0ER_Pos)             /*!< 0x01FF0000 */
#define FLASH_PCROPR0_PCROP0ER                    FLASH_PCROPR0_PCROP0ER_Msk

/********************************* Bit definition for FLASH_SECR0 register ******************************************/
#define FLASH_SECR0_SEC_SIZEER0_Pos               (16U)
#define FLASH_SECR0_SEC_SIZEER0_Msk               (0x1FFUL<<FLASH_SECR0_SEC_SIZEER0_Pos)            /*!< 0x01FF0000 */
#define FLASH_SECR0_SEC_SIZEER0                   FLASH_SECR0_SEC_SIZEER0_Msk

/********************************* Bit definition for FLASH_WRPR1 register ******************************************/
#define FLASH_WRPR1_BANK0_WRPR_Pos                (0U)
#define FLASH_WRPR1_BANK0_WRPR_Msk                (0xFFFFUL<<FLASH_WRPR1_BANK0_WRPR_Pos)            /*!< 0x0000FFFF */
#define FLASH_WRPR1_BANK0_WRPR                    FLASH_WRPR1_BANK0_WRPR_Msk                        /*!< Write Protection Disable */

/********************************* Bit definition for FLASH_PCROPR1 register ****************************************/
#define FLASH_PCROPR1_PCROP1SR_Pos                (0U)
#define FLASH_PCROPR1_PCROP1SR_Msk                (0x1FFUL<<FLASH_PCROPR1_PCROP1SR_Pos)             /*!< 0x000001FF */
#define FLASH_PCROPR1_PCROP1SR                    FLASH_PCROPR1_PCROP1SR_Msk
#define FLASH_PCROPR1_PCROP1ER_Pos                (16U)
#define FLASH_PCROPR1_PCROP1ER_Msk                (0x1FFUL<<FLASH_PCROPR1_PCROP1ER_Pos)             /*!< 0x01FF0000 */
#define FLASH_PCROPR1_PCROP1ER                    FLASH_PCROPR1_PCROP1ER_Msk

/********************************* Bit definition for FLASH_SECR1 register ******************************************/
#define FLASH_SECR1_SEC_SIZEER1_Pos               (16U)
#define FLASH_SECR1_SEC_SIZEER1_Msk               (0x1FFUL<<FLASH_SECR1_SEC_SIZEER1_Pos)            /*!< 0x01FF0000 */
#define FLASH_SECR1_SEC_SIZEER1                   FLASH_SECR1_SEC_SIZEER1_Msk

/********************************* Bit definition for FLASH_OPTBFB register *****************************************/
#define FLASH_OPTBFB_FLASH_BFB_Pos                (0U)
#define FLASH_OPTBFB_FLASH_BFB_Msk                (0x1UL<<FLASH_OPTBFB_FLASH_BFB_Pos)               /*!< 0x00000001 */
#define FLASH_OPTBFB_FLASH_BFB                    FLASH_OPTBFB_FLASH_BFB_Msk                        

/********************************* Bit definition for FLASH_TS0 register ********************************************/
#define FLASH_TS0_TS0_Pos                         (0U)
#define FLASH_TS0_TS0_Msk                         (0x7FUL<<FLASH_TS0_TS0_Pos)                       /*!< 0x0000007F */
#define FLASH_TS0_TS0                             FLASH_TS0_TS0_Msk

/********************************* Bit definition for FLASH_TS1 register ********************************************/
#define FLASH_TS1_TS1_Pos                         (0U)
#define FLASH_TS1_TS1_Msk                         (0x7FUL<<FLASH_TS1_TS1_Pos)                       /*!< 0x0000007F */
#define FLASH_TS1_TS1                             FLASH_TS1_TS1_Msk

/********************************* Bit definition for FLASH_TS2P register *******************************************/
#define FLASH_TS2P_TS2P_Pos                       (0U)
#define FLASH_TS2P_TS2P_Msk                       (0x7FUL<<FLASH_TS2P_TS2P_Pos)                     /*!< 0x0000007F */
#define FLASH_TS2P_TS2P                           FLASH_TS2P_TS2P_Msk

/********************************* Bit definition for FLASH_TPS3 register *******************************************/
#define FLASH_TPS3_TPS3_Pos                       (0U)
#define FLASH_TPS3_TPS3_Msk                       (0x1FFUL<<FLASH_TPS3_TPS3_Pos)                    /*!< 0x000001FF */
#define FLASH_TPS3_TPS3                           FLASH_TPS3_TPS3_Msk

/********************************* Bit definition for FLASH_TS3 register ********************************************/
#define FLASH_TS3_TS3_Pos                         (0U)
#define FLASH_TS3_TS3_Msk                         (0x7FUL<<FLASH_TS3_TS3_Pos)                       /*!< 0x0000007F */
#define FLASH_TS3_TS3                             FLASH_TS3_TS3_Msk

/********************************* Bit definition for FLASH_ERSTPE register *****************************************/
#define FLASH_ERSTPE_ERSTPE_Pos                   (0U)
#define FLASH_ERSTPE_ERSTPE_Msk                   (0x7FFFUL<<FLASH_ERSTPE_ERSTPE_Pos)               /*!< 0x00007FFF */
#define FLASH_ERSTPE_ERSTPE                       FLASH_ERSTPE_ERSTPE_Msk

/********************************* Bit definition for FLASH_PRGTPE register *****************************************/
#define FLASH_PRGTPE_PRGTPE_Pos                   (0U)
#define FLASH_PRGTPE_PRGTPE_Msk                   (0x7FFFUL<<FLASH_PRGTPE_PRGTPE_Pos)               /*!< 0x00007FFF */
#define FLASH_PRGTPE_PRGTPE                       FLASH_PRGTPE_PRGTPE_Msk

/********************************* Bit definition for FLASH_PRETPE register *****************************************/
#define FLASH_PRETPE_PRETPE_Pos                   (0U)
#define FLASH_PRETPE_PRETPE_Msk                   (0xFFFUL<<FLASH_PRETPE_PRETPE_Pos)                /*!< 0x00000FFF */
#define FLASH_PRETPE_PRETPE                       FLASH_PRETPE_PRETPE_Msk

