breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************************************************************************************************/
/********************************* RCC ******************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for RCC_CR register ***********************************************/
#define RCC_CR_HSION_Pos                          (8U)
#define RCC_CR_HSION_Msk                          (0x1UL<<RCC_CR_HSION_Pos)                         /*!< 0x00000100 */
#define RCC_CR_HSION                              RCC_CR_HSION_Msk                                  
#define RCC_CR_HSIKERON_Pos                       (9U)
#define RCC_CR_HSIKERON_Msk                       (0x1UL<<RCC_CR_HSIKERON_Pos)                      /*!< 0x00000200 */
#define RCC_CR_HSIKERON                           RCC_CR_HSIKERON_Msk                               
#define RCC_CR_HSIRDY_Pos                         (10U)
#define RCC_CR_HSIRDY_Msk                         (0x1UL<<RCC_CR_HSIRDY_Pos)                        /*!< 0x00000400 */
#define RCC_CR_HSIRDY                             RCC_CR_HSIRDY_Msk                                 
#define RCC_CR_HSIDIV_Pos                         (11U)
#define RCC_CR_HSIDIV_Msk                         (0x3UL<<RCC_CR_HSIDIV_Pos)                        /*!< 0x00001800 */
#define RCC_CR_HSIDIV                             RCC_CR_HSIDIV_Msk
#define RCC_CR_HSIDIV_0                           (0x1UL<<RCC_CR_HSIDIV_Pos)                        /*!< 0x00000800 */
#define RCC_CR_HSIDIV_1                           (0x2UL<<RCC_CR_HSIDIV_Pos)                        /*!< 0x00001000 */
#define RCC_CR_HSEON_Pos                          (16U)
#define RCC_CR_HSEON_Msk                          (0x1UL<<RCC_CR_HSEON_Pos)                         /*!< 0x00010000 */
#define RCC_CR_HSEON                              RCC_CR_HSEON_Msk                                  
#define RCC_CR_HSERDY_Pos                         (17U)
#define RCC_CR_HSERDY_Msk                         (0x1UL<<RCC_CR_HSERDY_Pos)                        /*!< 0x00020000 */
#define RCC_CR_HSERDY                             RCC_CR_HSERDY_Msk                                 
#define RCC_CR_HSEBYP_Pos                         (18U)
#define RCC_CR_HSEBYP_Msk                         (0x1UL<<RCC_CR_HSEBYP_Pos)                        /*!< 0x00040000 */
#define RCC_CR_HSEBYP                             RCC_CR_HSEBYP_Msk                                 
#define RCC_CR_HSECSSON_Pos                       (19U)
#define RCC_CR_HSECSSON_Msk                       (0x1UL<<RCC_CR_HSECSSON_Pos)                      /*!< 0x00080000 */
#define RCC_CR_HSECSSON                           RCC_CR_HSECSSON_Msk                               
#define RCC_CR_PLLON_Pos                          (24U)
#define RCC_CR_PLLON_Msk                          (0x1UL<<RCC_CR_PLLON_Pos)                         /*!< 0x01000000 */
#define RCC_CR_PLLON                              RCC_CR_PLLON_Msk                                  
#define RCC_CR_PLLRDY_Pos                         (25U)
#define RCC_CR_PLLRDY_Msk                         (0x1UL<<RCC_CR_PLLRDY_Pos)                        /*!< 0x02000000 */
#define RCC_CR_PLLRDY                             RCC_CR_PLLRDY_Msk                                 

/********************************* Bit definition for RCC_ICSCR register ********************************************/
#define RCC_ICSCR_HSI_TRIMCR_Pos                  (0U)
#define RCC_ICSCR_HSI_TRIMCR_Msk                  (0xFFFFUL<<RCC_ICSCR_HSI_TRIMCR_Pos)              /*!< 0x0000FFFF */
#define RCC_ICSCR_HSI_TRIMCR                      RCC_ICSCR_HSI_TRIMCR_Msk
#define RCC_ICSCR_HSI_FS_Pos                      (16U)
#define RCC_ICSCR_HSI_FS_Msk                      (0x3UL<<RCC_ICSCR_HSI_FS_Pos)                     /*!< 0x00030000 */
#define RCC_ICSCR_HSI_FS                          RCC_ICSCR_HSI_FS_Msk
#define RCC_ICSCR_HSI_FS_0                        (0x1UL<<RCC_ICSCR_HSI_FS_Pos)                     /*!< 0x00010000 */
#define RCC_ICSCR_HSI_FS_1                        (0x2UL<<RCC_ICSCR_HSI_FS_Pos)                     /*!< 0x00020000 */

/********************************* Bit definition for RCC_CFGR1 register ********************************************/
#define RCC_CFGR1_SW_Pos                          (0U)
#define RCC_CFGR1_SW_Msk                          (0x3UL<<RCC_CFGR1_SW_Pos)                         /*!< 0x00000003 */
#define RCC_CFGR1_SW                              RCC_CFGR1_SW_Msk
#define RCC_CFGR1_SW_0                            (0x1UL<<RCC_CFGR1_SW_Pos)                         /*!< 0x00000001 */
#define RCC_CFGR1_SW_1                            (0x2UL<<RCC_CFGR1_SW_Pos)                         /*!< 0x00000002 */
#define RCC_CFGR1_SWS_Pos                         (4U)
#define RCC_CFGR1_SWS_Msk                         (0x3UL<<RCC_CFGR1_SWS_Pos)                        /*!< 0x00000030 */
#define RCC_CFGR1_SWS                             RCC_CFGR1_SWS_Msk
#define RCC_CFGR1_SWS_0                           (0x1UL<<RCC_CFGR1_SWS_Pos)                        /*!< 0x00000010 */
#define RCC_CFGR1_SWS_1                           (0x2UL<<RCC_CFGR1_SWS_Pos)                        /*!< 0x00000020 */
#define RCC_CFGR1_HPRE_Pos                        (8U)
#define RCC_CFGR1_HPRE_Msk                        (0xFUL<<RCC_CFGR1_HPRE_Pos)                       /*!< 0x00000F00 */
#define RCC_CFGR1_HPRE                            RCC_CFGR1_HPRE_Msk
#define RCC_CFGR1_HPRE_0                          (0x1UL<<RCC_CFGR1_HPRE_Pos)                       /*!< 0x00000100 */
#define RCC_CFGR1_HPRE_1                          (0x2UL<<RCC_CFGR1_HPRE_Pos)                       /*!< 0x00000200 */
#define RCC_CFGR1_HPRE_2                          (0x4UL<<RCC_CFGR1_HPRE_Pos)                       /*!< 0x00000400 */
#define RCC_CFGR1_HPRE_3                          (0x8UL<<RCC_CFGR1_HPRE_Pos)                       /*!< 0x00000800 */
#define RCC_CFGR1_PPRE1_Pos                       (12U)
#define RCC_CFGR1_PPRE1_Msk                       (0x7UL<<RCC_CFGR1_PPRE1_Pos)                      /*!< 0x00007000 */
#define RCC_CFGR1_PPRE1                           RCC_CFGR1_PPRE1_Msk
#define RCC_CFGR1_PPRE1_0                         (0x1UL<<RCC_CFGR1_PPRE1_Pos)                      /*!< 0x00001000 */
#define RCC_CFGR1_PPRE1_1                         (0x2UL<<RCC_CFGR1_PPRE1_Pos)                      /*!< 0x00002000 */
#define RCC_CFGR1_PPRE1_2                         (0x4UL<<RCC_CFGR1_PPRE1_Pos)                      /*!< 0x00004000 */
#define RCC_CFGR1_MCO1SEL_Pos                     (16U)
#define RCC_CFGR1_MCO1SEL_Msk                     (0xFUL<<RCC_CFGR1_MCO1SEL_Pos)                    /*!< 0x000F0000 */
#define RCC_CFGR1_MCO1SEL                         RCC_CFGR1_MCO1SEL_Msk
#define RCC_CFGR1_MCO1SEL_0                       (0x1UL<<RCC_CFGR1_MCO1SEL_Pos)                    /*!< 0x00010000 */
#define RCC_CFGR1_MCO1SEL_1                       (0x2UL<<RCC_CFGR1_MCO1SEL_Pos)                    /*!< 0x00020000 */
#define RCC_CFGR1_MCO1SEL_2                       (0x4UL<<RCC_CFGR1_MCO1SEL_Pos)                    /*!< 0x00040000 */
#define RCC_CFGR1_MCO1SEL_3                       (0x8UL<<RCC_CFGR1_MCO1SEL_Pos)                    /*!< 0x00080000 */
#define RCC_CFGR1_MCO1PRE_Pos                     (20U)
#define RCC_CFGR1_MCO1PRE_Msk                     (0xFUL<<RCC_CFGR1_MCO1PRE_Pos)                    /*!< 0x00F00000 */
#define RCC_CFGR1_MCO1PRE                         RCC_CFGR1_MCO1PRE_Msk
#define RCC_CFGR1_MCO1PRE_0                       (0x1UL<<RCC_CFGR1_MCO1PRE_Pos)                    /*!< 0x00100000 */
#define RCC_CFGR1_MCO1PRE_1                       (0x2UL<<RCC_CFGR1_MCO1PRE_Pos)                    /*!< 0x00200000 */
#define RCC_CFGR1_MCO1PRE_2                       (0x4UL<<RCC_CFGR1_MCO1PRE_Pos)                    /*!< 0x00400000 */
#define RCC_CFGR1_MCO1PRE_3                       (0x8UL<<RCC_CFGR1_MCO1PRE_Pos)                    /*!< 0x00800000 */
#define RCC_CFGR1_MCO2SEL_Pos                     (24U)
#define RCC_CFGR1_MCO2SEL_Msk                     (0xFUL<<RCC_CFGR1_MCO2SEL_Pos)                    /*!< 0x0F000000 */
#define RCC_CFGR1_MCO2SEL                         RCC_CFGR1_MCO2SEL_Msk
#define RCC_CFGR1_MCO2SEL_0                       (0x1UL<<RCC_CFGR1_MCO2SEL_Pos)                    /*!< 0x01000000 */
#define RCC_CFGR1_MCO2SEL_1                       (0x2UL<<RCC_CFGR1_MCO2SEL_Pos)                    /*!< 0x02000000 */
#define RCC_CFGR1_MCO2SEL_2                       (0x4UL<<RCC_CFGR1_MCO2SEL_Pos)                    /*!< 0x04000000 */
#define RCC_CFGR1_MCO2SEL_3                       (0x8UL<<RCC_CFGR1_MCO2SEL_Pos)                    /*!< 0x08000000 */
#define RCC_CFGR1_MCO2PRE_Pos                     (28U)
#define RCC_CFGR1_MCO2PRE_Msk                     (0xFUL<<RCC_CFGR1_MCO2PRE_Pos)                    /*!< 0xF0000000 */
#define RCC_CFGR1_MCO2PRE                         RCC_CFGR1_MCO2PRE_Msk
#define RCC_CFGR1_MCO2PRE_0                       (0x1UL<<RCC_CFGR1_MCO2PRE_Pos)                    /*!< 0x10000000 */
#define RCC_CFGR1_MCO2PRE_1                       (0x2UL<<RCC_CFGR1_MCO2PRE_Pos)                    /*!< 0x20000000 */
#define RCC_CFGR1_MCO2PRE_2                       (0x4UL<<RCC_CFGR1_MCO2PRE_Pos)                    /*!< 0x40000000 */
#define RCC_CFGR1_MCO2PRE_3                       (0x8UL<<RCC_CFGR1_MCO2PRE_Pos)                    /*!< 0x80000000 */

/********************************* Bit definition for RCC_CFGR2 register ********************************************/
#define RCC_CFGR2_PPRE2_Pos                       (8U)
#define RCC_CFGR2_PPRE2_Msk                       (0x7UL<<RCC_CFGR2_PPRE2_Pos)                      /*!< 0x00000700 */
#define RCC_CFGR2_PPRE2                           RCC_CFGR2_PPRE2_Msk
#define RCC_CFGR2_PPRE2_0                         (0x1UL<<RCC_CFGR2_PPRE2_Pos)                      /*!< 0x00000100 */
#define RCC_CFGR2_PPRE2_1                         (0x2UL<<RCC_CFGR2_PPRE2_Pos)                      /*!< 0x00000200 */
#define RCC_CFGR2_PPRE2_2                         (0x4UL<<RCC_CFGR2_PPRE2_Pos)                      /*!< 0x00000400 */

/********************************* Bit definition for RCC_PLLCFGR1 register *****************************************/
#define RCC_PLLCFGR1_PLLSRC_Pos                   (0U)
#define RCC_PLLCFGR1_PLLSRC_Msk                   (0x1UL<<RCC_PLLCFGR1_PLLSRC_Pos)                  /*!< 0x00000001 */
#define RCC_PLLCFGR1_PLLSRC                       RCC_PLLCFGR1_PLLSRC_Msk                           
#define RCC_PLLCFGR1_PLLMUL_Pos                   (2U)
#define RCC_PLLCFGR1_PLLMUL_Msk                   (0xFUL<<RCC_PLLCFGR1_PLLMUL_Pos)                  /*!< 0x0000003C */
#define RCC_PLLCFGR1_PLLMUL                       RCC_PLLCFGR1_PLLMUL_Msk
#define RCC_PLLCFGR1_PLLMUL_0                     (0x1UL<<RCC_PLLCFGR1_PLLMUL_Pos)                  /*!< 0x00000004 */
#define RCC_PLLCFGR1_PLLMUL_1                     (0x2UL<<RCC_PLLCFGR1_PLLMUL_Pos)                  /*!< 0x00000008 */
#define RCC_PLLCFGR1_PLLMUL_2                     (0x4UL<<RCC_PLLCFGR1_PLLMUL_Pos)                  /*!< 0x00000010 */
#define RCC_PLLCFGR1_PLLMUL_3                     (0x8UL<<RCC_PLLCFGR1_PLLMUL_Pos)                  /*!< 0x00000020 */

/********************************* Bit definition for RCC_ECSCR register ********************************************/
#define RCC_ECSCR_HSE_DRV_Pos                     (0U)
#define RCC_ECSCR_HSE_DRV_Msk                     (0x3UL<<RCC_ECSCR_HSE_DRV_Pos)                    /*!< 0x00000003 */
#define RCC_ECSCR_HSE_DRV                         RCC_ECSCR_HSE_DRV_Msk
#define RCC_ECSCR_HSE_DRV_0                       (0x1UL<<RCC_ECSCR_HSE_DRV_Pos)                    /*!< 0x00000001 */
#define RCC_ECSCR_HSE_DRV_1                       (0x2UL<<RCC_ECSCR_HSE_DRV_Pos)                    /*!< 0x00000002 */
#define RCC_ECSCR_HSE_RDYSEL_Pos                  (2U)
#define RCC_ECSCR_HSE_RDYSEL_Msk                  (0x3UL<<RCC_ECSCR_HSE_RDYSEL_Pos)                 /*!< 0x0000000C */
#define RCC_ECSCR_HSE_RDYSEL                      RCC_ECSCR_HSE_RDYSEL_Msk
#define RCC_ECSCR_HSE_RDYSEL_0                    (0x1UL<<RCC_ECSCR_HSE_RDYSEL_Pos)                 /*!< 0x00000004 */
#define RCC_ECSCR_HSE_RDYSEL_1                    (0x2UL<<RCC_ECSCR_HSE_RDYSEL_Pos)                 /*!< 0x00000008 */
#define RCC_ECSCR_HSE_FILT_ENB_Pos                (4U)
#define RCC_ECSCR_HSE_FILT_ENB_Msk                (0x1UL<<RCC_ECSCR_HSE_FILT_ENB_Pos)               /*!< 0x00000010 */
#define RCC_ECSCR_HSE_FILT_ENB                    RCC_ECSCR_HSE_FILT_ENB_Msk                        

/********************************* Bit definition for RCC_CIER register *********************************************/
#define RCC_CIER_LSIRDYIE_Pos                     (0U)
#define RCC_CIER_LSIRDYIE_Msk                     (0x1UL<<RCC_CIER_LSIRDYIE_Pos)                    /*!< 0x00000001 */
#define RCC_CIER_LSIRDYIE                         RCC_CIER_LSIRDYIE_Msk                             
#define RCC_CIER_LSERDYIE_Pos                     (1U)
#define RCC_CIER_LSERDYIE_Msk                     (0x1UL<<RCC_CIER_LSERDYIE_Pos)                    /*!< 0x00000002 */
#define RCC_CIER_LSERDYIE                         RCC_CIER_LSERDYIE_Msk                             
#define RCC_CIER_HSIRDYIE_Pos                     (2U)
#define RCC_CIER_HSIRDYIE_Msk                     (0x1UL<<RCC_CIER_HSIRDYIE_Pos)                    /*!< 0x00000004 */
#define RCC_CIER_HSIRDYIE                         RCC_CIER_HSIRDYIE_Msk                             
#define RCC_CIER_HSERDYIE_Pos                     (3U)
#define RCC_CIER_HSERDYIE_Msk                     (0x1UL<<RCC_CIER_HSERDYIE_Pos)                    /*!< 0x00000008 */
#define RCC_CIER_HSERDYIE                         RCC_CIER_HSERDYIE_Msk                             
#define RCC_CIER_PLLRDYIE_Pos                     (4U)
#define RCC_CIER_PLLRDYIE_Msk                     (0x1UL<<RCC_CIER_PLLRDYIE_Pos)                    /*!< 0x00000010 */
#define RCC_CIER_PLLRDYIE                         RCC_CIER_PLLRDYIE_Msk                             

/********************************* Bit definition for RCC_CIFR register *********************************************/
#define RCC_CIFR_LSIRDYF_Pos                      (0U)
#define RCC_CIFR_LSIRDYF_Msk                      (0x1UL<<RCC_CIFR_LSIRDYF_Pos)                     /*!< 0x00000001 */
#define RCC_CIFR_LSIRDYF                          RCC_CIFR_LSIRDYF_Msk                              
#define RCC_CIFR_LSERDYF_Pos                      (1U)
#define RCC_CIFR_LSERDYF_Msk                      (0x1UL<<RCC_CIFR_LSERDYF_Pos)                     /*!< 0x00000002 */
#define RCC_CIFR_LSERDYF                          RCC_CIFR_LSERDYF_Msk                              
#define RCC_CIFR_HSIRDYF_Pos                      (2U)
#define RCC_CIFR_HSIRDYF_Msk                      (0x1UL<<RCC_CIFR_HSIRDYF_Pos)                     /*!< 0x00000004 */
#define RCC_CIFR_HSIRDYF                          RCC_CIFR_HSIRDYF_Msk                              
#define RCC_CIFR_HSERDYF_Pos                      (3U)
#define RCC_CIFR_HSERDYF_Msk                      (0x1UL<<RCC_CIFR_HSERDYF_Pos)                     /*!< 0x00000008 */
#define RCC_CIFR_HSERDYF                          RCC_CIFR_HSERDYF_Msk                              
#define RCC_CIFR_PLLRDYF_Pos                      (4U)
#define RCC_CIFR_PLLRDYF_Msk                      (0x1UL<<RCC_CIFR_PLLRDYF_Pos)                     /*!< 0x00000010 */
#define RCC_CIFR_PLLRDYF                          RCC_CIFR_PLLRDYF_Msk                              
#define RCC_CIFR_LSECSSF_Pos                      (7U)
#define RCC_CIFR_LSECSSF_Msk                      (0x1UL<<RCC_CIFR_LSECSSF_Pos)                     /*!< 0x00000080 */
#define RCC_CIFR_LSECSSF                          RCC_CIFR_LSECSSF_Msk                              
#define RCC_CIFR_HSECSSF_Pos                      (8U)
#define RCC_CIFR_HSECSSF_Msk                      (0x1UL<<RCC_CIFR_HSECSSF_Pos)                     /*!< 0x00000100 */
#define RCC_CIFR_HSECSSF                          RCC_CIFR_HSECSSF_Msk                              

/********************************* Bit definition for RCC_CICR register *********************************************/
#define RCC_CICR_LSIRDYC_Pos                      (0U)
#define RCC_CICR_LSIRDYC_Msk                      (0x1UL<<RCC_CICR_LSIRDYC_Pos)                     /*!< 0x00000001 */
#define RCC_CICR_LSIRDYC                          RCC_CICR_LSIRDYC_Msk                              
#define RCC_CICR_LSERDYC_Pos                      (1U)
#define RCC_CICR_LSERDYC_Msk                      (0x1UL<<RCC_CICR_LSERDYC_Pos)                     /*!< 0x00000002 */
#define RCC_CICR_LSERDYC                          RCC_CICR_LSERDYC_Msk                              
#define RCC_CICR_HSIRDYC_Pos                      (2U)
#define RCC_CICR_HSIRDYC_Msk                      (0x1UL<<RCC_CICR_HSIRDYC_Pos)                     /*!< 0x00000004 */
#define RCC_CICR_HSIRDYC                          RCC_CICR_HSIRDYC_Msk                              
#define RCC_CICR_HSERDYC_Pos                      (3U)
#define RCC_CICR_HSERDYC_Msk                      (0x1UL<<RCC_CICR_HSERDYC_Pos)                     /*!< 0x00000008 */
#define RCC_CICR_HSERDYC                          RCC_CICR_HSERDYC_Msk                              
#define RCC_CICR_PLLRDYC_Pos                      (4U)
#define RCC_CICR_PLLRDYC_Msk                      (0x1UL<<RCC_CICR_PLLRDYC_Pos)                     /*!< 0x00000010 */
#define RCC_CICR_PLLRDYC                          RCC_CICR_PLLRDYC_Msk                              
#define RCC_CICR_LSECSSC_Pos                      (7U)
#define RCC_CICR_LSECSSC_Msk                      (0x1UL<<RCC_CICR_LSECSSC_Pos)                     /*!< 0x00000080 */
#define RCC_CICR_LSECSSC                          RCC_CICR_LSECSSC_Msk                              
#define RCC_CICR_HSECSSC_Pos                      (8U)
#define RCC_CICR_HSECSSC_Msk                      (0x1UL<<RCC_CICR_HSECSSC_Pos)                     /*!< 0x00000100 */
#define RCC_CICR_HSECSSC                          RCC_CICR_HSECSSC_Msk                              

/********************************* Bit definition for RCC_AHBRSTR1 register *****************************************/
#define RCC_AHBRSTR1_DMARST_Pos                   (0U)
#define RCC_AHBRSTR1_DMARST_Msk                   (0x1UL<<RCC_AHBRSTR1_DMARST_Pos)                  /*!< 0x00000001 */
#define RCC_AHBRSTR1_DMARST                       RCC_AHBRSTR1_DMARST_Msk                           
#define RCC_AHBRSTR1_CRCRST_Pos                   (16U)
#define RCC_AHBRSTR1_CRCRST_Msk                   (0x1UL<<RCC_AHBRSTR1_CRCRST_Pos)                  /*!< 0x00010000 */
#define RCC_AHBRSTR1_CRCRST                       RCC_AHBRSTR1_CRCRST_Msk                           

/********************************* Bit definition for RCC_AHBRSTR2 register *****************************************/
#define RCC_AHBRSTR2_GPIOARST_Pos                 (0U)
#define RCC_AHBRSTR2_GPIOARST_Msk                 (0x1UL<<RCC_AHBRSTR2_GPIOARST_Pos)                /*!< 0x00000001 */
#define RCC_AHBRSTR2_GPIOARST                     RCC_AHBRSTR2_GPIOARST_Msk                         
#define RCC_AHBRSTR2_GPIOBRST_Pos                 (1U)
#define RCC_AHBRSTR2_GPIOBRST_Msk                 (0x1UL<<RCC_AHBRSTR2_GPIOBRST_Pos)                /*!< 0x00000002 */
#define RCC_AHBRSTR2_GPIOBRST                     RCC_AHBRSTR2_GPIOBRST_Msk                         
#define RCC_AHBRSTR2_GPIOCRST_Pos                 (2U)
#define RCC_AHBRSTR2_GPIOCRST_Msk                 (0x1UL<<RCC_AHBRSTR2_GPIOCRST_Pos)                /*!< 0x00000004 */
#define RCC_AHBRSTR2_GPIOCRST                     RCC_AHBRSTR2_GPIOCRST_Msk                         
#define RCC_AHBRSTR2_GPIODRST_Pos                 (3U)
#define RCC_AHBRSTR2_GPIODRST_Msk                 (0x1UL<<RCC_AHBRSTR2_GPIODRST_Pos)                /*!< 0x00000008 */
#define RCC_AHBRSTR2_GPIODRST                     RCC_AHBRSTR2_GPIODRST_Msk                         

/********************************* Bit definition for RCC_APBRSTR1 register *****************************************/
#define RCC_APBRSTR1_TIM1RST_Pos                  (1U)
#define RCC_APBRSTR1_TIM1RST_Msk                  (0x1UL<<RCC_APBRSTR1_TIM1RST_Pos)                 /*!< 0x00000002 */
#define RCC_APBRSTR1_TIM1RST                      RCC_APBRSTR1_TIM1RST_Msk                          
#define RCC_APBRSTR1_TIM2RST_Pos                  (2U)
#define RCC_APBRSTR1_TIM2RST_Msk                  (0x1UL<<RCC_APBRSTR1_TIM2RST_Pos)                 /*!< 0x00000004 */
#define RCC_APBRSTR1_TIM2RST                      RCC_APBRSTR1_TIM2RST_Msk                          
#define RCC_APBRSTR1_TIM3RST_Pos                  (3U)
#define RCC_APBRSTR1_TIM3RST_Msk                  (0x1UL<<RCC_APBRSTR1_TIM3RST_Pos)                 /*!< 0x00000008 */
#define RCC_APBRSTR1_TIM3RST                      RCC_APBRSTR1_TIM3RST_Msk                          
#define RCC_APBRSTR1_TIM6RST_Pos                  (6U)
#define RCC_APBRSTR1_TIM6RST_Msk                  (0x1UL<<RCC_APBRSTR1_TIM6RST_Pos)                 /*!< 0x00000040 */
#define RCC_APBRSTR1_TIM6RST                      RCC_APBRSTR1_TIM6RST_Msk                          
#define RCC_APBRSTR1_TIM7RST_Pos                  (7U)
#define RCC_APBRSTR1_TIM7RST_Msk                  (0x1UL<<RCC_APBRSTR1_TIM7RST_Pos)                 /*!< 0x00000080 */
#define RCC_APBRSTR1_TIM7RST                      RCC_APBRSTR1_TIM7RST_Msk                          
#define RCC_APBRSTR1_TIM8RST_Pos                  (8U)
#define RCC_APBRSTR1_TIM8RST_Msk                  (0x1UL<<RCC_APBRSTR1_TIM8RST_Pos)                 /*!< 0x00000100 */
#define RCC_APBRSTR1_TIM8RST                      RCC_APBRSTR1_TIM8RST_Msk                          

/********************************* Bit definition for RCC_APBRSTR2 register *****************************************/
#define RCC_APBRSTR2_HRPWMRST_Pos                 (8U)
#define RCC_APBRSTR2_HRPWMRST_Msk                 (0x1UL<<RCC_APBRSTR2_HRPWMRST_Pos)                /*!< 0x00000100 */
#define RCC_APBRSTR2_HRPWMRST                     RCC_APBRSTR2_HRPWMRST_Msk                         
#define RCC_APBRSTR2_LPTIMRST_Pos                 (16U)
#define RCC_APBRSTR2_LPTIMRST_Msk                 (0x1UL<<RCC_APBRSTR2_LPTIMRST_Pos)                /*!< 0x00010000 */
#define RCC_APBRSTR2_LPTIMRST                     RCC_APBRSTR2_LPTIMRST_Msk                         

