breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for RCC_APBRSTR3 register *****************************************/
#define RCC_APBRSTR3_UART1RST_Pos                 (0U)
#define RCC_APBRSTR3_UART1RST_Msk                 (0x1UL<<RCC_APBRSTR3_UART1RST_Pos)                /*!< 0x00000001 */
#define RCC_APBRSTR3_UART1RST                     RCC_APBRSTR3_UART1RST_Msk                         
#define RCC_APBRSTR3_UART2RST_Pos                 (1U)
#define RCC_APBRSTR3_UART2RST_Msk                 (0x1UL<<RCC_APBRSTR3_UART2RST_Pos)                /*!< 0x00000002 */
#define RCC_APBRSTR3_UART2RST                     RCC_APBRSTR3_UART2RST_Msk                         
#define RCC_APBRSTR3_USARTRST_Pos                 (6U)
#define RCC_APBRSTR3_USARTRST_Msk                 (0x1UL<<RCC_APBRSTR3_USARTRST_Pos)                /*!< 0x00000040 */
#define RCC_APBRSTR3_USARTRST                     RCC_APBRSTR3_USARTRST_Msk                         
#define RCC_APBRSTR3_LPUARTRST_Pos                (12U)
#define RCC_APBRSTR3_LPUARTRST_Msk                (0x1UL<<RCC_APBRSTR3_LPUARTRST_Pos)               /*!< 0x00001000 */
#define RCC_APBRSTR3_LPUARTRST                    RCC_APBRSTR3_LPUARTRST_Msk                        
#define RCC_APBRSTR3_I2C1RST_Pos                  (16U)
#define RCC_APBRSTR3_I2C1RST_Msk                  (0x1UL<<RCC_APBRSTR3_I2C1RST_Pos)                 /*!< 0x00010000 */
#define RCC_APBRSTR3_I2C1RST                      RCC_APBRSTR3_I2C1RST_Msk                          
#define RCC_APBRSTR3_I2C2RST_Pos                  (17U)
#define RCC_APBRSTR3_I2C2RST_Msk                  (0x1UL<<RCC_APBRSTR3_I2C2RST_Pos)                 /*!< 0x00020000 */
#define RCC_APBRSTR3_I2C2RST                      RCC_APBRSTR3_I2C2RST_Msk                          
#define RCC_APBRSTR3_SPI1RST_Pos                  (22U)
#define RCC_APBRSTR3_SPI1RST_Msk                  (0x1UL<<RCC_APBRSTR3_SPI1RST_Pos)                 /*!< 0x00400000 */
#define RCC_APBRSTR3_SPI1RST                      RCC_APBRSTR3_SPI1RST_Msk                          
#define RCC_APBRSTR3_SPI2RST_Pos                  (23U)
#define RCC_APBRSTR3_SPI2RST_Msk                  (0x1UL<<RCC_APBRSTR3_SPI2RST_Pos)                 /*!< 0x00800000 */
#define RCC_APBRSTR3_SPI2RST                      RCC_APBRSTR3_SPI2RST_Msk                          
#define RCC_APBRSTR3_CANRST_Pos                   (28U)
#define RCC_APBRSTR3_CANRST_Msk                   (0x1UL<<RCC_APBRSTR3_CANRST_Pos)                  /*!< 0x10000000 */
#define RCC_APBRSTR3_CANRST                       RCC_APBRSTR3_CANRST_Msk                           

/********************************* Bit definition for RCC_APBRSTR4 register *****************************************/
#define RCC_APBRSTR4_SYSCFGRST_Pos                (0U)
#define RCC_APBRSTR4_SYSCFGRST_Msk                (0x1UL<<RCC_APBRSTR4_SYSCFGRST_Pos)               /*!< 0x00000001 */
#define RCC_APBRSTR4_SYSCFGRST                    RCC_APBRSTR4_SYSCFGRST_Msk                        
#define RCC_APBRSTR4_VREFBUFRST_Pos               (8U)
#define RCC_APBRSTR4_VREFBUFRST_Msk               (0x1UL<<RCC_APBRSTR4_VREFBUFRST_Pos)              /*!< 0x00000100 */
#define RCC_APBRSTR4_VREFBUFRST                   RCC_APBRSTR4_VREFBUFRST_Msk                       
#define RCC_APBRSTR4_PWRRST_Pos                   (9U)
#define RCC_APBRSTR4_PWRRST_Msk                   (0x1UL<<RCC_APBRSTR4_PWRRST_Pos)                  /*!< 0x00000200 */
#define RCC_APBRSTR4_PWRRST                       RCC_APBRSTR4_PWRRST_Msk                           
#define RCC_APBRSTR4_ADC1RST_Pos                  (11U)
#define RCC_APBRSTR4_ADC1RST_Msk                  (0x1UL<<RCC_APBRSTR4_ADC1RST_Pos)                 /*!< 0x00000800 */
#define RCC_APBRSTR4_ADC1RST                      RCC_APBRSTR4_ADC1RST_Msk                          
#define RCC_APBRSTR4_ADC2RST_Pos                  (12U)
#define RCC_APBRSTR4_ADC2RST_Msk                  (0x1UL<<RCC_APBRSTR4_ADC2RST_Pos)                 /*!< 0x00001000 */
#define RCC_APBRSTR4_ADC2RST                      RCC_APBRSTR4_ADC2RST_Msk                          
#define RCC_APBRSTR4_DACRST_Pos                   (16U)
#define RCC_APBRSTR4_DACRST_Msk                   (0x1UL<<RCC_APBRSTR4_DACRST_Pos)                  /*!< 0x00010000 */
#define RCC_APBRSTR4_DACRST                       RCC_APBRSTR4_DACRST_Msk                           
#define RCC_APBRSTR4_OPARST_Pos                   (20U)
#define RCC_APBRSTR4_OPARST_Msk                   (0x1UL<<RCC_APBRSTR4_OPARST_Pos)                  /*!< 0x00100000 */
#define RCC_APBRSTR4_OPARST                       RCC_APBRSTR4_OPARST_Msk                           
#define RCC_APBRSTR4_COMPRST_Pos                  (24U)
#define RCC_APBRSTR4_COMPRST_Msk                  (0x1UL<<RCC_APBRSTR4_COMPRST_Pos)                 /*!< 0x01000000 */
#define RCC_APBRSTR4_COMPRST                      RCC_APBRSTR4_COMPRST_Msk                          

/********************************* Bit definition for RCC_AHBENR1 register ******************************************/
#define RCC_AHBENR1_DMAEN_Pos                     (0U)
#define RCC_AHBENR1_DMAEN_Msk                     (0x1UL<<RCC_AHBENR1_DMAEN_Pos)                    /*!< 0x00000001 */
#define RCC_AHBENR1_DMAEN                         RCC_AHBENR1_DMAEN_Msk                             
#define RCC_AHBENR1_FLASHSMEN_Pos                 (4U)
#define RCC_AHBENR1_FLASHSMEN_Msk                 (0x1UL<<RCC_AHBENR1_FLASHSMEN_Pos)                /*!< 0x00000010 */
#define RCC_AHBENR1_FLASHSMEN                     RCC_AHBENR1_FLASHSMEN_Msk                         
#define RCC_AHBENR1_SRAMSMEN_Pos                  (5U)
#define RCC_AHBENR1_SRAMSMEN_Msk                  (0x1UL<<RCC_AHBENR1_SRAMSMEN_Pos)                 /*!< 0x00000020 */
#define RCC_AHBENR1_SRAMSMEN                      RCC_AHBENR1_SRAMSMEN_Msk                          
#define RCC_AHBENR1_CRCEN_Pos                     (16U)
#define RCC_AHBENR1_CRCEN_Msk                     (0x1UL<<RCC_AHBENR1_CRCEN_Pos)                    /*!< 0x00010000 */
#define RCC_AHBENR1_CRCEN                         RCC_AHBENR1_CRCEN_Msk                             

/********************************* Bit definition for RCC_AHBENR2 register ******************************************/
#define RCC_AHBENR2_GPIOAEN_Pos                   (0U)
#define RCC_AHBENR2_GPIOAEN_Msk                   (0x1UL<<RCC_AHBENR2_GPIOAEN_Pos)                  /*!< 0x00000001 */
#define RCC_AHBENR2_GPIOAEN                       RCC_AHBENR2_GPIOAEN_Msk                           
#define RCC_AHBENR2_GPIOBEN_Pos                   (1U)
#define RCC_AHBENR2_GPIOBEN_Msk                   (0x1UL<<RCC_AHBENR2_GPIOBEN_Pos)                  /*!< 0x00000002 */
#define RCC_AHBENR2_GPIOBEN                       RCC_AHBENR2_GPIOBEN_Msk                           
#define RCC_AHBENR2_GPIOCEN_Pos                   (2U)
#define RCC_AHBENR2_GPIOCEN_Msk                   (0x1UL<<RCC_AHBENR2_GPIOCEN_Pos)                  /*!< 0x00000004 */
#define RCC_AHBENR2_GPIOCEN                       RCC_AHBENR2_GPIOCEN_Msk                           
#define RCC_AHBENR2_GPIODEN_Pos                   (3U)
#define RCC_AHBENR2_GPIODEN_Msk                   (0x1UL<<RCC_AHBENR2_GPIODEN_Pos)                  /*!< 0x00000008 */
#define RCC_AHBENR2_GPIODEN                       RCC_AHBENR2_GPIODEN_Msk                           

