breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for RCC_APBENR1 register ******************************************/
#define RCC_APBENR1_TIM1EN_Pos                    (1U)
#define RCC_APBENR1_TIM1EN_Msk                    (0x1UL<<RCC_APBENR1_TIM1EN_Pos)                   /*!< 0x00000002 */
#define RCC_APBENR1_TIM1EN                        RCC_APBENR1_TIM1EN_Msk                            
#define RCC_APBENR1_TIM2EN_Pos                    (2U)
#define RCC_APBENR1_TIM2EN_Msk                    (0x1UL<<RCC_APBENR1_TIM2EN_Pos)                   /*!< 0x00000004 */
#define RCC_APBENR1_TIM2EN                        RCC_APBENR1_TIM2EN_Msk                            
#define RCC_APBENR1_TIM3EN_Pos                    (3U)
#define RCC_APBENR1_TIM3EN_Msk                    (0x1UL<<RCC_APBENR1_TIM3EN_Pos)                   /*!< 0x00000008 */
#define RCC_APBENR1_TIM3EN                        RCC_APBENR1_TIM3EN_Msk                            
#define RCC_APBENR1_TIM6EN_Pos                    (6U)
#define RCC_APBENR1_TIM6EN_Msk                    (0x1UL<<RCC_APBENR1_TIM6EN_Pos)                   /*!< 0x00000040 */
#define RCC_APBENR1_TIM6EN                        RCC_APBENR1_TIM6EN_Msk                            
#define RCC_APBENR1_TIM7EN_Pos                    (7U)
#define RCC_APBENR1_TIM7EN_Msk                    (0x1UL<<RCC_APBENR1_TIM7EN_Pos)                   /*!< 0x00000080 */
#define RCC_APBENR1_TIM7EN                        RCC_APBENR1_TIM7EN_Msk                            
#define RCC_APBENR1_TIM8EN_Pos                    (8U)
#define RCC_APBENR1_TIM8EN_Msk                    (0x1UL<<RCC_APBENR1_TIM8EN_Pos)                   /*!< 0x00000100 */
#define RCC_APBENR1_TIM8EN                        RCC_APBENR1_TIM8EN_Msk                            

/********************************* Bit definition for RCC_APBENR2 register ******************************************/
#define RCC_APBENR2_HRPWMEN_Pos                   (8U)
#define RCC_APBENR2_HRPWMEN_Msk                   (0x1UL<<RCC_APBENR2_HRPWMEN_Pos)                  /*!< 0x00000100 */
#define RCC_APBENR2_HRPWMEN                       RCC_APBENR2_HRPWMEN_Msk                           
#define RCC_APBENR2_LPTIMEN_Pos                   (16U)
#define RCC_APBENR2_LPTIMEN_Msk                   (0x1UL<<RCC_APBENR2_LPTIMEN_Pos)                  /*!< 0x00010000 */
#define RCC_APBENR2_LPTIMEN                       RCC_APBENR2_LPTIMEN_Msk                           
#define RCC_APBENR2_WWDGEN_Pos                    (31U)
#define RCC_APBENR2_WWDGEN_Msk                    (0x1UL<<RCC_APBENR2_WWDGEN_Pos)                   /*!< 0x80000000 */
#define RCC_APBENR2_WWDGEN                        RCC_APBENR2_WWDGEN_Msk                            

/********************************* Bit definition for RCC_APBENR3 register ******************************************/
#define RCC_APBENR3_UART1EN_Pos                   (0U)
#define RCC_APBENR3_UART1EN_Msk                   (0x1UL<<RCC_APBENR3_UART1EN_Pos)                  /*!< 0x00000001 */
#define RCC_APBENR3_UART1EN                       RCC_APBENR3_UART1EN_Msk                           
#define RCC_APBENR3_UART2EN_Pos                   (1U)
#define RCC_APBENR3_UART2EN_Msk                   (0x1UL<<RCC_APBENR3_UART2EN_Pos)                  /*!< 0x00000002 */
#define RCC_APBENR3_UART2EN                       RCC_APBENR3_UART2EN_Msk                           
#define RCC_APBENR3_USARTEN_Pos                   (6U)
#define RCC_APBENR3_USARTEN_Msk                   (0x1UL<<RCC_APBENR3_USARTEN_Pos)                  /*!< 0x00000040 */
#define RCC_APBENR3_USARTEN                       RCC_APBENR3_USARTEN_Msk                           
#define RCC_APBENR3_LPUARTEN_Pos                  (12U)
#define RCC_APBENR3_LPUARTEN_Msk                  (0x1UL<<RCC_APBENR3_LPUARTEN_Pos)                 /*!< 0x00001000 */
#define RCC_APBENR3_LPUARTEN                      RCC_APBENR3_LPUARTEN_Msk                          
#define RCC_APBENR3_I2C1EN_Pos                    (16U)
#define RCC_APBENR3_I2C1EN_Msk                    (0x1UL<<RCC_APBENR3_I2C1EN_Pos)                   /*!< 0x00010000 */
#define RCC_APBENR3_I2C1EN                        RCC_APBENR3_I2C1EN_Msk                            
#define RCC_APBENR3_I2C2EN_Pos                    (17U)
#define RCC_APBENR3_I2C2EN_Msk                    (0x1UL<<RCC_APBENR3_I2C2EN_Pos)                   /*!< 0x00020000 */
#define RCC_APBENR3_I2C2EN                        RCC_APBENR3_I2C2EN_Msk                            
#define RCC_APBENR3_SPI1EN_Pos                    (22U)
#define RCC_APBENR3_SPI1EN_Msk                    (0x1UL<<RCC_APBENR3_SPI1EN_Pos)                   /*!< 0x00400000 */
#define RCC_APBENR3_SPI1EN                        RCC_APBENR3_SPI1EN_Msk                            
#define RCC_APBENR3_SPI2EN_Pos                    (23U)
#define RCC_APBENR3_SPI2EN_Msk                    (0x1UL<<RCC_APBENR3_SPI2EN_Pos)                   /*!< 0x00800000 */
#define RCC_APBENR3_SPI2EN                        RCC_APBENR3_SPI2EN_Msk                            
#define RCC_APBENR3_CANEN_Pos                     (28U)
#define RCC_APBENR3_CANEN_Msk                     (0x1UL<<RCC_APBENR3_CANEN_Pos)                    /*!< 0x10000000 */
#define RCC_APBENR3_CANEN                         RCC_APBENR3_CANEN_Msk                             

/********************************* Bit definition for RCC_APBENR4 register ******************************************/
#define RCC_APBENR4_SYSCFGEN_Pos                  (0U)
#define RCC_APBENR4_SYSCFGEN_Msk                  (0x1UL<<RCC_APBENR4_SYSCFGEN_Pos)                 /*!< 0x00000001 */
#define RCC_APBENR4_SYSCFGEN                      RCC_APBENR4_SYSCFGEN_Msk                          
#define RCC_APBENR4_VREFBUFEN_Pos                 (8U)
#define RCC_APBENR4_VREFBUFEN_Msk                 (0x1UL<<RCC_APBENR4_VREFBUFEN_Pos)                /*!< 0x00000100 */
#define RCC_APBENR4_VREFBUFEN                     RCC_APBENR4_VREFBUFEN_Msk                         
#define RCC_APBENR4_PWREN_Pos                     (9U)
#define RCC_APBENR4_PWREN_Msk                     (0x1UL<<RCC_APBENR4_PWREN_Pos)                    /*!< 0x00000200 */
#define RCC_APBENR4_PWREN                         RCC_APBENR4_PWREN_Msk                             
#define RCC_APBENR4_ADC1EN_Pos                    (11U)
#define RCC_APBENR4_ADC1EN_Msk                    (0x1UL<<RCC_APBENR4_ADC1EN_Pos)                   /*!< 0x00000800 */
#define RCC_APBENR4_ADC1EN                        RCC_APBENR4_ADC1EN_Msk                            
#define RCC_APBENR4_ADC2EN_Pos                    (12U)
#define RCC_APBENR4_ADC2EN_Msk                    (0x1UL<<RCC_APBENR4_ADC2EN_Pos)                   /*!< 0x00001000 */
#define RCC_APBENR4_ADC2EN                        RCC_APBENR4_ADC2EN_Msk                            
#define RCC_APBENR4_DACEN_Pos                     (16U)
#define RCC_APBENR4_DACEN_Msk                     (0x1UL<<RCC_APBENR4_DACEN_Pos)                    /*!< 0x00010000 */
#define RCC_APBENR4_DACEN                         RCC_APBENR4_DACEN_Msk                             
#define RCC_APBENR4_OPAEN_Pos                     (20U)
#define RCC_APBENR4_OPAEN_Msk                     (0x1UL<<RCC_APBENR4_OPAEN_Pos)                    /*!< 0x00100000 */
#define RCC_APBENR4_OPAEN                         RCC_APBENR4_OPAEN_Msk                             
#define RCC_APBENR4_COMPEN_Pos                    (24U)
#define RCC_APBENR4_COMPEN_Msk                    (0x1UL<<RCC_APBENR4_COMPEN_Pos)                   /*!< 0x01000000 */
#define RCC_APBENR4_COMPEN                        RCC_APBENR4_COMPEN_Msk                            

/********************************* Bit definition for RCC_CCIPR1 register *******************************************/
#define RCC_CCIPR1_USARTSEL_Pos                   (0U)
#define RCC_CCIPR1_USARTSEL_Msk                   (0x3UL<<RCC_CCIPR1_USARTSEL_Pos)                  /*!< 0x00000003 */
#define RCC_CCIPR1_USARTSEL                       RCC_CCIPR1_USARTSEL_Msk
#define RCC_CCIPR1_USARTSEL_0                     (0x1UL<<RCC_CCIPR1_USARTSEL_Pos)                  /*!< 0x00000001 */
#define RCC_CCIPR1_USARTSEL_1                     (0x2UL<<RCC_CCIPR1_USARTSEL_Pos)                  /*!< 0x00000002 */
#define RCC_CCIPR1_LPUARTSEL_Pos                  (12U)
#define RCC_CCIPR1_LPUARTSEL_Msk                  (0x3UL<<RCC_CCIPR1_LPUARTSEL_Pos)                 /*!< 0x00003000 */
#define RCC_CCIPR1_LPUARTSEL                      RCC_CCIPR1_LPUARTSEL_Msk
#define RCC_CCIPR1_LPUARTSEL_0                    (0x1UL<<RCC_CCIPR1_LPUARTSEL_Pos)                 /*!< 0x00001000 */
#define RCC_CCIPR1_LPUARTSEL_1                    (0x2UL<<RCC_CCIPR1_LPUARTSEL_Pos)                 /*!< 0x00002000 */
#define RCC_CCIPR1_COMP1SEL_Pos                   (20U)
#define RCC_CCIPR1_COMP1SEL_Msk                   (0x3UL<<RCC_CCIPR1_COMP1SEL_Pos)                  /*!< 0x00300000 */
#define RCC_CCIPR1_COMP1SEL                       RCC_CCIPR1_COMP1SEL_Msk
#define RCC_CCIPR1_COMP1SEL_0                     (0x1UL<<RCC_CCIPR1_COMP1SEL_Pos)                  /*!< 0x00100000 */
#define RCC_CCIPR1_COMP1SEL_1                     (0x2UL<<RCC_CCIPR1_COMP1SEL_Pos)                  /*!< 0x00200000 */
#define RCC_CCIPR1_COMP2SEL_Pos                   (22U)
#define RCC_CCIPR1_COMP2SEL_Msk                   (0x3UL<<RCC_CCIPR1_COMP2SEL_Pos)                  /*!< 0x00C00000 */
#define RCC_CCIPR1_COMP2SEL                       RCC_CCIPR1_COMP2SEL_Msk
#define RCC_CCIPR1_COMP2SEL_0                     (0x1UL<<RCC_CCIPR1_COMP2SEL_Pos)                  /*!< 0x00400000 */
#define RCC_CCIPR1_COMP2SEL_1                     (0x2UL<<RCC_CCIPR1_COMP2SEL_Pos)                  /*!< 0x00800000 */
#define RCC_CCIPR1_COMP3SEL_Pos                   (24U)
#define RCC_CCIPR1_COMP3SEL_Msk                   (0x3UL<<RCC_CCIPR1_COMP3SEL_Pos)                  /*!< 0x03000000 */
#define RCC_CCIPR1_COMP3SEL                       RCC_CCIPR1_COMP3SEL_Msk
#define RCC_CCIPR1_COMP3SEL_0                     (0x1UL<<RCC_CCIPR1_COMP3SEL_Pos)                  /*!< 0x01000000 */
#define RCC_CCIPR1_COMP3SEL_1                     (0x2UL<<RCC_CCIPR1_COMP3SEL_Pos)                  /*!< 0x02000000 */
#define RCC_CCIPR1_COMP4SEL_Pos                   (26U)
#define RCC_CCIPR1_COMP4SEL_Msk                   (0x3UL<<RCC_CCIPR1_COMP4SEL_Pos)                  /*!< 0x0C000000 */
#define RCC_CCIPR1_COMP4SEL                       RCC_CCIPR1_COMP4SEL_Msk
#define RCC_CCIPR1_COMP4SEL_0                     (0x1UL<<RCC_CCIPR1_COMP4SEL_Pos)                  /*!< 0x04000000 */
#define RCC_CCIPR1_COMP4SEL_1                     (0x2UL<<RCC_CCIPR1_COMP4SEL_Pos)                  /*!< 0x08000000 */
#define RCC_CCIPR1_TIMCLKCTRL_Pos                 (28U)
#define RCC_CCIPR1_TIMCLKCTRL_Msk                 (0x1UL<<RCC_CCIPR1_TIMCLKCTRL_Pos)                /*!< 0x10000000 */
#define RCC_CCIPR1_TIMCLKCTRL                     RCC_CCIPR1_TIMCLKCTRL_Msk                         
#define RCC_CCIPR1_PVDSEL_Pos                     (29U)
#define RCC_CCIPR1_PVDSEL_Msk                     (0x3UL<<RCC_CCIPR1_PVDSEL_Pos)                    /*!< 0x60000000 */
#define RCC_CCIPR1_PVDSEL                         RCC_CCIPR1_PVDSEL_Msk
#define RCC_CCIPR1_PVDSEL_0                       (0x1UL<<RCC_CCIPR1_PVDSEL_Pos)                    /*!< 0x20000000 */
#define RCC_CCIPR1_PVDSEL_1                       (0x2UL<<RCC_CCIPR1_PVDSEL_Pos)                    /*!< 0x40000000 */

/********************************* Bit definition for RCC_CCIPR2 register *******************************************/
#define RCC_CCIPR2_CANCKSEL_Pos                   (0U)
#define RCC_CCIPR2_CANCKSEL_Msk                   (0x3UL<<RCC_CCIPR2_CANCKSEL_Pos)                  /*!< 0x00000003 */
#define RCC_CCIPR2_CANCKSEL                       RCC_CCIPR2_CANCKSEL_Msk
#define RCC_CCIPR2_CANCKSEL_0                     (0x1UL<<RCC_CCIPR2_CANCKSEL_Pos)                  /*!< 0x00000001 */
#define RCC_CCIPR2_CANCKSEL_1                     (0x2UL<<RCC_CCIPR2_CANCKSEL_Pos)                  /*!< 0x00000002 */
#define RCC_CCIPR2_ADC12SEL_Pos                   (8U)
#define RCC_CCIPR2_ADC12SEL_Msk                   (0x3UL<<RCC_CCIPR2_ADC12SEL_Pos)                  /*!< 0x00000300 */
#define RCC_CCIPR2_ADC12SEL                       RCC_CCIPR2_ADC12SEL_Msk
#define RCC_CCIPR2_ADC12SEL_0                     (0x1UL<<RCC_CCIPR2_ADC12SEL_Pos)                  /*!< 0x00000100 */
#define RCC_CCIPR2_ADC12SEL_1                     (0x2UL<<RCC_CCIPR2_ADC12SEL_Pos)                  /*!< 0x00000200 */
#define RCC_CCIPR2_ADC1KEN_Pos                    (10U)
#define RCC_CCIPR2_ADC1KEN_Msk                    (0x1UL<<RCC_CCIPR2_ADC1KEN_Pos)                   /*!< 0x00000400 */
#define RCC_CCIPR2_ADC1KEN                        RCC_CCIPR2_ADC1KEN_Msk                            
#define RCC_CCIPR2_ADC2KEN_Pos                    (14U)
#define RCC_CCIPR2_ADC2KEN_Msk                    (0x1UL<<RCC_CCIPR2_ADC2KEN_Pos)                   /*!< 0x00004000 */
#define RCC_CCIPR2_ADC2KEN                        RCC_CCIPR2_ADC2KEN_Msk                            
#define RCC_CCIPR2_LPTIMSEL_Pos                   (16U)
#define RCC_CCIPR2_LPTIMSEL_Msk                   (0x3UL<<RCC_CCIPR2_LPTIMSEL_Pos)                  /*!< 0x00030000 */
#define RCC_CCIPR2_LPTIMSEL                       RCC_CCIPR2_LPTIMSEL_Msk
#define RCC_CCIPR2_LPTIMSEL_0                     (0x1UL<<RCC_CCIPR2_LPTIMSEL_Pos)                  /*!< 0x00010000 */
#define RCC_CCIPR2_LPTIMSEL_1                     (0x2UL<<RCC_CCIPR2_LPTIMSEL_Pos)                  /*!< 0x00020000 */
#define RCC_CCIPR2_RTC_HSEDIV_SEL_Pos             (22U)
#define RCC_CCIPR2_RTC_HSEDIV_SEL_Msk             (0x3UL<<RCC_CCIPR2_RTC_HSEDIV_SEL_Pos)            /*!< 0x00C00000 */
#define RCC_CCIPR2_RTC_HSEDIV_SEL                 RCC_CCIPR2_RTC_HSEDIV_SEL_Msk
#define RCC_CCIPR2_RTC_HSEDIV_SEL_0               (0x1UL<<RCC_CCIPR2_RTC_HSEDIV_SEL_Pos)            /*!< 0x00400000 */
#define RCC_CCIPR2_RTC_HSEDIV_SEL_1               (0x2UL<<RCC_CCIPR2_RTC_HSEDIV_SEL_Pos)            /*!< 0x00800000 */
#define RCC_CCIPR2_HRPWM_TBCLKSYNC_Pos            (31U)
#define RCC_CCIPR2_HRPWM_TBCLKSYNC_Msk            (0x1UL<<RCC_CCIPR2_HRPWM_TBCLKSYNC_Pos)           /*!< 0x80000000 */
#define RCC_CCIPR2_HRPWM_TBCLKSYNC                RCC_CCIPR2_HRPWM_TBCLKSYNC_Msk                    

/********************************* Bit definition for RCC_CCIPR3 register *******************************************/
#define RCC_CCIPR3_PLL_ADC_DIV_Pos                (0U)
#define RCC_CCIPR3_PLL_ADC_DIV_Msk                (0x3UL<<RCC_CCIPR3_PLL_ADC_DIV_Pos)               /*!< 0x00000003 */
#define RCC_CCIPR3_PLL_ADC_DIV                    RCC_CCIPR3_PLL_ADC_DIV_Msk
#define RCC_CCIPR3_PLL_ADC_DIV_0                  (0x1UL<<RCC_CCIPR3_PLL_ADC_DIV_Pos)               /*!< 0x00000001 */
#define RCC_CCIPR3_PLL_ADC_DIV_1                  (0x2UL<<RCC_CCIPR3_PLL_ADC_DIV_Pos)               /*!< 0x00000002 */
#define RCC_CCIPR3_PLL_CAN_DIV_Pos                (24U)
#define RCC_CCIPR3_PLL_CAN_DIV_Msk                (0xFUL<<RCC_CCIPR3_PLL_CAN_DIV_Pos)               /*!< 0x0F000000 */
#define RCC_CCIPR3_PLL_CAN_DIV                    RCC_CCIPR3_PLL_CAN_DIV_Msk
#define RCC_CCIPR3_PLL_CAN_DIV_0                  (0x1UL<<RCC_CCIPR3_PLL_CAN_DIV_Pos)               /*!< 0x01000000 */
#define RCC_CCIPR3_PLL_CAN_DIV_1                  (0x2UL<<RCC_CCIPR3_PLL_CAN_DIV_Pos)               /*!< 0x02000000 */
#define RCC_CCIPR3_PLL_CAN_DIV_2                  (0x4UL<<RCC_CCIPR3_PLL_CAN_DIV_Pos)               /*!< 0x04000000 */
#define RCC_CCIPR3_PLL_CAN_DIV_3                  (0x8UL<<RCC_CCIPR3_PLL_CAN_DIV_Pos)               /*!< 0x08000000 */

