breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for GPIO_OSPEEDR register *****************************************/
#define GPIO_OSPEEDR_OSPEED0_Pos                  (0U)
#define GPIO_OSPEEDR_OSPEED0_Msk                  (0x3UL<<GPIO_OSPEEDR_OSPEED0_Pos)                 /*!< 0x00000003 */
#define GPIO_OSPEEDR_OSPEED0                      GPIO_OSPEEDR_OSPEED0_Msk                          /*!< GPIO0 output speed */
#define GPIO_OSPEEDR_OSPEED0_0                    (0x1UL<<GPIO_OSPEEDR_OSPEED0_Pos)                 /*!< 0x00000001 */
#define GPIO_OSPEEDR_OSPEED0_1                    (0x2UL<<GPIO_OSPEEDR_OSPEED0_Pos)                 /*!< 0x00000002 */
#define GPIO_OSPEEDR_OSPEED1_Pos                  (2U)
#define GPIO_OSPEEDR_OSPEED1_Msk                  (0x3UL<<GPIO_OSPEEDR_OSPEED1_Pos)                 /*!< 0x0000000C */
#define GPIO_OSPEEDR_OSPEED1                      GPIO_OSPEEDR_OSPEED1_Msk                          /*!< GPIO1 output speed */
#define GPIO_OSPEEDR_OSPEED1_0                    (0x1UL<<GPIO_OSPEEDR_OSPEED1_Pos)                 /*!< 0x00000004 */
#define GPIO_OSPEEDR_OSPEED1_1                    (0x2UL<<GPIO_OSPEEDR_OSPEED1_Pos)                 /*!< 0x00000008 */
#define GPIO_OSPEEDR_OSPEED2_Pos                  (4U)
#define GPIO_OSPEEDR_OSPEED2_Msk                  (0x3UL<<GPIO_OSPEEDR_OSPEED2_Pos)                 /*!< 0x00000030 */
#define GPIO_OSPEEDR_OSPEED2                      GPIO_OSPEEDR_OSPEED2_Msk                          /*!< GPIO2 output speed */
#define GPIO_OSPEEDR_OSPEED2_0                    (0x1UL<<GPIO_OSPEEDR_OSPEED2_Pos)                 /*!< 0x00000010 */
#define GPIO_OSPEEDR_OSPEED2_1                    (0x2UL<<GPIO_OSPEEDR_OSPEED2_Pos)                 /*!< 0x00000020 */
#define GPIO_OSPEEDR_OSPEED3_Pos                  (6U)
#define GPIO_OSPEEDR_OSPEED3_Msk                  (0x3UL<<GPIO_OSPEEDR_OSPEED3_Pos)                 /*!< 0x000000C0 */
#define GPIO_OSPEEDR_OSPEED3                      GPIO_OSPEEDR_OSPEED3_Msk                          /*!< GPIO3 output speed */
#define GPIO_OSPEEDR_OSPEED3_0                    (0x1UL<<GPIO_OSPEEDR_OSPEED3_Pos)                 /*!< 0x00000040 */
#define GPIO_OSPEEDR_OSPEED3_1                    (0x2UL<<GPIO_OSPEEDR_OSPEED3_Pos)                 /*!< 0x00000080 */
#define GPIO_OSPEEDR_OSPEED4_Pos                  (8U)
#define GPIO_OSPEEDR_OSPEED4_Msk                  (0x3UL<<GPIO_OSPEEDR_OSPEED4_Pos)                 /*!< 0x00000300 */
#define GPIO_OSPEEDR_OSPEED4                      GPIO_OSPEEDR_OSPEED4_Msk                          /*!< GPIO4 output speed */
#define GPIO_OSPEEDR_OSPEED4_0                    (0x1UL<<GPIO_OSPEEDR_OSPEED4_Pos)                 /*!< 0x00000100 */
#define GPIO_OSPEEDR_OSPEED4_1                    (0x2UL<<GPIO_OSPEEDR_OSPEED4_Pos)                 /*!< 0x00000200 */
#define GPIO_OSPEEDR_OSPEED5_Pos                  (10U)
#define GPIO_OSPEEDR_OSPEED5_Msk                  (0x3UL<<GPIO_OSPEEDR_OSPEED5_Pos)                 /*!< 0x00000C00 */
#define GPIO_OSPEEDR_OSPEED5                      GPIO_OSPEEDR_OSPEED5_Msk                          /*!< GPIO5 output speed */
#define GPIO_OSPEEDR_OSPEED5_0                    (0x1UL<<GPIO_OSPEEDR_OSPEED5_Pos)                 /*!< 0x00000400 */
#define GPIO_OSPEEDR_OSPEED5_1                    (0x2UL<<GPIO_OSPEEDR_OSPEED5_Pos)                 /*!< 0x00000800 */
#define GPIO_OSPEEDR_OSPEED6_Pos                  (12U)
#define GPIO_OSPEEDR_OSPEED6_Msk                  (0x3UL<<GPIO_OSPEEDR_OSPEED6_Pos)                 /*!< 0x00003000 */
#define GPIO_OSPEEDR_OSPEED6                      GPIO_OSPEEDR_OSPEED6_Msk                          /*!< GPIO6 output speed */
#define GPIO_OSPEEDR_OSPEED6_0                    (0x1UL<<GPIO_OSPEEDR_OSPEED6_Pos)                 /*!< 0x00001000 */
#define GPIO_OSPEEDR_OSPEED6_1                    (0x2UL<<GPIO_OSPEEDR_OSPEED6_Pos)                 /*!< 0x00002000 */
#define GPIO_OSPEEDR_OSPEED7_Pos                  (14U)
#define GPIO_OSPEEDR_OSPEED7_Msk                  (0x3UL<<GPIO_OSPEEDR_OSPEED7_Pos)                 /*!< 0x0000C000 */
#define GPIO_OSPEEDR_OSPEED7                      GPIO_OSPEEDR_OSPEED7_Msk                          /*!< GPIO7 output speed */
#define GPIO_OSPEEDR_OSPEED7_0                    (0x1UL<<GPIO_OSPEEDR_OSPEED7_Pos)                 /*!< 0x00004000 */
#define GPIO_OSPEEDR_OSPEED7_1                    (0x2UL<<GPIO_OSPEEDR_OSPEED7_Pos)                 /*!< 0x00008000 */
#define GPIO_OSPEEDR_OSPEED8_Pos                  (16U)
#define GPIO_OSPEEDR_OSPEED8_Msk                  (0x3UL<<GPIO_OSPEEDR_OSPEED8_Pos)                 /*!< 0x00030000 */
#define GPIO_OSPEEDR_OSPEED8                      GPIO_OSPEEDR_OSPEED8_Msk                          /*!< GPIO8 output speed */
#define GPIO_OSPEEDR_OSPEED8_0                    (0x1UL<<GPIO_OSPEEDR_OSPEED8_Pos)                 /*!< 0x00010000 */
#define GPIO_OSPEEDR_OSPEED8_1                    (0x2UL<<GPIO_OSPEEDR_OSPEED8_Pos)                 /*!< 0x00020000 */
#define GPIO_OSPEEDR_OSPEED9_Pos                  (18U)
#define GPIO_OSPEEDR_OSPEED9_Msk                  (0x3UL<<GPIO_OSPEEDR_OSPEED9_Pos)                 /*!< 0x000C0000 */
#define GPIO_OSPEEDR_OSPEED9                      GPIO_OSPEEDR_OSPEED9_Msk                          /*!< GPIO9 output speed */
#define GPIO_OSPEEDR_OSPEED9_0                    (0x1UL<<GPIO_OSPEEDR_OSPEED9_Pos)                 /*!< 0x00040000 */
#define GPIO_OSPEEDR_OSPEED9_1                    (0x2UL<<GPIO_OSPEEDR_OSPEED9_Pos)                 /*!< 0x00080000 */
#define GPIO_OSPEEDR_OSPEED10_Pos                 (20U)
#define GPIO_OSPEEDR_OSPEED10_Msk                 (0x3UL<<GPIO_OSPEEDR_OSPEED10_Pos)                /*!< 0x00300000 */
#define GPIO_OSPEEDR_OSPEED10                     GPIO_OSPEEDR_OSPEED10_Msk                         /*!< GPIO10 output speed */
#define GPIO_OSPEEDR_OSPEED10_0                   (0x1UL<<GPIO_OSPEEDR_OSPEED10_Pos)                /*!< 0x00100000 */
#define GPIO_OSPEEDR_OSPEED10_1                   (0x2UL<<GPIO_OSPEEDR_OSPEED10_Pos)                /*!< 0x00200000 */
#define GPIO_OSPEEDR_OSPEED11_Pos                 (22U)
#define GPIO_OSPEEDR_OSPEED11_Msk                 (0x3UL<<GPIO_OSPEEDR_OSPEED11_Pos)                /*!< 0x00C00000 */
#define GPIO_OSPEEDR_OSPEED11                     GPIO_OSPEEDR_OSPEED11_Msk                         /*!< GPIO11 output speed */
#define GPIO_OSPEEDR_OSPEED11_0                   (0x1UL<<GPIO_OSPEEDR_OSPEED11_Pos)                /*!< 0x00400000 */
#define GPIO_OSPEEDR_OSPEED11_1                   (0x2UL<<GPIO_OSPEEDR_OSPEED11_Pos)                /*!< 0x00800000 */
#define GPIO_OSPEEDR_OSPEED12_Pos                 (24U)
#define GPIO_OSPEEDR_OSPEED12_Msk                 (0x3UL<<GPIO_OSPEEDR_OSPEED12_Pos)                /*!< 0x03000000 */
#define GPIO_OSPEEDR_OSPEED12                     GPIO_OSPEEDR_OSPEED12_Msk                         /*!< GPIO12 output speed */
#define GPIO_OSPEEDR_OSPEED12_0                   (0x1UL<<GPIO_OSPEEDR_OSPEED12_Pos)                /*!< 0x01000000 */
#define GPIO_OSPEEDR_OSPEED12_1                   (0x2UL<<GPIO_OSPEEDR_OSPEED12_Pos)                /*!< 0x02000000 */
#define GPIO_OSPEEDR_OSPEED13_Pos                 (26U)
#define GPIO_OSPEEDR_OSPEED13_Msk                 (0x3UL<<GPIO_OSPEEDR_OSPEED13_Pos)                /*!< 0x0C000000 */
#define GPIO_OSPEEDR_OSPEED13                     GPIO_OSPEEDR_OSPEED13_Msk                         /*!< GPIO13 output speed */
#define GPIO_OSPEEDR_OSPEED13_0                   (0x1UL<<GPIO_OSPEEDR_OSPEED13_Pos)                /*!< 0x04000000 */
#define GPIO_OSPEEDR_OSPEED13_1                   (0x2UL<<GPIO_OSPEEDR_OSPEED13_Pos)                /*!< 0x08000000 */
#define GPIO_OSPEEDR_OSPEED14_Pos                 (28U)
#define GPIO_OSPEEDR_OSPEED14_Msk                 (0x3UL<<GPIO_OSPEEDR_OSPEED14_Pos)                /*!< 0x30000000 */
#define GPIO_OSPEEDR_OSPEED14                     GPIO_OSPEEDR_OSPEED14_Msk                         /*!< GPIO14 output speed */
#define GPIO_OSPEEDR_OSPEED14_0                   (0x1UL<<GPIO_OSPEEDR_OSPEED14_Pos)                /*!< 0x10000000 */
#define GPIO_OSPEEDR_OSPEED14_1                   (0x2UL<<GPIO_OSPEEDR_OSPEED14_Pos)                /*!< 0x20000000 */
#define GPIO_OSPEEDR_OSPEED15_Pos                 (30U)
#define GPIO_OSPEEDR_OSPEED15_Msk                 (0x3UL<<GPIO_OSPEEDR_OSPEED15_Pos)                /*!< 0xC0000000 */
#define GPIO_OSPEEDR_OSPEED15                     GPIO_OSPEEDR_OSPEED15_Msk                         /*!< GPIO15 output speed */
#define GPIO_OSPEEDR_OSPEED15_0                   (0x1UL<<GPIO_OSPEEDR_OSPEED15_Pos)                /*!< 0x40000000 */
#define GPIO_OSPEEDR_OSPEED15_1                   (0x2UL<<GPIO_OSPEEDR_OSPEED15_Pos)                /*!< 0x80000000 */

/********************************* Bit definition for GPIO_PUPDR register *******************************************/
#define GPIO_PUPDR_PUPD0_Pos                      (0U)
#define GPIO_PUPDR_PUPD0_Msk                      (0x3UL<<GPIO_PUPDR_PUPD0_Pos)                     /*!< 0x00000003 */
#define GPIO_PUPDR_PUPD0                          GPIO_PUPDR_PUPD0_Msk                              /*!< GPIO0 pull up/pull down */
#define GPIO_PUPDR_PUPD0_0                        (0x1UL<<GPIO_PUPDR_PUPD0_Pos)                     /*!< 0x00000001 */
#define GPIO_PUPDR_PUPD0_1                        (0x2UL<<GPIO_PUPDR_PUPD0_Pos)                     /*!< 0x00000002 */
#define GPIO_PUPDR_PUPD1_Pos                      (2U)
#define GPIO_PUPDR_PUPD1_Msk                      (0x3UL<<GPIO_PUPDR_PUPD1_Pos)                     /*!< 0x0000000C */
#define GPIO_PUPDR_PUPD1                          GPIO_PUPDR_PUPD1_Msk                              /*!< GPIO1 pull up/pull down */
#define GPIO_PUPDR_PUPD1_0                        (0x1UL<<GPIO_PUPDR_PUPD1_Pos)                     /*!< 0x00000004 */
#define GPIO_PUPDR_PUPD1_1                        (0x2UL<<GPIO_PUPDR_PUPD1_Pos)                     /*!< 0x00000008 */
#define GPIO_PUPDR_PUPD2_Pos                      (4U)
#define GPIO_PUPDR_PUPD2_Msk                      (0x3UL<<GPIO_PUPDR_PUPD2_Pos)                     /*!< 0x00000030 */
#define GPIO_PUPDR_PUPD2                          GPIO_PUPDR_PUPD2_Msk                              /*!< GPIO2 pull up/pull down */
#define GPIO_PUPDR_PUPD2_0                        (0x1UL<<GPIO_PUPDR_PUPD2_Pos)                     /*!< 0x00000010 */
#define GPIO_PUPDR_PUPD2_1                        (0x2UL<<GPIO_PUPDR_PUPD2_Pos)                     /*!< 0x00000020 */
#define GPIO_PUPDR_PUPD3_Pos                      (6U)
#define GPIO_PUPDR_PUPD3_Msk                      (0x3UL<<GPIO_PUPDR_PUPD3_Pos)                     /*!< 0x000000C0 */
#define GPIO_PUPDR_PUPD3                          GPIO_PUPDR_PUPD3_Msk                              /*!< GPIO3 pull up/pull down */
#define GPIO_PUPDR_PUPD3_0                        (0x1UL<<GPIO_PUPDR_PUPD3_Pos)                     /*!< 0x00000040 */
#define GPIO_PUPDR_PUPD3_1                        (0x2UL<<GPIO_PUPDR_PUPD3_Pos)                     /*!< 0x00000080 */
#define GPIO_PUPDR_PUPD4_Pos                      (8U)
#define GPIO_PUPDR_PUPD4_Msk                      (0x3UL<<GPIO_PUPDR_PUPD4_Pos)                     /*!< 0x00000300 */
#define GPIO_PUPDR_PUPD4                          GPIO_PUPDR_PUPD4_Msk                              /*!< GPIO4 pull up/pull down */
#define GPIO_PUPDR_PUPD4_0                        (0x1UL<<GPIO_PUPDR_PUPD4_Pos)                     /*!< 0x00000100 */
#define GPIO_PUPDR_PUPD4_1                        (0x2UL<<GPIO_PUPDR_PUPD4_Pos)                     /*!< 0x00000200 */
#define GPIO_PUPDR_PUPD5_Pos                      (10U)
#define GPIO_PUPDR_PUPD5_Msk                      (0x3UL<<GPIO_PUPDR_PUPD5_Pos)                     /*!< 0x00000C00 */
#define GPIO_PUPDR_PUPD5                          GPIO_PUPDR_PUPD5_Msk                              /*!< GPIO5 pull up/pull down */
#define GPIO_PUPDR_PUPD5_0                        (0x1UL<<GPIO_PUPDR_PUPD5_Pos)                     /*!< 0x00000400 */
#define GPIO_PUPDR_PUPD5_1                        (0x2UL<<GPIO_PUPDR_PUPD5_Pos)                     /*!< 0x00000800 */
#define GPIO_PUPDR_PUPD6_Pos                      (12U)
#define GPIO_PUPDR_PUPD6_Msk                      (0x3UL<<GPIO_PUPDR_PUPD6_Pos)                     /*!< 0x00003000 */
#define GPIO_PUPDR_PUPD6                          GPIO_PUPDR_PUPD6_Msk                              /*!< GPIO6 pull up/pull down */
#define GPIO_PUPDR_PUPD6_0                        (0x1UL<<GPIO_PUPDR_PUPD6_Pos)                     /*!< 0x00001000 */
#define GPIO_PUPDR_PUPD6_1                        (0x2UL<<GPIO_PUPDR_PUPD6_Pos)                     /*!< 0x00002000 */
#define GPIO_PUPDR_PUPD7_Pos                      (14U)
#define GPIO_PUPDR_PUPD7_Msk                      (0x3UL<<GPIO_PUPDR_PUPD7_Pos)                     /*!< 0x0000C000 */
#define GPIO_PUPDR_PUPD7                          GPIO_PUPDR_PUPD7_Msk                              /*!< GPIO7 pull up/pull down */
#define GPIO_PUPDR_PUPD7_0                        (0x1UL<<GPIO_PUPDR_PUPD7_Pos)                     /*!< 0x00004000 */
#define GPIO_PUPDR_PUPD7_1                        (0x2UL<<GPIO_PUPDR_PUPD7_Pos)                     /*!< 0x00008000 */
#define GPIO_PUPDR_PUPD8_Pos                      (16U)
#define GPIO_PUPDR_PUPD8_Msk                      (0x3UL<<GPIO_PUPDR_PUPD8_Pos)                     /*!< 0x00030000 */
#define GPIO_PUPDR_PUPD8                          GPIO_PUPDR_PUPD8_Msk                              /*!< GPIO8 pull up/pull down */
#define GPIO_PUPDR_PUPD8_0                        (0x1UL<<GPIO_PUPDR_PUPD8_Pos)                     /*!< 0x00010000 */
#define GPIO_PUPDR_PUPD8_1                        (0x2UL<<GPIO_PUPDR_PUPD8_Pos)                     /*!< 0x00020000 */
#define GPIO_PUPDR_PUPD9_Pos                      (18U)
#define GPIO_PUPDR_PUPD9_Msk                      (0x3UL<<GPIO_PUPDR_PUPD9_Pos)                     /*!< 0x000C0000 */
#define GPIO_PUPDR_PUPD9                          GPIO_PUPDR_PUPD9_Msk                              /*!< GPIO9 pull up/pull down */
#define GPIO_PUPDR_PUPD9_0                        (0x1UL<<GPIO_PUPDR_PUPD9_Pos)                     /*!< 0x00040000 */
#define GPIO_PUPDR_PUPD9_1                        (0x2UL<<GPIO_PUPDR_PUPD9_Pos)                     /*!< 0x00080000 */
#define GPIO_PUPDR_PUPD10_Pos                     (20U)
#define GPIO_PUPDR_PUPD10_Msk                     (0x3UL<<GPIO_PUPDR_PUPD10_Pos)                    /*!< 0x00300000 */
#define GPIO_PUPDR_PUPD10                         GPIO_PUPDR_PUPD10_Msk                             /*!< GPIO10 pull up/pull down */
#define GPIO_PUPDR_PUPD10_0                       (0x1UL<<GPIO_PUPDR_PUPD10_Pos)                    /*!< 0x00100000 */
#define GPIO_PUPDR_PUPD10_1                       (0x2UL<<GPIO_PUPDR_PUPD10_Pos)                    /*!< 0x00200000 */
#define GPIO_PUPDR_PUPD11_Pos                     (22U)
#define GPIO_PUPDR_PUPD11_Msk                     (0x3UL<<GPIO_PUPDR_PUPD11_Pos)                    /*!< 0x00C00000 */
#define GPIO_PUPDR_PUPD11                         GPIO_PUPDR_PUPD11_Msk                             /*!< GPIO11 pull up/pull down */
#define GPIO_PUPDR_PUPD11_0                       (0x1UL<<GPIO_PUPDR_PUPD11_Pos)                    /*!< 0x00400000 */
#define GPIO_PUPDR_PUPD11_1                       (0x2UL<<GPIO_PUPDR_PUPD11_Pos)                    /*!< 0x00800000 */
#define GPIO_PUPDR_PUPD12_Pos                     (24U)
#define GPIO_PUPDR_PUPD12_Msk                     (0x3UL<<GPIO_PUPDR_PUPD12_Pos)                    /*!< 0x03000000 */
#define GPIO_PUPDR_PUPD12                         GPIO_PUPDR_PUPD12_Msk                             /*!< GPIO12 pull up/pull down */
#define GPIO_PUPDR_PUPD12_0                       (0x1UL<<GPIO_PUPDR_PUPD12_Pos)                    /*!< 0x01000000 */
#define GPIO_PUPDR_PUPD12_1                       (0x2UL<<GPIO_PUPDR_PUPD12_Pos)                    /*!< 0x02000000 */
#define GPIO_PUPDR_PUPD13_Pos                     (26U)
#define GPIO_PUPDR_PUPD13_Msk                     (0x3UL<<GPIO_PUPDR_PUPD13_Pos)                    /*!< 0x0C000000 */
#define GPIO_PUPDR_PUPD13                         GPIO_PUPDR_PUPD13_Msk                             /*!< GPIO13 pull up/pull down */
#define GPIO_PUPDR_PUPD13_0                       (0x1UL<<GPIO_PUPDR_PUPD13_Pos)                    /*!< 0x04000000 */
#define GPIO_PUPDR_PUPD13_1                       (0x2UL<<GPIO_PUPDR_PUPD13_Pos)                    /*!< 0x08000000 */
#define GPIO_PUPDR_PUPD14_Pos                     (28U)
#define GPIO_PUPDR_PUPD14_Msk                     (0x3UL<<GPIO_PUPDR_PUPD14_Pos)                    /*!< 0x30000000 */
#define GPIO_PUPDR_PUPD14                         GPIO_PUPDR_PUPD14_Msk                             /*!< GPIO14 pull up/pull down */
#define GPIO_PUPDR_PUPD14_0                       (0x1UL<<GPIO_PUPDR_PUPD14_Pos)                    /*!< 0x10000000 */
#define GPIO_PUPDR_PUPD14_1                       (0x2UL<<GPIO_PUPDR_PUPD14_Pos)                    /*!< 0x20000000 */
#define GPIO_PUPDR_PUPD15_Pos                     (30U)
#define GPIO_PUPDR_PUPD15_Msk                     (0x3UL<<GPIO_PUPDR_PUPD15_Pos)                    /*!< 0xC0000000 */
#define GPIO_PUPDR_PUPD15                         GPIO_PUPDR_PUPD15_Msk                             /*!< GPIO15 pull up/pull down */
#define GPIO_PUPDR_PUPD15_0                       (0x1UL<<GPIO_PUPDR_PUPD15_Pos)                    /*!< 0x40000000 */
#define GPIO_PUPDR_PUPD15_1                       (0x2UL<<GPIO_PUPDR_PUPD15_Pos)                    /*!< 0x80000000 */

/********************************* Bit definition for GPIO_IDR register *********************************************/
#define GPIO_IDR_ID0_Pos                          (0U)
#define GPIO_IDR_ID0_Msk                          (0x1UL<<GPIO_IDR_ID0_Pos)                         /*!< 0x00000001 */
#define GPIO_IDR_ID0                              GPIO_IDR_ID0_Msk                                  /*!< GPIO0 input data */
#define GPIO_IDR_ID1_Pos                          (1U)
#define GPIO_IDR_ID1_Msk                          (0x1UL<<GPIO_IDR_ID1_Pos)                         /*!< 0x00000002 */
#define GPIO_IDR_ID1                              GPIO_IDR_ID1_Msk                                  /*!< GPIO1 input data */
#define GPIO_IDR_ID2_Pos                          (2U)
#define GPIO_IDR_ID2_Msk                          (0x1UL<<GPIO_IDR_ID2_Pos)                         /*!< 0x00000004 */
#define GPIO_IDR_ID2                              GPIO_IDR_ID2_Msk                                  /*!< GPIO2 input data */
#define GPIO_IDR_ID3_Pos                          (3U)
#define GPIO_IDR_ID3_Msk                          (0x1UL<<GPIO_IDR_ID3_Pos)                         /*!< 0x00000008 */
#define GPIO_IDR_ID3                              GPIO_IDR_ID3_Msk                                  /*!< GPIO3 input data */
#define GPIO_IDR_ID4_Pos                          (4U)
#define GPIO_IDR_ID4_Msk                          (0x1UL<<GPIO_IDR_ID4_Pos)                         /*!< 0x00000010 */
#define GPIO_IDR_ID4                              GPIO_IDR_ID4_Msk                                  /*!< GPIO4 input data */
#define GPIO_IDR_ID5_Pos                          (5U)
#define GPIO_IDR_ID5_Msk                          (0x1UL<<GPIO_IDR_ID5_Pos)                         /*!< 0x00000020 */
#define GPIO_IDR_ID5                              GPIO_IDR_ID5_Msk                                  /*!< GPIO5 input data */
#define GPIO_IDR_ID6_Pos                          (6U)
#define GPIO_IDR_ID6_Msk                          (0x1UL<<GPIO_IDR_ID6_Pos)                         /*!< 0x00000040 */
#define GPIO_IDR_ID6                              GPIO_IDR_ID6_Msk                                  /*!< GPIO6 input data */
#define GPIO_IDR_ID7_Pos                          (7U)
#define GPIO_IDR_ID7_Msk                          (0x1UL<<GPIO_IDR_ID7_Pos)                         /*!< 0x00000080 */
#define GPIO_IDR_ID7                              GPIO_IDR_ID7_Msk                                  /*!< GPIO7 input data */
#define GPIO_IDR_ID8_Pos                          (8U)
#define GPIO_IDR_ID8_Msk                          (0x1UL<<GPIO_IDR_ID8_Pos)                         /*!< 0x00000100 */
#define GPIO_IDR_ID8                              GPIO_IDR_ID8_Msk                                  /*!< GPIO8 input data */
#define GPIO_IDR_ID9_Pos                          (9U)
#define GPIO_IDR_ID9_Msk                          (0x1UL<<GPIO_IDR_ID9_Pos)                         /*!< 0x00000200 */
#define GPIO_IDR_ID9                              GPIO_IDR_ID9_Msk                                  /*!< GPIO9 input data */
#define GPIO_IDR_ID10_Pos                         (10U)
#define GPIO_IDR_ID10_Msk                         (0x1UL<<GPIO_IDR_ID10_Pos)                        /*!< 0x00000400 */
#define GPIO_IDR_ID10                             GPIO_IDR_ID10_Msk                                 /*!< GPIO10 input data */
#define GPIO_IDR_ID11_Pos                         (11U)
#define GPIO_IDR_ID11_Msk                         (0x1UL<<GPIO_IDR_ID11_Pos)                        /*!< 0x00000800 */
#define GPIO_IDR_ID11                             GPIO_IDR_ID11_Msk                                 /*!< GPIO11 input data */
#define GPIO_IDR_ID12_Pos                         (12U)
#define GPIO_IDR_ID12_Msk                         (0x1UL<<GPIO_IDR_ID12_Pos)                        /*!< 0x00001000 */
#define GPIO_IDR_ID12                             GPIO_IDR_ID12_Msk                                 /*!< GPIO12 input data */
#define GPIO_IDR_ID13_Pos                         (13U)
#define GPIO_IDR_ID13_Msk                         (0x1UL<<GPIO_IDR_ID13_Pos)                        /*!< 0x00002000 */
#define GPIO_IDR_ID13                             GPIO_IDR_ID13_Msk                                 /*!< GPIO13 input data */
#define GPIO_IDR_ID14_Pos                         (14U)
#define GPIO_IDR_ID14_Msk                         (0x1UL<<GPIO_IDR_ID14_Pos)                        /*!< 0x00004000 */
#define GPIO_IDR_ID14                             GPIO_IDR_ID14_Msk                                 /*!< GPIO14 input data */
#define GPIO_IDR_ID15_Pos                         (15U)
#define GPIO_IDR_ID15_Msk                         (0x1UL<<GPIO_IDR_ID15_Pos)                        /*!< 0x00008000 */
#define GPIO_IDR_ID15                             GPIO_IDR_ID15_Msk                                 /*!< GPIO15 input data */

