breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************************************************************************************************/
/********************************* SYSCFG ***************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for SYSCFG_CFGR1 register *****************************************/
#define SYSCFG_CFGR1_MEM_MODE_Pos                 (0U)
#define SYSCFG_CFGR1_MEM_MODE_Msk                 (0x3UL<<SYSCFG_CFGR1_MEM_MODE_Pos)                /*!< 0x00000003 */
#define SYSCFG_CFGR1_MEM_MODE                     SYSCFG_CFGR1_MEM_MODE_Msk
#define SYSCFG_CFGR1_MEM_MODE_0                   (0x1UL<<SYSCFG_CFGR1_MEM_MODE_Pos)                /*!< 0x00000001 */
#define SYSCFG_CFGR1_MEM_MODE_1                   (0x2UL<<SYSCFG_CFGR1_MEM_MODE_Pos)                /*!< 0x00000002 */
#define SYSCFG_CFGR1_I2C1_FMP_Pos                 (2U)
#define SYSCFG_CFGR1_I2C1_FMP_Msk                 (0x1UL<<SYSCFG_CFGR1_I2C1_FMP_Pos)                /*!< 0x00000004 */
#define SYSCFG_CFGR1_I2C1_FMP                     SYSCFG_CFGR1_I2C1_FMP_Msk                         
#define SYSCFG_CFGR1_I2C2_FMP_Pos                 (3U)
#define SYSCFG_CFGR1_I2C2_FMP_Msk                 (0x1UL<<SYSCFG_CFGR1_I2C2_FMP_Pos)                /*!< 0x00000008 */
#define SYSCFG_CFGR1_I2C2_FMP                     SYSCFG_CFGR1_I2C2_FMP_Msk                         
#define SYSCFG_CFGR1_I2C1_FLTEN_Pos               (4U)
#define SYSCFG_CFGR1_I2C1_FLTEN_Msk               (0x1UL<<SYSCFG_CFGR1_I2C1_FLTEN_Pos)              /*!< 0x00000010 */
#define SYSCFG_CFGR1_I2C1_FLTEN                   SYSCFG_CFGR1_I2C1_FLTEN_Msk                       
#define SYSCFG_CFGR1_I2C2_FLTEN_Pos               (5U)
#define SYSCFG_CFGR1_I2C2_FLTEN_Msk               (0x1UL<<SYSCFG_CFGR1_I2C2_FLTEN_Pos)              /*!< 0x00000020 */
#define SYSCFG_CFGR1_I2C2_FLTEN                   SYSCFG_CFGR1_I2C2_FLTEN_Msk                       

/********************************* Bit definition for SYSCFG_CFGR2 register *****************************************/
#define SYSCFG_CFGR2_CLL_Pos                      (0U)
#define SYSCFG_CFGR2_CLL_Msk                      (0x1UL<<SYSCFG_CFGR2_CLL_Pos)                     /*!< 0x00000001 */
#define SYSCFG_CFGR2_CLL                          SYSCFG_CFGR2_CLL_Msk                              
#define SYSCFG_CFGR2_PVDL_Pos                     (2U)
#define SYSCFG_CFGR2_PVDL_Msk                     (0x1UL<<SYSCFG_CFGR2_PVDL_Pos)                    /*!< 0x00000004 */
#define SYSCFG_CFGR2_PVDL                         SYSCFG_CFGR2_PVDL_Msk                             

/********************************* Bit definition for SYSCFG_CFGR3 register *****************************************/
#define SYSCFG_CFGR3_DMA_MAP1_Pos                 (0U)
#define SYSCFG_CFGR3_DMA_MAP1_Msk                 (0x7FUL<<SYSCFG_CFGR3_DMA_MAP1_Pos)               /*!< 0x0000007F */
#define SYSCFG_CFGR3_DMA_MAP1                     SYSCFG_CFGR3_DMA_MAP1_Msk
#define SYSCFG_CFGR3_DMA_MAP2_Pos                 (8U)
#define SYSCFG_CFGR3_DMA_MAP2_Msk                 (0x7FUL<<SYSCFG_CFGR3_DMA_MAP2_Pos)               /*!< 0x00007F00 */
#define SYSCFG_CFGR3_DMA_MAP2                     SYSCFG_CFGR3_DMA_MAP2_Msk
#define SYSCFG_CFGR3_DMA_MAP3_Pos                 (16U)
#define SYSCFG_CFGR3_DMA_MAP3_Msk                 (0x7FUL<<SYSCFG_CFGR3_DMA_MAP3_Pos)               /*!< 0x007F0000 */
#define SYSCFG_CFGR3_DMA_MAP3                     SYSCFG_CFGR3_DMA_MAP3_Msk
#define SYSCFG_CFGR3_DMA_MAP4_Pos                 (24U)
#define SYSCFG_CFGR3_DMA_MAP4_Msk                 (0x7FUL<<SYSCFG_CFGR3_DMA_MAP4_Pos)               /*!< 0x7F000000 */
#define SYSCFG_CFGR3_DMA_MAP4                     SYSCFG_CFGR3_DMA_MAP4_Msk

/********************************* Bit definition for SYSCFG_CFGR4 register *****************************************/
#define SYSCFG_CFGR4_DMA_MAP5_Pos                 (0U)
#define SYSCFG_CFGR4_DMA_MAP5_Msk                 (0x7FUL<<SYSCFG_CFGR4_DMA_MAP5_Pos)               /*!< 0x0000007F */
#define SYSCFG_CFGR4_DMA_MAP5                     SYSCFG_CFGR4_DMA_MAP5_Msk

/********************************* Bit definition for SYSCFG_EXTICR1 register ***************************************/
#define SYSCFG_EXTICR1_EXTI0_Pos                  (0U)
#define SYSCFG_EXTICR1_EXTI0_Msk                  (0x3UL<<SYSCFG_EXTICR1_EXTI0_Pos)                 /*!< 0x00000003 */
#define SYSCFG_EXTICR1_EXTI0                      SYSCFG_EXTICR1_EXTI0_Msk
#define SYSCFG_EXTICR1_EXTI0_0                    (0x1UL<<SYSCFG_EXTICR1_EXTI0_Pos)                 /*!< 0x00000001 */
#define SYSCFG_EXTICR1_EXTI0_1                    (0x2UL<<SYSCFG_EXTICR1_EXTI0_Pos)                 /*!< 0x00000002 */
#define SYSCFG_EXTICR1_EXTI1_Pos                  (4U)
#define SYSCFG_EXTICR1_EXTI1_Msk                  (0x3UL<<SYSCFG_EXTICR1_EXTI1_Pos)                 /*!< 0x00000030 */
#define SYSCFG_EXTICR1_EXTI1                      SYSCFG_EXTICR1_EXTI1_Msk
#define SYSCFG_EXTICR1_EXTI1_0                    (0x1UL<<SYSCFG_EXTICR1_EXTI1_Pos)                 /*!< 0x00000010 */
#define SYSCFG_EXTICR1_EXTI1_1                    (0x2UL<<SYSCFG_EXTICR1_EXTI1_Pos)                 /*!< 0x00000020 */
#define SYSCFG_EXTICR1_EXTI2_Pos                  (8U)
#define SYSCFG_EXTICR1_EXTI2_Msk                  (0x3UL<<SYSCFG_EXTICR1_EXTI2_Pos)                 /*!< 0x00000300 */
#define SYSCFG_EXTICR1_EXTI2                      SYSCFG_EXTICR1_EXTI2_Msk
#define SYSCFG_EXTICR1_EXTI2_0                    (0x1UL<<SYSCFG_EXTICR1_EXTI2_Pos)                 /*!< 0x00000100 */
#define SYSCFG_EXTICR1_EXTI2_1                    (0x2UL<<SYSCFG_EXTICR1_EXTI2_Pos)                 /*!< 0x00000200 */
#define SYSCFG_EXTICR1_EXTI3_Pos                  (12U)
#define SYSCFG_EXTICR1_EXTI3_Msk                  (0x3UL<<SYSCFG_EXTICR1_EXTI3_Pos)                 /*!< 0x00003000 */
#define SYSCFG_EXTICR1_EXTI3                      SYSCFG_EXTICR1_EXTI3_Msk
#define SYSCFG_EXTICR1_EXTI3_0                    (0x1UL<<SYSCFG_EXTICR1_EXTI3_Pos)                 /*!< 0x00001000 */
#define SYSCFG_EXTICR1_EXTI3_1                    (0x2UL<<SYSCFG_EXTICR1_EXTI3_Pos)                 /*!< 0x00002000 */

