breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for SYSCFG_EXTICR2 register ***************************************/
#define SYSCFG_EXTICR2_EXTI4_Pos                  (0U)
#define SYSCFG_EXTICR2_EXTI4_Msk                  (0x3UL<<SYSCFG_EXTICR2_EXTI4_Pos)                 /*!< 0x00000003 */
#define SYSCFG_EXTICR2_EXTI4                      SYSCFG_EXTICR2_EXTI4_Msk
#define SYSCFG_EXTICR2_EXTI4_0                    (0x1UL<<SYSCFG_EXTICR2_EXTI4_Pos)                 /*!< 0x00000001 */
#define SYSCFG_EXTICR2_EXTI4_1                    (0x2UL<<SYSCFG_EXTICR2_EXTI4_Pos)                 /*!< 0x00000002 */
#define SYSCFG_EXTICR2_EXTI5_Pos                  (4U)
#define SYSCFG_EXTICR2_EXTI5_Msk                  (0x3UL<<SYSCFG_EXTICR2_EXTI5_Pos)                 /*!< 0x00000030 */
#define SYSCFG_EXTICR2_EXTI5                      SYSCFG_EXTICR2_EXTI5_Msk
#define SYSCFG_EXTICR2_EXTI5_0                    (0x1UL<<SYSCFG_EXTICR2_EXTI5_Pos)                 /*!< 0x00000010 */
#define SYSCFG_EXTICR2_EXTI5_1                    (0x2UL<<SYSCFG_EXTICR2_EXTI5_Pos)                 /*!< 0x00000020 */
#define SYSCFG_EXTICR2_EXTI6_Pos                  (8U)
#define SYSCFG_EXTICR2_EXTI6_Msk                  (0x3UL<<SYSCFG_EXTICR2_EXTI6_Pos)                 /*!< 0x00000300 */
#define SYSCFG_EXTICR2_EXTI6                      SYSCFG_EXTICR2_EXTI6_Msk
#define SYSCFG_EXTICR2_EXTI6_0                    (0x1UL<<SYSCFG_EXTICR2_EXTI6_Pos)                 /*!< 0x00000100 */
#define SYSCFG_EXTICR2_EXTI6_1                    (0x2UL<<SYSCFG_EXTICR2_EXTI6_Pos)                 /*!< 0x00000200 */
#define SYSCFG_EXTICR2_EXTI7_Pos                  (12U)
#define SYSCFG_EXTICR2_EXTI7_Msk                  (0x3UL<<SYSCFG_EXTICR2_EXTI7_Pos)                 /*!< 0x00003000 */
#define SYSCFG_EXTICR2_EXTI7                      SYSCFG_EXTICR2_EXTI7_Msk
#define SYSCFG_EXTICR2_EXTI7_0                    (0x1UL<<SYSCFG_EXTICR2_EXTI7_Pos)                 /*!< 0x00001000 */
#define SYSCFG_EXTICR2_EXTI7_1                    (0x2UL<<SYSCFG_EXTICR2_EXTI7_Pos)                 /*!< 0x00002000 */

/********************************* Bit definition for SYSCFG_EXTICR3 register ***************************************/
#define SYSCFG_EXTICR3_EXTI8_Pos                  (0U)
#define SYSCFG_EXTICR3_EXTI8_Msk                  (0x3UL<<SYSCFG_EXTICR3_EXTI8_Pos)                 /*!< 0x00000003 */
#define SYSCFG_EXTICR3_EXTI8                      SYSCFG_EXTICR3_EXTI8_Msk
#define SYSCFG_EXTICR3_EXTI8_0                    (0x1UL<<SYSCFG_EXTICR3_EXTI8_Pos)                 /*!< 0x00000001 */
#define SYSCFG_EXTICR3_EXTI8_1                    (0x2UL<<SYSCFG_EXTICR3_EXTI8_Pos)                 /*!< 0x00000002 */
#define SYSCFG_EXTICR3_EXTI9_Pos                  (4U)
#define SYSCFG_EXTICR3_EXTI9_Msk                  (0x3UL<<SYSCFG_EXTICR3_EXTI9_Pos)                 /*!< 0x00000030 */
#define SYSCFG_EXTICR3_EXTI9                      SYSCFG_EXTICR3_EXTI9_Msk
#define SYSCFG_EXTICR3_EXTI9_0                    (0x1UL<<SYSCFG_EXTICR3_EXTI9_Pos)                 /*!< 0x00000010 */
#define SYSCFG_EXTICR3_EXTI9_1                    (0x2UL<<SYSCFG_EXTICR3_EXTI9_Pos)                 /*!< 0x00000020 */
#define SYSCFG_EXTICR3_EXTI10_Pos                 (8U)
#define SYSCFG_EXTICR3_EXTI10_Msk                 (0x3UL<<SYSCFG_EXTICR3_EXTI10_Pos)                /*!< 0x00000300 */
#define SYSCFG_EXTICR3_EXTI10                     SYSCFG_EXTICR3_EXTI10_Msk
#define SYSCFG_EXTICR3_EXTI10_0                   (0x1UL<<SYSCFG_EXTICR3_EXTI10_Pos)                /*!< 0x00000100 */
#define SYSCFG_EXTICR3_EXTI10_1                   (0x2UL<<SYSCFG_EXTICR3_EXTI10_Pos)                /*!< 0x00000200 */
#define SYSCFG_EXTICR3_EXTI11_Pos                 (12U)
#define SYSCFG_EXTICR3_EXTI11_Msk                 (0x3UL<<SYSCFG_EXTICR3_EXTI11_Pos)                /*!< 0x00003000 */
#define SYSCFG_EXTICR3_EXTI11                     SYSCFG_EXTICR3_EXTI11_Msk
#define SYSCFG_EXTICR3_EXTI11_0                   (0x1UL<<SYSCFG_EXTICR3_EXTI11_Pos)                /*!< 0x00001000 */
#define SYSCFG_EXTICR3_EXTI11_1                   (0x2UL<<SYSCFG_EXTICR3_EXTI11_Pos)                /*!< 0x00002000 */

/********************************* Bit definition for SYSCFG_EXTICR4 register ***************************************/
#define SYSCFG_EXTICR4_EXTI12_Pos                 (0U)
#define SYSCFG_EXTICR4_EXTI12_Msk                 (0x3UL<<SYSCFG_EXTICR4_EXTI12_Pos)                /*!< 0x00000003 */
#define SYSCFG_EXTICR4_EXTI12                     SYSCFG_EXTICR4_EXTI12_Msk
#define SYSCFG_EXTICR4_EXTI12_0                   (0x1UL<<SYSCFG_EXTICR4_EXTI12_Pos)                /*!< 0x00000001 */
#define SYSCFG_EXTICR4_EXTI12_1                   (0x2UL<<SYSCFG_EXTICR4_EXTI12_Pos)                /*!< 0x00000002 */
#define SYSCFG_EXTICR4_EXTI13_Pos                 (4U)
#define SYSCFG_EXTICR4_EXTI13_Msk                 (0x3UL<<SYSCFG_EXTICR4_EXTI13_Pos)                /*!< 0x00000030 */
#define SYSCFG_EXTICR4_EXTI13                     SYSCFG_EXTICR4_EXTI13_Msk
#define SYSCFG_EXTICR4_EXTI13_0                   (0x1UL<<SYSCFG_EXTICR4_EXTI13_Pos)                /*!< 0x00000010 */
#define SYSCFG_EXTICR4_EXTI13_1                   (0x2UL<<SYSCFG_EXTICR4_EXTI13_Pos)                /*!< 0x00000020 */
#define SYSCFG_EXTICR4_EXTI14_Pos                 (8U)
#define SYSCFG_EXTICR4_EXTI14_Msk                 (0x3UL<<SYSCFG_EXTICR4_EXTI14_Pos)                /*!< 0x00000300 */
#define SYSCFG_EXTICR4_EXTI14                     SYSCFG_EXTICR4_EXTI14_Msk
#define SYSCFG_EXTICR4_EXTI14_0                   (0x1UL<<SYSCFG_EXTICR4_EXTI14_Pos)                /*!< 0x00000100 */
#define SYSCFG_EXTICR4_EXTI14_1                   (0x2UL<<SYSCFG_EXTICR4_EXTI14_Pos)                /*!< 0x00000200 */
#define SYSCFG_EXTICR4_EXTI15_Pos                 (12U)
#define SYSCFG_EXTICR4_EXTI15_Msk                 (0x3UL<<SYSCFG_EXTICR4_EXTI15_Pos)                /*!< 0x00003000 */
#define SYSCFG_EXTICR4_EXTI15                     SYSCFG_EXTICR4_EXTI15_Msk
#define SYSCFG_EXTICR4_EXTI15_0                   (0x1UL<<SYSCFG_EXTICR4_EXTI15_Pos)                /*!< 0x00001000 */
#define SYSCFG_EXTICR4_EXTI15_1                   (0x2UL<<SYSCFG_EXTICR4_EXTI15_Pos)                /*!< 0x00002000 */

/********************************* Bit definition for SYSCFG_PAENS register *****************************************/
#define SYSCFG_PAENS_PA_ENS_Pos                   (0U)
#define SYSCFG_PAENS_PA_ENS_Msk                   (0xFFFFUL<<SYSCFG_PAENS_PA_ENS_Pos)               /*!< 0x0000FFFF */
#define SYSCFG_PAENS_PA_ENS                       SYSCFG_PAENS_PA_ENS_Msk

/********************************* Bit definition for SYSCFG_PBENS register *****************************************/
#define SYSCFG_PBENS_PB_ENS_Pos                   (0U)
#define SYSCFG_PBENS_PB_ENS_Msk                   (0xFFFFUL<<SYSCFG_PBENS_PB_ENS_Pos)               /*!< 0x0000FFFF */
#define SYSCFG_PBENS_PB_ENS                       SYSCFG_PBENS_PB_ENS_Msk

