breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for RTC_DIVL register *********************************************/
#define RTC_DIVL_DIV_Pos                          (0U)
#define RTC_DIVL_DIV_Msk                          (0xFFFFUL<<RTC_DIVL_DIV_Pos)                      /*!< 0x0000FFFF */
#define RTC_DIVL_DIV                              RTC_DIVL_DIV_Msk                                  /*!< RTC clock divider low part */

/********************************* Bit definition for RTC_CNTH register *********************************************/
#define RTC_CNTH_CNT_Pos                          (0U)
#define RTC_CNTH_CNT_Msk                          (0xFFFFUL<<RTC_CNTH_CNT_Pos)                      /*!< 0x0000FFFF */
#define RTC_CNTH_CNT                              RTC_CNTH_CNT_Msk                                  /*!< RTC counter high part */

/********************************* Bit definition for RTC_CNTL register *********************************************/
#define RTC_CNTL_CNT_Pos                          (0U)
#define RTC_CNTL_CNT_Msk                          (0xFFFFUL<<RTC_CNTL_CNT_Pos)                      /*!< 0x0000FFFF */
#define RTC_CNTL_CNT                              RTC_CNTL_CNT_Msk                                  /*!< RTC counter high part */

/********************************* Bit definition for RTC_ALRH register *********************************************/
#define RTC_ALRH_ALR_Pos                          (0U)
#define RTC_ALRH_ALR_Msk                          (0xFFFFUL<<RTC_ALRH_ALR_Pos)                      /*!< 0x0000FFFF */
#define RTC_ALRH_ALR                              RTC_ALRH_ALR_Msk                                  /*!< RTC alarm high part */

/********************************* Bit definition for RTC_ALRL register *********************************************/
#define RTC_ALRL_ALR_Pos                          (0U)
#define RTC_ALRL_ALR_Msk                          (0xFFFFUL<<RTC_ALRL_ALR_Pos)                      /*!< 0x0000FFFF */
#define RTC_ALRL_ALR                              RTC_ALRL_ALR_Msk                                  /*!< RTC alarm low part */

/********************************* Bit definition for RTC_TMPCFGR register ******************************************/
#define RTC_TMPCFGR_TPE_Pos                       (0U)
#define RTC_TMPCFGR_TPE_Msk                       (0x1UL<<RTC_TMPCFGR_TPE_Pos)                      /*!< 0x00000001 */
#define RTC_TMPCFGR_TPE                           RTC_TMPCFGR_TPE_Msk                               /*!< TAMP enable */
#define RTC_TMPCFGR_TPAL_Pos                      (1U)
#define RTC_TMPCFGR_TPAL_Msk                      (0x1UL<<RTC_TMPCFGR_TPAL_Pos)                     /*!< 0x00000002 */
#define RTC_TMPCFGR_TPAL                          RTC_TMPCFGR_TPAL_Msk                              /*!< TAMPER pin interrupt enable */

/********************************* Bit definition for RTC_TMPCSR register *******************************************/
#define RTC_TMPCSR_CTE_Pos                        (0U)
#define RTC_TMPCSR_CTE_Msk                        (0x1UL<<RTC_TMPCSR_CTE_Pos)                       /*!< 0x00000001 */
#define RTC_TMPCSR_CTE                            RTC_TMPCSR_CTE_Msk                                /*!< clear TAMP event */
#define RTC_TMPCSR_CTI_Pos                        (1U)
#define RTC_TMPCSR_CTI_Msk                        (0x1UL<<RTC_TMPCSR_CTI_Pos)                       /*!< 0x00000002 */
#define RTC_TMPCSR_CTI                            RTC_TMPCSR_CTI_Msk                                /*!< clear TAMP interrupt */
#define RTC_TMPCSR_TPIE_Pos                       (2U)
#define RTC_TMPCSR_TPIE_Msk                       (0x1UL<<RTC_TMPCSR_TPIE_Pos)                      /*!< 0x00000004 */
#define RTC_TMPCSR_TPIE                           RTC_TMPCSR_TPIE_Msk                               /*!< TAMP interrupt enable */
#define RTC_TMPCSR_TEF_Pos                        (8U)
#define RTC_TMPCSR_TEF_Msk                        (0x1UL<<RTC_TMPCSR_TEF_Pos)                       /*!< 0x00000100 */
#define RTC_TMPCSR_TEF                            RTC_TMPCSR_TEF_Msk                                /*!< TAMP event flag */
#define RTC_TMPCSR_TIF_Pos                        (9U)
#define RTC_TMPCSR_TIF_Msk                        (0x1UL<<RTC_TMPCSR_TIF_Pos)                       /*!< 0x00000200 */
#define RTC_TMPCSR_TIF                            RTC_TMPCSR_TIF_Msk                                /*!< TAMP interrupt flag */

/********************************* Bit definition for RTC_CALIBR register *******************************************/
#define RTC_CALIBR_CAL_Pos                        (0U)
#define RTC_CALIBR_CAL_Msk                        (0x7FUL<<RTC_CALIBR_CAL_Pos)                      /*!< 0x0000007F */
#define RTC_CALIBR_CAL                            RTC_CALIBR_CAL_Msk                                /*!< RTC calibration value */
#define RTC_CALIBR_CCO_Pos                        (7U)
#define RTC_CALIBR_CCO_Msk                        (0x1UL<<RTC_CALIBR_CCO_Pos)                       /*!< 0x00000080 */
#define RTC_CALIBR_CCO                            RTC_CALIBR_CCO_Msk                                /*!< Calibration clock output */
#define RTC_CALIBR_ASOE_Pos                       (8U)
#define RTC_CALIBR_ASOE_Msk                       (0x1UL<<RTC_CALIBR_ASOE_Pos)                      /*!< 0x00000100 */
#define RTC_CALIBR_ASOE                           RTC_CALIBR_ASOE_Msk                               /*!< Alarm or second output enable */
#define RTC_CALIBR_ASOS_Pos                       (9U)
#define RTC_CALIBR_ASOS_Msk                       (0x1UL<<RTC_CALIBR_ASOS_Pos)                      /*!< 0x00000200 */
#define RTC_CALIBR_ASOS                           RTC_CALIBR_ASOS_Msk                               /*!< Alarm or second output selection */

/********************************* Bit definition for RTC_BKPDR0 register *******************************************/
#define RTC_BKPDR0_D_Pos                          (0U)
#define RTC_BKPDR0_D_Msk                          (0xFFFFFFFFUL<<RTC_BKPDR0_D_Pos)                  /*!< 0xFFFFFFFF */
#define RTC_BKPDR0_D                              RTC_BKPDR0_D_Msk                                  /*!< bakeup data word0 */

/********************************* Bit definition for RTC_BKPDR1 register *******************************************/
#define RTC_BKPDR1_D_Pos                          (0U)
#define RTC_BKPDR1_D_Msk                          (0xFFFFFFFFUL<<RTC_BKPDR1_D_Pos)                  /*!< 0xFFFFFFFF */
#define RTC_BKPDR1_D                              RTC_BKPDR1_D_Msk                                  /*!< bakeup data word1 */

/********************************* Bit definition for RTC_BKPDR2 register *******************************************/
#define RTC_BKPDR2_D_Pos                          (0U)
#define RTC_BKPDR2_D_Msk                          (0xFFFFFFFFUL<<RTC_BKPDR2_D_Pos)                  /*!< 0xFFFFFFFF */
#define RTC_BKPDR2_D                              RTC_BKPDR2_D_Msk                                  /*!< bakeup data word2 */

/********************************* Bit definition for RTC_BKPDR3 register *******************************************/
#define RTC_BKPDR3_D_Pos                          (0U)
#define RTC_BKPDR3_D_Msk                          (0xFFFFFFFFUL<<RTC_BKPDR3_D_Pos)                  /*!< 0xFFFFFFFF */
#define RTC_BKPDR3_D                              RTC_BKPDR3_D_Msk                                  /*!< bakeup data word3 */

/********************************* Bit definition for RTC_BKPDR4 register *******************************************/
#define RTC_BKPDR4_D_Pos                          (0U)
#define RTC_BKPDR4_D_Msk                          (0xFFFFFFFFUL<<RTC_BKPDR4_D_Pos)                  /*!< 0xFFFFFFFF */
#define RTC_BKPDR4_D                              RTC_BKPDR4_D_Msk                                  /*!< bakeup data word4 */

