breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************************************************************************************************/
/********************************* DMA ******************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for DMA_ISR register **********************************************/
#define DMA_ISR_TCIF1_Pos                         (0U)
#define DMA_ISR_TCIF1_Msk                         (0x1UL<<DMA_ISR_TCIF1_Pos)                        /*!< 0x00000001 */
#define DMA_ISR_TCIF1                             DMA_ISR_TCIF1_Msk                                 
#define DMA_ISR_BTCIF1_Pos                        (1U)
#define DMA_ISR_BTCIF1_Msk                        (0x1UL<<DMA_ISR_BTCIF1_Pos)                       /*!< 0x00000002 */
#define DMA_ISR_BTCIF1                            DMA_ISR_BTCIF1_Msk                                
#define DMA_ISR_HBTIF1_Pos                        (2U)
#define DMA_ISR_HBTIF1_Msk                        (0x1UL<<DMA_ISR_HBTIF1_Pos)                       /*!< 0x00000004 */
#define DMA_ISR_HBTIF1                            DMA_ISR_HBTIF1_Msk                                
#define DMA_ISR_TEIF1_Pos                         (3U)
#define DMA_ISR_TEIF1_Msk                         (0x1UL<<DMA_ISR_TEIF1_Pos)                        /*!< 0x00000008 */
#define DMA_ISR_TEIF1                             DMA_ISR_TEIF1_Msk                                 
#define DMA_ISR_TCIF2_Pos                         (4U)
#define DMA_ISR_TCIF2_Msk                         (0x1UL<<DMA_ISR_TCIF2_Pos)                        /*!< 0x00000010 */
#define DMA_ISR_TCIF2                             DMA_ISR_TCIF2_Msk                                 
#define DMA_ISR_BTCIF2_Pos                        (5U)
#define DMA_ISR_BTCIF2_Msk                        (0x1UL<<DMA_ISR_BTCIF2_Pos)                       /*!< 0x00000020 */
#define DMA_ISR_BTCIF2                            DMA_ISR_BTCIF2_Msk                                
#define DMA_ISR_HBTIF2_Pos                        (6U)
#define DMA_ISR_HBTIF2_Msk                        (0x1UL<<DMA_ISR_HBTIF2_Pos)                       /*!< 0x00000040 */
#define DMA_ISR_HBTIF2                            DMA_ISR_HBTIF2_Msk                                
#define DMA_ISR_TEIF2_Pos                         (7U)
#define DMA_ISR_TEIF2_Msk                         (0x1UL<<DMA_ISR_TEIF2_Pos)                        /*!< 0x00000080 */
#define DMA_ISR_TEIF2                             DMA_ISR_TEIF2_Msk                                 
#define DMA_ISR_TCIF3_Pos                         (8U)
#define DMA_ISR_TCIF3_Msk                         (0x1UL<<DMA_ISR_TCIF3_Pos)                        /*!< 0x00000100 */
#define DMA_ISR_TCIF3                             DMA_ISR_TCIF3_Msk                                 
#define DMA_ISR_BTCIF3_Pos                        (9U)
#define DMA_ISR_BTCIF3_Msk                        (0x1UL<<DMA_ISR_BTCIF3_Pos)                       /*!< 0x00000200 */
#define DMA_ISR_BTCIF3                            DMA_ISR_BTCIF3_Msk                                
#define DMA_ISR_HBTIF3_Pos                        (10U)
#define DMA_ISR_HBTIF3_Msk                        (0x1UL<<DMA_ISR_HBTIF3_Pos)                       /*!< 0x00000400 */
#define DMA_ISR_HBTIF3                            DMA_ISR_HBTIF3_Msk                                
#define DMA_ISR_TEIF3_Pos                         (11U)
#define DMA_ISR_TEIF3_Msk                         (0x1UL<<DMA_ISR_TEIF3_Pos)                        /*!< 0x00000800 */
#define DMA_ISR_TEIF3                             DMA_ISR_TEIF3_Msk                                 
#define DMA_ISR_TCIF4_Pos                         (12U)
#define DMA_ISR_TCIF4_Msk                         (0x1UL<<DMA_ISR_TCIF4_Pos)                        /*!< 0x00001000 */
#define DMA_ISR_TCIF4                             DMA_ISR_TCIF4_Msk                                 
#define DMA_ISR_BTCIF4_Pos                        (13U)
#define DMA_ISR_BTCIF4_Msk                        (0x1UL<<DMA_ISR_BTCIF4_Pos)                       /*!< 0x00002000 */
#define DMA_ISR_BTCIF4                            DMA_ISR_BTCIF4_Msk                                
#define DMA_ISR_HBTIF4_Pos                        (14U)
#define DMA_ISR_HBTIF4_Msk                        (0x1UL<<DMA_ISR_HBTIF4_Pos)                       /*!< 0x00004000 */
#define DMA_ISR_HBTIF4                            DMA_ISR_HBTIF4_Msk                                
#define DMA_ISR_TEIF4_Pos                         (15U)
#define DMA_ISR_TEIF4_Msk                         (0x1UL<<DMA_ISR_TEIF4_Pos)                        /*!< 0x00008000 */
#define DMA_ISR_TEIF4                             DMA_ISR_TEIF4_Msk                                 
#define DMA_ISR_TCIF5_Pos                         (16U)
#define DMA_ISR_TCIF5_Msk                         (0x1UL<<DMA_ISR_TCIF5_Pos)                        /*!< 0x00010000 */
#define DMA_ISR_TCIF5                             DMA_ISR_TCIF5_Msk                                 
#define DMA_ISR_BTCIF5_Pos                        (17U)
#define DMA_ISR_BTCIF5_Msk                        (0x1UL<<DMA_ISR_BTCIF5_Pos)                       /*!< 0x00020000 */
#define DMA_ISR_BTCIF5                            DMA_ISR_BTCIF5_Msk                                
#define DMA_ISR_HBTIF5_Pos                        (18U)
#define DMA_ISR_HBTIF5_Msk                        (0x1UL<<DMA_ISR_HBTIF5_Pos)                       /*!< 0x00040000 */
#define DMA_ISR_HBTIF5                            DMA_ISR_HBTIF5_Msk                                
#define DMA_ISR_TEIF5_Pos                         (19U)
#define DMA_ISR_TEIF5_Msk                         (0x1UL<<DMA_ISR_TEIF5_Pos)                        /*!< 0x00080000 */
#define DMA_ISR_TEIF5                             DMA_ISR_TEIF5_Msk                                 

/********************************* Bit definition for DMA_IFCR register *********************************************/
#define DMA_IFCR_CTCIF1_Pos                       (0U)
#define DMA_IFCR_CTCIF1_Msk                       (0x1UL<<DMA_IFCR_CTCIF1_Pos)                      /*!< 0x00000001 */
#define DMA_IFCR_CTCIF1                           DMA_IFCR_CTCIF1_Msk                               
#define DMA_IFCR_CBTCIF1_Pos                      (1U)
#define DMA_IFCR_CBTCIF1_Msk                      (0x1UL<<DMA_IFCR_CBTCIF1_Pos)                     /*!< 0x00000002 */
#define DMA_IFCR_CBTCIF1                          DMA_IFCR_CBTCIF1_Msk                              
#define DMA_IFCR_CHBTIF1_Pos                      (2U)
#define DMA_IFCR_CHBTIF1_Msk                      (0x1UL<<DMA_IFCR_CHBTIF1_Pos)                     /*!< 0x00000004 */
#define DMA_IFCR_CHBTIF1                          DMA_IFCR_CHBTIF1_Msk                              
#define DMA_IFCR_CTEIF1_Pos                       (3U)
#define DMA_IFCR_CTEIF1_Msk                       (0x1UL<<DMA_IFCR_CTEIF1_Pos)                      /*!< 0x00000008 */
#define DMA_IFCR_CTEIF1                           DMA_IFCR_CTEIF1_Msk                               
#define DMA_IFCR_CTCIF2_Pos                       (4U)
#define DMA_IFCR_CTCIF2_Msk                       (0x1UL<<DMA_IFCR_CTCIF2_Pos)                      /*!< 0x00000010 */
#define DMA_IFCR_CTCIF2                           DMA_IFCR_CTCIF2_Msk                               
#define DMA_IFCR_CBTCIF2_Pos                      (5U)
#define DMA_IFCR_CBTCIF2_Msk                      (0x1UL<<DMA_IFCR_CBTCIF2_Pos)                     /*!< 0x00000020 */
#define DMA_IFCR_CBTCIF2                          DMA_IFCR_CBTCIF2_Msk                              
#define DMA_IFCR_CHBTIF2_Pos                      (6U)
#define DMA_IFCR_CHBTIF2_Msk                      (0x1UL<<DMA_IFCR_CHBTIF2_Pos)                     /*!< 0x00000040 */
#define DMA_IFCR_CHBTIF2                          DMA_IFCR_CHBTIF2_Msk                              
#define DMA_IFCR_CTEIF2_Pos                       (7U)
#define DMA_IFCR_CTEIF2_Msk                       (0x1UL<<DMA_IFCR_CTEIF2_Pos)                      /*!< 0x00000080 */
#define DMA_IFCR_CTEIF2                           DMA_IFCR_CTEIF2_Msk                               
#define DMA_IFCR_CTCIF3_Pos                       (8U)
#define DMA_IFCR_CTCIF3_Msk                       (0x1UL<<DMA_IFCR_CTCIF3_Pos)                      /*!< 0x00000100 */
#define DMA_IFCR_CTCIF3                           DMA_IFCR_CTCIF3_Msk                               
#define DMA_IFCR_CBTCIF3_Pos                      (9U)
#define DMA_IFCR_CBTCIF3_Msk                      (0x1UL<<DMA_IFCR_CBTCIF3_Pos)                     /*!< 0x00000200 */
#define DMA_IFCR_CBTCIF3                          DMA_IFCR_CBTCIF3_Msk                              
#define DMA_IFCR_CHBTIF3_Pos                      (10U)
#define DMA_IFCR_CHBTIF3_Msk                      (0x1UL<<DMA_IFCR_CHBTIF3_Pos)                     /*!< 0x00000400 */
#define DMA_IFCR_CHBTIF3                          DMA_IFCR_CHBTIF3_Msk                              
#define DMA_IFCR_CTEIF3_Pos                       (11U)
#define DMA_IFCR_CTEIF3_Msk                       (0x1UL<<DMA_IFCR_CTEIF3_Pos)                      /*!< 0x00000800 */
#define DMA_IFCR_CTEIF3                           DMA_IFCR_CTEIF3_Msk                               
#define DMA_IFCR_CTCIF4_Pos                       (12U)
#define DMA_IFCR_CTCIF4_Msk                       (0x1UL<<DMA_IFCR_CTCIF4_Pos)                      /*!< 0x00001000 */
#define DMA_IFCR_CTCIF4                           DMA_IFCR_CTCIF4_Msk                               
#define DMA_IFCR_CBTCIF4_Pos                      (13U)
#define DMA_IFCR_CBTCIF4_Msk                      (0x1UL<<DMA_IFCR_CBTCIF4_Pos)                     /*!< 0x00002000 */
#define DMA_IFCR_CBTCIF4                          DMA_IFCR_CBTCIF4_Msk                              
#define DMA_IFCR_CHBTIF4_Pos                      (14U)
#define DMA_IFCR_CHBTIF4_Msk                      (0x1UL<<DMA_IFCR_CHBTIF4_Pos)                     /*!< 0x00004000 */
#define DMA_IFCR_CHBTIF4                          DMA_IFCR_CHBTIF4_Msk                              
#define DMA_IFCR_CTEIF4_Pos                       (15U)
#define DMA_IFCR_CTEIF4_Msk                       (0x1UL<<DMA_IFCR_CTEIF4_Pos)                      /*!< 0x00008000 */
#define DMA_IFCR_CTEIF4                           DMA_IFCR_CTEIF4_Msk                               
#define DMA_IFCR_CTCIF5_Pos                       (16U)
#define DMA_IFCR_CTCIF5_Msk                       (0x1UL<<DMA_IFCR_CTCIF5_Pos)                      /*!< 0x00010000 */
#define DMA_IFCR_CTCIF5                           DMA_IFCR_CTCIF5_Msk                               
#define DMA_IFCR_CBTCIF5_Pos                      (17U)
#define DMA_IFCR_CBTCIF5_Msk                      (0x1UL<<DMA_IFCR_CBTCIF5_Pos)                     /*!< 0x00020000 */
#define DMA_IFCR_CBTCIF5                          DMA_IFCR_CBTCIF5_Msk                              
#define DMA_IFCR_CHBTIF5_Pos                      (18U)
#define DMA_IFCR_CHBTIF5_Msk                      (0x1UL<<DMA_IFCR_CHBTIF5_Pos)                     /*!< 0x00040000 */
#define DMA_IFCR_CHBTIF5                          DMA_IFCR_CHBTIF5_Msk                              
#define DMA_IFCR_CTEIF5_Pos                       (19U)
#define DMA_IFCR_CTEIF5_Msk                       (0x1UL<<DMA_IFCR_CTEIF5_Pos)                      /*!< 0x00080000 */
#define DMA_IFCR_CTEIF5                           DMA_IFCR_CTEIF5_Msk                               

/********************************* Bit definition for DMA_CCR1 register *********************************************/
#define DMA_CCR1_EN_Pos                           (0U)
#define DMA_CCR1_EN_Msk                           (0x1UL<<DMA_CCR1_EN_Pos)                          /*!< 0x00000001 */
#define DMA_CCR1_EN                               DMA_CCR1_EN_Msk                                   
#define DMA_CCR1_TCIE_Pos                         (1U)
#define DMA_CCR1_TCIE_Msk                         (0x1UL<<DMA_CCR1_TCIE_Pos)                        /*!< 0x00000002 */
#define DMA_CCR1_TCIE                             DMA_CCR1_TCIE_Msk                                 
#define DMA_CCR1_BTCIE_Pos                        (2U)
#define DMA_CCR1_BTCIE_Msk                        (0x1UL<<DMA_CCR1_BTCIE_Pos)                       /*!< 0x00000004 */
#define DMA_CCR1_BTCIE                            DMA_CCR1_BTCIE_Msk                                
#define DMA_CCR1_HBTIE_Pos                        (3U)
#define DMA_CCR1_HBTIE_Msk                        (0x1UL<<DMA_CCR1_HBTIE_Pos)                       /*!< 0x00000008 */
#define DMA_CCR1_HBTIE                            DMA_CCR1_HBTIE_Msk                                
#define DMA_CCR1_TEIE_Pos                         (4U)
#define DMA_CCR1_TEIE_Msk                         (0x1UL<<DMA_CCR1_TEIE_Pos)                        /*!< 0x00000010 */
#define DMA_CCR1_TEIE                             DMA_CCR1_TEIE_Msk                                 
#define DMA_CCR1_DIR_Pos                          (5U)
#define DMA_CCR1_DIR_Msk                          (0x1UL<<DMA_CCR1_DIR_Pos)                         /*!< 0x00000020 */
#define DMA_CCR1_DIR                              DMA_CCR1_DIR_Msk                                  
#define DMA_CCR1_CIRC_Pos                         (6U)
#define DMA_CCR1_CIRC_Msk                         (0x1UL<<DMA_CCR1_CIRC_Pos)                        /*!< 0x00000040 */
#define DMA_CCR1_CIRC                             DMA_CCR1_CIRC_Msk                                 
#define DMA_CCR1_TRANST_Pos                       (7U)
#define DMA_CCR1_TRANST_Msk                       (0x1UL<<DMA_CCR1_TRANST_Pos)                      /*!< 0x00000080 */
#define DMA_CCR1_TRANST                           DMA_CCR1_TRANST_Msk                               
#define DMA_CCR1_PINC_Pos                         (8U)
#define DMA_CCR1_PINC_Msk                         (0x3UL<<DMA_CCR1_PINC_Pos)                        /*!< 0x00000300 */
#define DMA_CCR1_PINC                             DMA_CCR1_PINC_Msk
#define DMA_CCR1_PINC_0                           (0x1UL<<DMA_CCR1_PINC_Pos)                        /*!< 0x00000100 */
#define DMA_CCR1_PINC_1                           (0x2UL<<DMA_CCR1_PINC_Pos)                        /*!< 0x00000200 */
#define DMA_CCR1_MINC_Pos                         (10U)
#define DMA_CCR1_MINC_Msk                         (0x3UL<<DMA_CCR1_MINC_Pos)                        /*!< 0x00000C00 */
#define DMA_CCR1_MINC                             DMA_CCR1_MINC_Msk
#define DMA_CCR1_MINC_0                           (0x1UL<<DMA_CCR1_MINC_Pos)                        /*!< 0x00000400 */
#define DMA_CCR1_MINC_1                           (0x2UL<<DMA_CCR1_MINC_Pos)                        /*!< 0x00000800 */
#define DMA_CCR1_PSIZE_Pos                        (12U)
#define DMA_CCR1_PSIZE_Msk                        (0x3UL<<DMA_CCR1_PSIZE_Pos)                       /*!< 0x00003000 */
#define DMA_CCR1_PSIZE                            DMA_CCR1_PSIZE_Msk
#define DMA_CCR1_PSIZE_0                          (0x1UL<<DMA_CCR1_PSIZE_Pos)                       /*!< 0x00001000 */
#define DMA_CCR1_PSIZE_1                          (0x2UL<<DMA_CCR1_PSIZE_Pos)                       /*!< 0x00002000 */
#define DMA_CCR1_MSIZE_Pos                        (14U)
#define DMA_CCR1_MSIZE_Msk                        (0x3UL<<DMA_CCR1_MSIZE_Pos)                       /*!< 0x0000C000 */
#define DMA_CCR1_MSIZE                            DMA_CCR1_MSIZE_Msk
#define DMA_CCR1_MSIZE_0                          (0x1UL<<DMA_CCR1_MSIZE_Pos)                       /*!< 0x00004000 */
#define DMA_CCR1_MSIZE_1                          (0x2UL<<DMA_CCR1_MSIZE_Pos)                       /*!< 0x00008000 */
#define DMA_CCR1_PL_Pos                           (16U)
#define DMA_CCR1_PL_Msk                           (0x7UL<<DMA_CCR1_PL_Pos)                          /*!< 0x00070000 */
#define DMA_CCR1_PL                               DMA_CCR1_PL_Msk
#define DMA_CCR1_PL_0                             (0x1UL<<DMA_CCR1_PL_Pos)                          /*!< 0x00010000 */
#define DMA_CCR1_PL_1                             (0x2UL<<DMA_CCR1_PL_Pos)                          /*!< 0x00020000 */
#define DMA_CCR1_PL_2                             (0x4UL<<DMA_CCR1_PL_Pos)                          /*!< 0x00040000 */
#define DMA_CCR1_MEM2MEM_Pos                      (19U)
#define DMA_CCR1_MEM2MEM_Msk                      (0x1UL<<DMA_CCR1_MEM2MEM_Pos)                     /*!< 0x00080000 */
#define DMA_CCR1_MEM2MEM                          DMA_CCR1_MEM2MEM_Msk                              
#define DMA_CCR1_PNORLD_Pos                       (20U)
#define DMA_CCR1_PNORLD_Msk                       (0x1UL<<DMA_CCR1_PNORLD_Pos)                      /*!< 0x00100000 */
#define DMA_CCR1_PNORLD                           DMA_CCR1_PNORLD_Msk                               
#define DMA_CCR1_MNORLD_Pos                       (21U)
#define DMA_CCR1_MNORLD_Msk                       (0x1UL<<DMA_CCR1_MNORLD_Pos)                      /*!< 0x00200000 */
#define DMA_CCR1_MNORLD                           DMA_CCR1_MNORLD_Msk                               
#define DMA_CCR1_BTCSUSP_Pos                      (22U)
#define DMA_CCR1_BTCSUSP_Msk                      (0x1UL<<DMA_CCR1_BTCSUSP_Pos)                     /*!< 0x00400000 */
#define DMA_CCR1_BTCSUSP                          DMA_CCR1_BTCSUSP_Msk                              
#define DMA_CCR1_M2MARB_Pos                       (23U)
#define DMA_CCR1_M2MARB_Msk                       (0x1UL<<DMA_CCR1_M2MARB_Pos)                      /*!< 0x00800000 */
#define DMA_CCR1_M2MARB                           DMA_CCR1_M2MARB_Msk                               

/********************************* Bit definition for DMA_CNDTR1 register *******************************************/
#define DMA_CNDTR1_NDT_Pos                        (0U)
#define DMA_CNDTR1_NDT_Msk                        (0xFFFFUL<<DMA_CNDTR1_NDT_Pos)                    /*!< 0x0000FFFF */
#define DMA_CNDTR1_NDT                            DMA_CNDTR1_NDT_Msk

/********************************* Bit definition for DMA_CPAR1 register ********************************************/
#define DMA_CPAR1_PA_Pos                          (0U)
#define DMA_CPAR1_PA_Msk                          (0xFFFFFFFFUL<<DMA_CPAR1_PA_Pos)                  /*!< 0xFFFFFFFF */
#define DMA_CPAR1_PA                              DMA_CPAR1_PA_Msk

/********************************* Bit definition for DMA_CMAR1 register ********************************************/
#define DMA_CMAR1_MA_Pos                          (0U)
#define DMA_CMAR1_MA_Msk                          (0xFFFFFFFFUL<<DMA_CMAR1_MA_Pos)                  /*!< 0xFFFFFFFF */
#define DMA_CMAR1_MA                              DMA_CMAR1_MA_Msk

/********************************* Bit definition for DMA_CCCFGR1 register ******************************************/
#define DMA_CCCFGR1_NBT_Pos                       (0U)
#define DMA_CCCFGR1_NBT_Msk                       (0xFFUL<<DMA_CCCFGR1_NBT_Pos)                     /*!< 0x000000FF */
#define DMA_CCCFGR1_NBT                           DMA_CCCFGR1_NBT_Msk
#define DMA_CCCFGR1_NDTL_Pos                      (16U)
#define DMA_CCCFGR1_NDTL_Msk                      (0xFFFFUL<<DMA_CCCFGR1_NDTL_Pos)                  /*!< 0xFFFF0000 */
#define DMA_CCCFGR1_NDTL                          DMA_CCCFGR1_NDTL_Msk

