breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for DMA_CCR2 register *********************************************/
#define DMA_CCR2_EN_Pos                           (0U)
#define DMA_CCR2_EN_Msk                           (0x1UL<<DMA_CCR2_EN_Pos)                          /*!< 0x00000001 */
#define DMA_CCR2_EN                               DMA_CCR2_EN_Msk                                   
#define DMA_CCR2_TCIE_Pos                         (1U)
#define DMA_CCR2_TCIE_Msk                         (0x1UL<<DMA_CCR2_TCIE_Pos)                        /*!< 0x00000002 */
#define DMA_CCR2_TCIE                             DMA_CCR2_TCIE_Msk                                 
#define DMA_CCR2_BTCIE_Pos                        (2U)
#define DMA_CCR2_BTCIE_Msk                        (0x1UL<<DMA_CCR2_BTCIE_Pos)                       /*!< 0x00000004 */
#define DMA_CCR2_BTCIE                            DMA_CCR2_BTCIE_Msk                                
#define DMA_CCR2_HBTIE_Pos                        (3U)
#define DMA_CCR2_HBTIE_Msk                        (0x1UL<<DMA_CCR2_HBTIE_Pos)                       /*!< 0x00000008 */
#define DMA_CCR2_HBTIE                            DMA_CCR2_HBTIE_Msk                                
#define DMA_CCR2_TEIE_Pos                         (4U)
#define DMA_CCR2_TEIE_Msk                         (0x1UL<<DMA_CCR2_TEIE_Pos)                        /*!< 0x00000010 */
#define DMA_CCR2_TEIE                             DMA_CCR2_TEIE_Msk                                 
#define DMA_CCR2_DIR_Pos                          (5U)
#define DMA_CCR2_DIR_Msk                          (0x1UL<<DMA_CCR2_DIR_Pos)                         /*!< 0x00000020 */
#define DMA_CCR2_DIR                              DMA_CCR2_DIR_Msk                                  
#define DMA_CCR2_CIRC_Pos                         (6U)
#define DMA_CCR2_CIRC_Msk                         (0x1UL<<DMA_CCR2_CIRC_Pos)                        /*!< 0x00000040 */
#define DMA_CCR2_CIRC                             DMA_CCR2_CIRC_Msk                                 
#define DMA_CCR2_TRANST_Pos                       (7U)
#define DMA_CCR2_TRANST_Msk                       (0x1UL<<DMA_CCR2_TRANST_Pos)                      /*!< 0x00000080 */
#define DMA_CCR2_TRANST                           DMA_CCR2_TRANST_Msk                               
#define DMA_CCR2_PINC_Pos                         (8U)
#define DMA_CCR2_PINC_Msk                         (0x3UL<<DMA_CCR2_PINC_Pos)                        /*!< 0x00000300 */
#define DMA_CCR2_PINC                             DMA_CCR2_PINC_Msk
#define DMA_CCR2_PINC_0                           (0x1UL<<DMA_CCR2_PINC_Pos)                        /*!< 0x00000100 */
#define DMA_CCR2_PINC_1                           (0x2UL<<DMA_CCR2_PINC_Pos)                        /*!< 0x00000200 */
#define DMA_CCR2_MINC_Pos                         (10U)
#define DMA_CCR2_MINC_Msk                         (0x3UL<<DMA_CCR2_MINC_Pos)                        /*!< 0x00000C00 */
#define DMA_CCR2_MINC                             DMA_CCR2_MINC_Msk
#define DMA_CCR2_MINC_0                           (0x1UL<<DMA_CCR2_MINC_Pos)                        /*!< 0x00000400 */
#define DMA_CCR2_MINC_1                           (0x2UL<<DMA_CCR2_MINC_Pos)                        /*!< 0x00000800 */
#define DMA_CCR2_PSIZE_Pos                        (12U)
#define DMA_CCR2_PSIZE_Msk                        (0x3UL<<DMA_CCR2_PSIZE_Pos)                       /*!< 0x00003000 */
#define DMA_CCR2_PSIZE                            DMA_CCR2_PSIZE_Msk
#define DMA_CCR2_PSIZE_0                          (0x1UL<<DMA_CCR2_PSIZE_Pos)                       /*!< 0x00001000 */
#define DMA_CCR2_PSIZE_1                          (0x2UL<<DMA_CCR2_PSIZE_Pos)                       /*!< 0x00002000 */
#define DMA_CCR2_MSIZE_Pos                        (14U)
#define DMA_CCR2_MSIZE_Msk                        (0x3UL<<DMA_CCR2_MSIZE_Pos)                       /*!< 0x0000C000 */
#define DMA_CCR2_MSIZE                            DMA_CCR2_MSIZE_Msk
#define DMA_CCR2_MSIZE_0                          (0x1UL<<DMA_CCR2_MSIZE_Pos)                       /*!< 0x00004000 */
#define DMA_CCR2_MSIZE_1                          (0x2UL<<DMA_CCR2_MSIZE_Pos)                       /*!< 0x00008000 */
#define DMA_CCR2_PL_Pos                           (16U)
#define DMA_CCR2_PL_Msk                           (0x7UL<<DMA_CCR2_PL_Pos)                          /*!< 0x00070000 */
#define DMA_CCR2_PL                               DMA_CCR2_PL_Msk
#define DMA_CCR2_PL_0                             (0x1UL<<DMA_CCR2_PL_Pos)                          /*!< 0x00010000 */
#define DMA_CCR2_PL_1                             (0x2UL<<DMA_CCR2_PL_Pos)                          /*!< 0x00020000 */
#define DMA_CCR2_PL_2                             (0x4UL<<DMA_CCR2_PL_Pos)                          /*!< 0x00040000 */
#define DMA_CCR2_MEM2MEM_Pos                      (19U)
#define DMA_CCR2_MEM2MEM_Msk                      (0x1UL<<DMA_CCR2_MEM2MEM_Pos)                     /*!< 0x00080000 */
#define DMA_CCR2_MEM2MEM                          DMA_CCR2_MEM2MEM_Msk                              
#define DMA_CCR2_PNORLD_Pos                       (20U)
#define DMA_CCR2_PNORLD_Msk                       (0x1UL<<DMA_CCR2_PNORLD_Pos)                      /*!< 0x00100000 */
#define DMA_CCR2_PNORLD                           DMA_CCR2_PNORLD_Msk                               
#define DMA_CCR2_MNORLD_Pos                       (21U)
#define DMA_CCR2_MNORLD_Msk                       (0x1UL<<DMA_CCR2_MNORLD_Pos)                      /*!< 0x00200000 */
#define DMA_CCR2_MNORLD                           DMA_CCR2_MNORLD_Msk                               
#define DMA_CCR2_BTCSUSP_Pos                      (22U)
#define DMA_CCR2_BTCSUSP_Msk                      (0x1UL<<DMA_CCR2_BTCSUSP_Pos)                     /*!< 0x00400000 */
#define DMA_CCR2_BTCSUSP                          DMA_CCR2_BTCSUSP_Msk                              
#define DMA_CCR2_M2MARB_Pos                       (23U)
#define DMA_CCR2_M2MARB_Msk                       (0x1UL<<DMA_CCR2_M2MARB_Pos)                      /*!< 0x00800000 */
#define DMA_CCR2_M2MARB                           DMA_CCR2_M2MARB_Msk                               

/********************************* Bit definition for DMA_CNDTR2 register *******************************************/
#define DMA_CNDTR2_NDT_Pos                        (0U)
#define DMA_CNDTR2_NDT_Msk                        (0xFFFFUL<<DMA_CNDTR2_NDT_Pos)                    /*!< 0x0000FFFF */
#define DMA_CNDTR2_NDT                            DMA_CNDTR2_NDT_Msk

