breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for DMA_CPAR2 register ********************************************/
#define DMA_CPAR2_PA_Pos                          (0U)
#define DMA_CPAR2_PA_Msk                          (0xFFFFFFFFUL<<DMA_CPAR2_PA_Pos)                  /*!< 0xFFFFFFFF */
#define DMA_CPAR2_PA                              DMA_CPAR2_PA_Msk

/********************************* Bit definition for DMA_CMAR2 register ********************************************/
#define DMA_CMAR2_MA_Pos                          (0U)
#define DMA_CMAR2_MA_Msk                          (0xFFFFFFFFUL<<DMA_CMAR2_MA_Pos)                  /*!< 0xFFFFFFFF */
#define DMA_CMAR2_MA                              DMA_CMAR2_MA_Msk

/********************************* Bit definition for DMA_CCCFGR2 register ******************************************/
#define DMA_CCCFGR2_NBT_Pos                       (0U)
#define DMA_CCCFGR2_NBT_Msk                       (0xFFUL<<DMA_CCCFGR2_NBT_Pos)                     /*!< 0x000000FF */
#define DMA_CCCFGR2_NBT                           DMA_CCCFGR2_NBT_Msk
#define DMA_CCCFGR2_NDTL_Pos                      (16U)
#define DMA_CCCFGR2_NDTL_Msk                      (0xFFFFUL<<DMA_CCCFGR2_NDTL_Pos)                  /*!< 0xFFFF0000 */
#define DMA_CCCFGR2_NDTL                          DMA_CCCFGR2_NDTL_Msk

/********************************* Bit definition for DMA_CCR3 register *********************************************/
#define DMA_CCR3_EN_Pos                           (0U)
#define DMA_CCR3_EN_Msk                           (0x1UL<<DMA_CCR3_EN_Pos)                          /*!< 0x00000001 */
#define DMA_CCR3_EN                               DMA_CCR3_EN_Msk                                   
#define DMA_CCR3_TCIE_Pos                         (1U)
#define DMA_CCR3_TCIE_Msk                         (0x1UL<<DMA_CCR3_TCIE_Pos)                        /*!< 0x00000002 */
#define DMA_CCR3_TCIE                             DMA_CCR3_TCIE_Msk                                 
#define DMA_CCR3_BTCIE_Pos                        (2U)
#define DMA_CCR3_BTCIE_Msk                        (0x1UL<<DMA_CCR3_BTCIE_Pos)                       /*!< 0x00000004 */
#define DMA_CCR3_BTCIE                            DMA_CCR3_BTCIE_Msk                                
#define DMA_CCR3_HBTIE_Pos                        (3U)
#define DMA_CCR3_HBTIE_Msk                        (0x1UL<<DMA_CCR3_HBTIE_Pos)                       /*!< 0x00000008 */
#define DMA_CCR3_HBTIE                            DMA_CCR3_HBTIE_Msk                                
#define DMA_CCR3_TEIE_Pos                         (4U)
#define DMA_CCR3_TEIE_Msk                         (0x1UL<<DMA_CCR3_TEIE_Pos)                        /*!< 0x00000010 */
#define DMA_CCR3_TEIE                             DMA_CCR3_TEIE_Msk                                 
#define DMA_CCR3_DIR_Pos                          (5U)
#define DMA_CCR3_DIR_Msk                          (0x1UL<<DMA_CCR3_DIR_Pos)                         /*!< 0x00000020 */
#define DMA_CCR3_DIR                              DMA_CCR3_DIR_Msk                                  
#define DMA_CCR3_CIRC_Pos                         (6U)
#define DMA_CCR3_CIRC_Msk                         (0x1UL<<DMA_CCR3_CIRC_Pos)                        /*!< 0x00000040 */
#define DMA_CCR3_CIRC                             DMA_CCR3_CIRC_Msk                                 
#define DMA_CCR3_TRANST_Pos                       (7U)
#define DMA_CCR3_TRANST_Msk                       (0x1UL<<DMA_CCR3_TRANST_Pos)                      /*!< 0x00000080 */
#define DMA_CCR3_TRANST                           DMA_CCR3_TRANST_Msk                               
#define DMA_CCR3_PINC_Pos                         (8U)
#define DMA_CCR3_PINC_Msk                         (0x3UL<<DMA_CCR3_PINC_Pos)                        /*!< 0x00000300 */
#define DMA_CCR3_PINC                             DMA_CCR3_PINC_Msk
#define DMA_CCR3_PINC_0                           (0x1UL<<DMA_CCR3_PINC_Pos)                        /*!< 0x00000100 */
#define DMA_CCR3_PINC_1                           (0x2UL<<DMA_CCR3_PINC_Pos)                        /*!< 0x00000200 */
#define DMA_CCR3_MINC_Pos                         (10U)
#define DMA_CCR3_MINC_Msk                         (0x3UL<<DMA_CCR3_MINC_Pos)                        /*!< 0x00000C00 */
#define DMA_CCR3_MINC                             DMA_CCR3_MINC_Msk
#define DMA_CCR3_MINC_0                           (0x1UL<<DMA_CCR3_MINC_Pos)                        /*!< 0x00000400 */
#define DMA_CCR3_MINC_1                           (0x2UL<<DMA_CCR3_MINC_Pos)                        /*!< 0x00000800 */
#define DMA_CCR3_PSIZE_Pos                        (12U)
#define DMA_CCR3_PSIZE_Msk                        (0x3UL<<DMA_CCR3_PSIZE_Pos)                       /*!< 0x00003000 */
#define DMA_CCR3_PSIZE                            DMA_CCR3_PSIZE_Msk
#define DMA_CCR3_PSIZE_0                          (0x1UL<<DMA_CCR3_PSIZE_Pos)                       /*!< 0x00001000 */
#define DMA_CCR3_PSIZE_1                          (0x2UL<<DMA_CCR3_PSIZE_Pos)                       /*!< 0x00002000 */
#define DMA_CCR3_MSIZE_Pos                        (14U)
#define DMA_CCR3_MSIZE_Msk                        (0x3UL<<DMA_CCR3_MSIZE_Pos)                       /*!< 0x0000C000 */
#define DMA_CCR3_MSIZE                            DMA_CCR3_MSIZE_Msk
#define DMA_CCR3_MSIZE_0                          (0x1UL<<DMA_CCR3_MSIZE_Pos)                       /*!< 0x00004000 */
#define DMA_CCR3_MSIZE_1                          (0x2UL<<DMA_CCR3_MSIZE_Pos)                       /*!< 0x00008000 */
#define DMA_CCR3_PL_Pos                           (16U)
#define DMA_CCR3_PL_Msk                           (0x7UL<<DMA_CCR3_PL_Pos)                          /*!< 0x00070000 */
#define DMA_CCR3_PL                               DMA_CCR3_PL_Msk
#define DMA_CCR3_PL_0                             (0x1UL<<DMA_CCR3_PL_Pos)                          /*!< 0x00010000 */
#define DMA_CCR3_PL_1                             (0x2UL<<DMA_CCR3_PL_Pos)                          /*!< 0x00020000 */
#define DMA_CCR3_PL_2                             (0x4UL<<DMA_CCR3_PL_Pos)                          /*!< 0x00040000 */
#define DMA_CCR3_MEM2MEM_Pos                      (19U)
#define DMA_CCR3_MEM2MEM_Msk                      (0x1UL<<DMA_CCR3_MEM2MEM_Pos)                     /*!< 0x00080000 */
#define DMA_CCR3_MEM2MEM                          DMA_CCR3_MEM2MEM_Msk                              
#define DMA_CCR3_PNORLD_Pos                       (20U)
#define DMA_CCR3_PNORLD_Msk                       (0x1UL<<DMA_CCR3_PNORLD_Pos)                      /*!< 0x00100000 */
#define DMA_CCR3_PNORLD                           DMA_CCR3_PNORLD_Msk                               
#define DMA_CCR3_MNORLD_Pos                       (21U)
#define DMA_CCR3_MNORLD_Msk                       (0x1UL<<DMA_CCR3_MNORLD_Pos)                      /*!< 0x00200000 */
#define DMA_CCR3_MNORLD                           DMA_CCR3_MNORLD_Msk                               
#define DMA_CCR3_BTCSUSP_Pos                      (22U)
#define DMA_CCR3_BTCSUSP_Msk                      (0x1UL<<DMA_CCR3_BTCSUSP_Pos)                     /*!< 0x00400000 */
#define DMA_CCR3_BTCSUSP                          DMA_CCR3_BTCSUSP_Msk                              
#define DMA_CCR3_M2MARB_Pos                       (23U)
#define DMA_CCR3_M2MARB_Msk                       (0x1UL<<DMA_CCR3_M2MARB_Pos)                      /*!< 0x00800000 */
#define DMA_CCR3_M2MARB                           DMA_CCR3_M2MARB_Msk                               

/********************************* Bit definition for DMA_CNDTR3 register *******************************************/
#define DMA_CNDTR3_NDT_Pos                        (0U)
#define DMA_CNDTR3_NDT_Msk                        (0xFFFFUL<<DMA_CNDTR3_NDT_Pos)                    /*!< 0x0000FFFF */
#define DMA_CNDTR3_NDT                            DMA_CNDTR3_NDT_Msk

/********************************* Bit definition for DMA_CPAR3 register ********************************************/
#define DMA_CPAR3_PA_Pos                          (0U)
#define DMA_CPAR3_PA_Msk                          (0xFFFFFFFFUL<<DMA_CPAR3_PA_Pos)                  /*!< 0xFFFFFFFF */
#define DMA_CPAR3_PA                              DMA_CPAR3_PA_Msk

