breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for DMA_CMAR3 register ********************************************/
#define DMA_CMAR3_MA_Pos                          (0U)
#define DMA_CMAR3_MA_Msk                          (0xFFFFFFFFUL<<DMA_CMAR3_MA_Pos)                  /*!< 0xFFFFFFFF */
#define DMA_CMAR3_MA                              DMA_CMAR3_MA_Msk

/********************************* Bit definition for DMA_CCCFGR3 register ******************************************/
#define DMA_CCCFGR3_NBT_Pos                       (0U)
#define DMA_CCCFGR3_NBT_Msk                       (0xFFUL<<DMA_CCCFGR3_NBT_Pos)                     /*!< 0x000000FF */
#define DMA_CCCFGR3_NBT                           DMA_CCCFGR3_NBT_Msk
#define DMA_CCCFGR3_NDTL_Pos                      (16U)
#define DMA_CCCFGR3_NDTL_Msk                      (0xFFFFUL<<DMA_CCCFGR3_NDTL_Pos)                  /*!< 0xFFFF0000 */
#define DMA_CCCFGR3_NDTL                          DMA_CCCFGR3_NDTL_Msk

/********************************* Bit definition for DMA_CCR4 register *********************************************/
#define DMA_CCR4_EN_Pos                           (0U)
#define DMA_CCR4_EN_Msk                           (0x1UL<<DMA_CCR4_EN_Pos)                          /*!< 0x00000001 */
#define DMA_CCR4_EN                               DMA_CCR4_EN_Msk                                   
#define DMA_CCR4_TCIE_Pos                         (1U)
#define DMA_CCR4_TCIE_Msk                         (0x1UL<<DMA_CCR4_TCIE_Pos)                        /*!< 0x00000002 */
#define DMA_CCR4_TCIE                             DMA_CCR4_TCIE_Msk                                 
#define DMA_CCR4_BTCIE_Pos                        (2U)
#define DMA_CCR4_BTCIE_Msk                        (0x1UL<<DMA_CCR4_BTCIE_Pos)                       /*!< 0x00000004 */
#define DMA_CCR4_BTCIE                            DMA_CCR4_BTCIE_Msk                                
#define DMA_CCR4_HBTIE_Pos                        (3U)
#define DMA_CCR4_HBTIE_Msk                        (0x1UL<<DMA_CCR4_HBTIE_Pos)                       /*!< 0x00000008 */
#define DMA_CCR4_HBTIE                            DMA_CCR4_HBTIE_Msk                                
#define DMA_CCR4_TEIE_Pos                         (4U)
#define DMA_CCR4_TEIE_Msk                         (0x1UL<<DMA_CCR4_TEIE_Pos)                        /*!< 0x00000010 */
#define DMA_CCR4_TEIE                             DMA_CCR4_TEIE_Msk                                 
#define DMA_CCR4_DIR_Pos                          (5U)
#define DMA_CCR4_DIR_Msk                          (0x1UL<<DMA_CCR4_DIR_Pos)                         /*!< 0x00000020 */
#define DMA_CCR4_DIR                              DMA_CCR4_DIR_Msk                                  
#define DMA_CCR4_CIRC_Pos                         (6U)
#define DMA_CCR4_CIRC_Msk                         (0x1UL<<DMA_CCR4_CIRC_Pos)                        /*!< 0x00000040 */
#define DMA_CCR4_CIRC                             DMA_CCR4_CIRC_Msk                                 
#define DMA_CCR4_TRANST_Pos                       (7U)
#define DMA_CCR4_TRANST_Msk                       (0x1UL<<DMA_CCR4_TRANST_Pos)                      /*!< 0x00000080 */
#define DMA_CCR4_TRANST                           DMA_CCR4_TRANST_Msk                               
#define DMA_CCR4_PINC_Pos                         (8U)
#define DMA_CCR4_PINC_Msk                         (0x3UL<<DMA_CCR4_PINC_Pos)                        /*!< 0x00000300 */
#define DMA_CCR4_PINC                             DMA_CCR4_PINC_Msk
#define DMA_CCR4_PINC_0                           (0x1UL<<DMA_CCR4_PINC_Pos)                        /*!< 0x00000100 */
#define DMA_CCR4_PINC_1                           (0x2UL<<DMA_CCR4_PINC_Pos)                        /*!< 0x00000200 */
#define DMA_CCR4_MINC_Pos                         (10U)
#define DMA_CCR4_MINC_Msk                         (0x3UL<<DMA_CCR4_MINC_Pos)                        /*!< 0x00000C00 */
#define DMA_CCR4_MINC                             DMA_CCR4_MINC_Msk
#define DMA_CCR4_MINC_0                           (0x1UL<<DMA_CCR4_MINC_Pos)                        /*!< 0x00000400 */
#define DMA_CCR4_MINC_1                           (0x2UL<<DMA_CCR4_MINC_Pos)                        /*!< 0x00000800 */
#define DMA_CCR4_PSIZE_Pos                        (12U)
#define DMA_CCR4_PSIZE_Msk                        (0x3UL<<DMA_CCR4_PSIZE_Pos)                       /*!< 0x00003000 */
#define DMA_CCR4_PSIZE                            DMA_CCR4_PSIZE_Msk
#define DMA_CCR4_PSIZE_0                          (0x1UL<<DMA_CCR4_PSIZE_Pos)                       /*!< 0x00001000 */
#define DMA_CCR4_PSIZE_1                          (0x2UL<<DMA_CCR4_PSIZE_Pos)                       /*!< 0x00002000 */
#define DMA_CCR4_MSIZE_Pos                        (14U)
#define DMA_CCR4_MSIZE_Msk                        (0x3UL<<DMA_CCR4_MSIZE_Pos)                       /*!< 0x0000C000 */
#define DMA_CCR4_MSIZE                            DMA_CCR4_MSIZE_Msk
#define DMA_CCR4_MSIZE_0                          (0x1UL<<DMA_CCR4_MSIZE_Pos)                       /*!< 0x00004000 */
#define DMA_CCR4_MSIZE_1                          (0x2UL<<DMA_CCR4_MSIZE_Pos)                       /*!< 0x00008000 */
#define DMA_CCR4_PL_Pos                           (16U)
#define DMA_CCR4_PL_Msk                           (0x7UL<<DMA_CCR4_PL_Pos)                          /*!< 0x00070000 */
#define DMA_CCR4_PL                               DMA_CCR4_PL_Msk
#define DMA_CCR4_PL_0                             (0x1UL<<DMA_CCR4_PL_Pos)                          /*!< 0x00010000 */
#define DMA_CCR4_PL_1                             (0x2UL<<DMA_CCR4_PL_Pos)                          /*!< 0x00020000 */
#define DMA_CCR4_PL_2                             (0x4UL<<DMA_CCR4_PL_Pos)                          /*!< 0x00040000 */
#define DMA_CCR4_MEM2MEM_Pos                      (19U)
#define DMA_CCR4_MEM2MEM_Msk                      (0x1UL<<DMA_CCR4_MEM2MEM_Pos)                     /*!< 0x00080000 */
#define DMA_CCR4_MEM2MEM                          DMA_CCR4_MEM2MEM_Msk                              
#define DMA_CCR4_PNORLD_Pos                       (20U)
#define DMA_CCR4_PNORLD_Msk                       (0x1UL<<DMA_CCR4_PNORLD_Pos)                      /*!< 0x00100000 */
#define DMA_CCR4_PNORLD                           DMA_CCR4_PNORLD_Msk                               
#define DMA_CCR4_MNORLD_Pos                       (21U)
#define DMA_CCR4_MNORLD_Msk                       (0x1UL<<DMA_CCR4_MNORLD_Pos)                      /*!< 0x00200000 */
#define DMA_CCR4_MNORLD                           DMA_CCR4_MNORLD_Msk                               
#define DMA_CCR4_BTCSUSP_Pos                      (22U)
#define DMA_CCR4_BTCSUSP_Msk                      (0x1UL<<DMA_CCR4_BTCSUSP_Pos)                     /*!< 0x00400000 */
#define DMA_CCR4_BTCSUSP                          DMA_CCR4_BTCSUSP_Msk                              
#define DMA_CCR4_M2MARB_Pos                       (23U)
#define DMA_CCR4_M2MARB_Msk                       (0x1UL<<DMA_CCR4_M2MARB_Pos)                      /*!< 0x00800000 */
#define DMA_CCR4_M2MARB                           DMA_CCR4_M2MARB_Msk                               

/********************************* Bit definition for DMA_CNDTR4 register *******************************************/
#define DMA_CNDTR4_NDT_Pos                        (0U)
#define DMA_CNDTR4_NDT_Msk                        (0xFFFFUL<<DMA_CNDTR4_NDT_Pos)                    /*!< 0x0000FFFF */
#define DMA_CNDTR4_NDT                            DMA_CNDTR4_NDT_Msk

/********************************* Bit definition for DMA_CPAR4 register ********************************************/
#define DMA_CPAR4_PA_Pos                          (0U)
#define DMA_CPAR4_PA_Msk                          (0xFFFFFFFFUL<<DMA_CPAR4_PA_Pos)                  /*!< 0xFFFFFFFF */
#define DMA_CPAR4_PA                              DMA_CPAR4_PA_Msk

/********************************* Bit definition for DMA_CMAR4 register ********************************************/
#define DMA_CMAR4_MA_Pos                          (0U)
#define DMA_CMAR4_MA_Msk                          (0xFFFFFFFFUL<<DMA_CMAR4_MA_Pos)                  /*!< 0xFFFFFFFF */
#define DMA_CMAR4_MA                              DMA_CMAR4_MA_Msk

/********************************* Bit definition for DMA_CCCFGR4 register ******************************************/
#define DMA_CCCFGR4_NBT_Pos                       (0U)
#define DMA_CCCFGR4_NBT_Msk                       (0xFFUL<<DMA_CCCFGR4_NBT_Pos)                     /*!< 0x000000FF */
#define DMA_CCCFGR4_NBT                           DMA_CCCFGR4_NBT_Msk
#define DMA_CCCFGR4_NDTL_Pos                      (16U)
#define DMA_CCCFGR4_NDTL_Msk                      (0xFFFFUL<<DMA_CCCFGR4_NDTL_Pos)                  /*!< 0xFFFF0000 */
#define DMA_CCCFGR4_NDTL                          DMA_CCCFGR4_NDTL_Msk

/********************************* Bit definition for DMA_CCR5 register *********************************************/
#define DMA_CCR5_EN_Pos                           (0U)
#define DMA_CCR5_EN_Msk                           (0x1UL<<DMA_CCR5_EN_Pos)                          /*!< 0x00000001 */
#define DMA_CCR5_EN                               DMA_CCR5_EN_Msk                                   
#define DMA_CCR5_TCIE_Pos                         (1U)
#define DMA_CCR5_TCIE_Msk                         (0x1UL<<DMA_CCR5_TCIE_Pos)                        /*!< 0x00000002 */
#define DMA_CCR5_TCIE                             DMA_CCR5_TCIE_Msk                                 
#define DMA_CCR5_BTCIE_Pos                        (2U)
#define DMA_CCR5_BTCIE_Msk                        (0x1UL<<DMA_CCR5_BTCIE_Pos)                       /*!< 0x00000004 */
#define DMA_CCR5_BTCIE                            DMA_CCR5_BTCIE_Msk                                
#define DMA_CCR5_HBTIE_Pos                        (3U)
#define DMA_CCR5_HBTIE_Msk                        (0x1UL<<DMA_CCR5_HBTIE_Pos)                       /*!< 0x00000008 */
#define DMA_CCR5_HBTIE                            DMA_CCR5_HBTIE_Msk                                
#define DMA_CCR5_TEIE_Pos                         (4U)
#define DMA_CCR5_TEIE_Msk                         (0x1UL<<DMA_CCR5_TEIE_Pos)                        /*!< 0x00000010 */
#define DMA_CCR5_TEIE                             DMA_CCR5_TEIE_Msk                                 
#define DMA_CCR5_DIR_Pos                          (5U)
#define DMA_CCR5_DIR_Msk                          (0x1UL<<DMA_CCR5_DIR_Pos)                         /*!< 0x00000020 */
#define DMA_CCR5_DIR                              DMA_CCR5_DIR_Msk                                  
#define DMA_CCR5_CIRC_Pos                         (6U)
#define DMA_CCR5_CIRC_Msk                         (0x1UL<<DMA_CCR5_CIRC_Pos)                        /*!< 0x00000040 */
#define DMA_CCR5_CIRC                             DMA_CCR5_CIRC_Msk                                 
#define DMA_CCR5_TRANST_Pos                       (7U)
#define DMA_CCR5_TRANST_Msk                       (0x1UL<<DMA_CCR5_TRANST_Pos)                      /*!< 0x00000080 */
#define DMA_CCR5_TRANST                           DMA_CCR5_TRANST_Msk                               
#define DMA_CCR5_PINC_Pos                         (8U)
#define DMA_CCR5_PINC_Msk                         (0x3UL<<DMA_CCR5_PINC_Pos)                        /*!< 0x00000300 */
#define DMA_CCR5_PINC                             DMA_CCR5_PINC_Msk
#define DMA_CCR5_PINC_0                           (0x1UL<<DMA_CCR5_PINC_Pos)                        /*!< 0x00000100 */
#define DMA_CCR5_PINC_1                           (0x2UL<<DMA_CCR5_PINC_Pos)                        /*!< 0x00000200 */
#define DMA_CCR5_MINC_Pos                         (10U)
#define DMA_CCR5_MINC_Msk                         (0x3UL<<DMA_CCR5_MINC_Pos)                        /*!< 0x00000C00 */
#define DMA_CCR5_MINC                             DMA_CCR5_MINC_Msk
#define DMA_CCR5_MINC_0                           (0x1UL<<DMA_CCR5_MINC_Pos)                        /*!< 0x00000400 */
#define DMA_CCR5_MINC_1                           (0x2UL<<DMA_CCR5_MINC_Pos)                        /*!< 0x00000800 */
#define DMA_CCR5_PSIZE_Pos                        (12U)
#define DMA_CCR5_PSIZE_Msk                        (0x3UL<<DMA_CCR5_PSIZE_Pos)                       /*!< 0x00003000 */
#define DMA_CCR5_PSIZE                            DMA_CCR5_PSIZE_Msk
#define DMA_CCR5_PSIZE_0                          (0x1UL<<DMA_CCR5_PSIZE_Pos)                       /*!< 0x00001000 */
#define DMA_CCR5_PSIZE_1                          (0x2UL<<DMA_CCR5_PSIZE_Pos)                       /*!< 0x00002000 */
#define DMA_CCR5_MSIZE_Pos                        (14U)
#define DMA_CCR5_MSIZE_Msk                        (0x3UL<<DMA_CCR5_MSIZE_Pos)                       /*!< 0x0000C000 */
#define DMA_CCR5_MSIZE                            DMA_CCR5_MSIZE_Msk
#define DMA_CCR5_MSIZE_0                          (0x1UL<<DMA_CCR5_MSIZE_Pos)                       /*!< 0x00004000 */
#define DMA_CCR5_MSIZE_1                          (0x2UL<<DMA_CCR5_MSIZE_Pos)                       /*!< 0x00008000 */
#define DMA_CCR5_PL_Pos                           (16U)
#define DMA_CCR5_PL_Msk                           (0x7UL<<DMA_CCR5_PL_Pos)                          /*!< 0x00070000 */
#define DMA_CCR5_PL                               DMA_CCR5_PL_Msk
#define DMA_CCR5_PL_0                             (0x1UL<<DMA_CCR5_PL_Pos)                          /*!< 0x00010000 */
#define DMA_CCR5_PL_1                             (0x2UL<<DMA_CCR5_PL_Pos)                          /*!< 0x00020000 */
#define DMA_CCR5_PL_2                             (0x4UL<<DMA_CCR5_PL_Pos)                          /*!< 0x00040000 */
#define DMA_CCR5_MEM2MEM_Pos                      (19U)
#define DMA_CCR5_MEM2MEM_Msk                      (0x1UL<<DMA_CCR5_MEM2MEM_Pos)                     /*!< 0x00080000 */
#define DMA_CCR5_MEM2MEM                          DMA_CCR5_MEM2MEM_Msk                              
#define DMA_CCR5_PNORLD_Pos                       (20U)
#define DMA_CCR5_PNORLD_Msk                       (0x1UL<<DMA_CCR5_PNORLD_Pos)                      /*!< 0x00100000 */
#define DMA_CCR5_PNORLD                           DMA_CCR5_PNORLD_Msk                               
#define DMA_CCR5_MNORLD_Pos                       (21U)
#define DMA_CCR5_MNORLD_Msk                       (0x1UL<<DMA_CCR5_MNORLD_Pos)                      /*!< 0x00200000 */
#define DMA_CCR5_MNORLD                           DMA_CCR5_MNORLD_Msk                               
#define DMA_CCR5_BTCSUSP_Pos                      (22U)
#define DMA_CCR5_BTCSUSP_Msk                      (0x1UL<<DMA_CCR5_BTCSUSP_Pos)                     /*!< 0x00400000 */
#define DMA_CCR5_BTCSUSP                          DMA_CCR5_BTCSUSP_Msk                              
#define DMA_CCR5_M2MARB_Pos                       (23U)
#define DMA_CCR5_M2MARB_Msk                       (0x1UL<<DMA_CCR5_M2MARB_Pos)                      /*!< 0x00800000 */
#define DMA_CCR5_M2MARB                           DMA_CCR5_M2MARB_Msk                               

/********************************* Bit definition for DMA_CNDTR5 register *******************************************/
#define DMA_CNDTR5_NDT_Pos                        (0U)
#define DMA_CNDTR5_NDT_Msk                        (0xFFFFUL<<DMA_CNDTR5_NDT_Pos)                    /*!< 0x0000FFFF */
#define DMA_CNDTR5_NDT                            DMA_CNDTR5_NDT_Msk

/********************************* Bit definition for DMA_CPAR5 register ********************************************/
#define DMA_CPAR5_PA_Pos                          (0U)
#define DMA_CPAR5_PA_Msk                          (0xFFFFFFFFUL<<DMA_CPAR5_PA_Pos)                  /*!< 0xFFFFFFFF */
#define DMA_CPAR5_PA                              DMA_CPAR5_PA_Msk

/********************************* Bit definition for DMA_CMAR5 register ********************************************/
#define DMA_CMAR5_MA_Pos                          (0U)
#define DMA_CMAR5_MA_Msk                          (0xFFFFFFFFUL<<DMA_CMAR5_MA_Pos)                  /*!< 0xFFFFFFFF */
#define DMA_CMAR5_MA                              DMA_CMAR5_MA_Msk

/********************************* Bit definition for DMA_CCCFGR5 register ******************************************/
#define DMA_CCCFGR5_NBT_Pos                       (0U)
#define DMA_CCCFGR5_NBT_Msk                       (0xFFUL<<DMA_CCCFGR5_NBT_Pos)                     /*!< 0x000000FF */
#define DMA_CCCFGR5_NBT                           DMA_CCCFGR5_NBT_Msk
#define DMA_CCCFGR5_NDTL_Pos                      (16U)
#define DMA_CCCFGR5_NDTL_Msk                      (0xFFFFUL<<DMA_CCCFGR5_NDTL_Pos)                  /*!< 0xFFFF0000 */
#define DMA_CCCFGR5_NDTL                          DMA_CCCFGR5_NDTL_Msk

