breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for EXTI_EMR register *********************************************/
#define EXTI_EMR_EMR0_Pos                         (0U)
#define EXTI_EMR_EMR0_Msk                         (0x1UL<<EXTI_EMR_EMR0_Pos)                        /*!< 0x00000001 */
#define EXTI_EMR_EMR0                             EXTI_EMR_EMR0_Msk                                 
#define EXTI_EMR_EMR1_Pos                         (1U)
#define EXTI_EMR_EMR1_Msk                         (0x1UL<<EXTI_EMR_EMR1_Pos)                        /*!< 0x00000002 */
#define EXTI_EMR_EMR1                             EXTI_EMR_EMR1_Msk                                 
#define EXTI_EMR_EMR2_Pos                         (2U)
#define EXTI_EMR_EMR2_Msk                         (0x1UL<<EXTI_EMR_EMR2_Pos)                        /*!< 0x00000004 */
#define EXTI_EMR_EMR2                             EXTI_EMR_EMR2_Msk                                 
#define EXTI_EMR_EMR3_Pos                         (3U)
#define EXTI_EMR_EMR3_Msk                         (0x1UL<<EXTI_EMR_EMR3_Pos)                        /*!< 0x00000008 */
#define EXTI_EMR_EMR3                             EXTI_EMR_EMR3_Msk                                 
#define EXTI_EMR_EMR4_Pos                         (4U)
#define EXTI_EMR_EMR4_Msk                         (0x1UL<<EXTI_EMR_EMR4_Pos)                        /*!< 0x00000010 */
#define EXTI_EMR_EMR4                             EXTI_EMR_EMR4_Msk                                 
#define EXTI_EMR_EMR5_Pos                         (5U)
#define EXTI_EMR_EMR5_Msk                         (0x1UL<<EXTI_EMR_EMR5_Pos)                        /*!< 0x00000020 */
#define EXTI_EMR_EMR5                             EXTI_EMR_EMR5_Msk                                 
#define EXTI_EMR_EMR6_Pos                         (6U)
#define EXTI_EMR_EMR6_Msk                         (0x1UL<<EXTI_EMR_EMR6_Pos)                        /*!< 0x00000040 */
#define EXTI_EMR_EMR6                             EXTI_EMR_EMR6_Msk                                 
#define EXTI_EMR_EMR7_Pos                         (7U)
#define EXTI_EMR_EMR7_Msk                         (0x1UL<<EXTI_EMR_EMR7_Pos)                        /*!< 0x00000080 */
#define EXTI_EMR_EMR7                             EXTI_EMR_EMR7_Msk                                 
#define EXTI_EMR_EMR8_Pos                         (8U)
#define EXTI_EMR_EMR8_Msk                         (0x1UL<<EXTI_EMR_EMR8_Pos)                        /*!< 0x00000100 */
#define EXTI_EMR_EMR8                             EXTI_EMR_EMR8_Msk                                 
#define EXTI_EMR_EMR9_Pos                         (9U)
#define EXTI_EMR_EMR9_Msk                         (0x1UL<<EXTI_EMR_EMR9_Pos)                        /*!< 0x00000200 */
#define EXTI_EMR_EMR9                             EXTI_EMR_EMR9_Msk                                 
#define EXTI_EMR_EMR10_Pos                        (10U)
#define EXTI_EMR_EMR10_Msk                        (0x1UL<<EXTI_EMR_EMR10_Pos)                       /*!< 0x00000400 */
#define EXTI_EMR_EMR10                            EXTI_EMR_EMR10_Msk                                
#define EXTI_EMR_EMR11_Pos                        (11U)
#define EXTI_EMR_EMR11_Msk                        (0x1UL<<EXTI_EMR_EMR11_Pos)                       /*!< 0x00000800 */
#define EXTI_EMR_EMR11                            EXTI_EMR_EMR11_Msk                                
#define EXTI_EMR_EMR12_Pos                        (12U)
#define EXTI_EMR_EMR12_Msk                        (0x1UL<<EXTI_EMR_EMR12_Pos)                       /*!< 0x00001000 */
#define EXTI_EMR_EMR12                            EXTI_EMR_EMR12_Msk                                
#define EXTI_EMR_EMR13_Pos                        (13U)
#define EXTI_EMR_EMR13_Msk                        (0x1UL<<EXTI_EMR_EMR13_Pos)                       /*!< 0x00002000 */
#define EXTI_EMR_EMR13                            EXTI_EMR_EMR13_Msk                                
#define EXTI_EMR_EMR14_Pos                        (14U)
#define EXTI_EMR_EMR14_Msk                        (0x1UL<<EXTI_EMR_EMR14_Pos)                       /*!< 0x00004000 */
#define EXTI_EMR_EMR14                            EXTI_EMR_EMR14_Msk                                
#define EXTI_EMR_EMR15_Pos                        (15U)
#define EXTI_EMR_EMR15_Msk                        (0x1UL<<EXTI_EMR_EMR15_Pos)                       /*!< 0x00008000 */
#define EXTI_EMR_EMR15                            EXTI_EMR_EMR15_Msk                                
#define EXTI_EMR_EMR16_Pos                        (16U)
#define EXTI_EMR_EMR16_Msk                        (0x1UL<<EXTI_EMR_EMR16_Pos)                       /*!< 0x00010000 */
#define EXTI_EMR_EMR16                            EXTI_EMR_EMR16_Msk                                
#define EXTI_EMR_EMR17_Pos                        (17U)
#define EXTI_EMR_EMR17_Msk                        (0x1UL<<EXTI_EMR_EMR17_Pos)                       /*!< 0x00020000 */
#define EXTI_EMR_EMR17                            EXTI_EMR_EMR17_Msk                                
#define EXTI_EMR_EMR18_Pos                        (18U)
#define EXTI_EMR_EMR18_Msk                        (0x1UL<<EXTI_EMR_EMR18_Pos)                       /*!< 0x00040000 */
#define EXTI_EMR_EMR18                            EXTI_EMR_EMR18_Msk                                
#define EXTI_EMR_EMR19_Pos                        (19U)
#define EXTI_EMR_EMR19_Msk                        (0x1UL<<EXTI_EMR_EMR19_Pos)                       /*!< 0x00080000 */
#define EXTI_EMR_EMR19                            EXTI_EMR_EMR19_Msk                                
#define EXTI_EMR_EMR20_Pos                        (20U)
#define EXTI_EMR_EMR20_Msk                        (0x1UL<<EXTI_EMR_EMR20_Pos)                       /*!< 0x00100000 */
#define EXTI_EMR_EMR20                            EXTI_EMR_EMR20_Msk                                
#define EXTI_EMR_EMR21_Pos                        (21U)
#define EXTI_EMR_EMR21_Msk                        (0x1UL<<EXTI_EMR_EMR21_Pos)                       /*!< 0x00200000 */
#define EXTI_EMR_EMR21                            EXTI_EMR_EMR21_Msk                                
#define EXTI_EMR_EMR22_Pos                        (22U)
#define EXTI_EMR_EMR22_Msk                        (0x1UL<<EXTI_EMR_EMR22_Pos)                       /*!< 0x00400000 */
#define EXTI_EMR_EMR22                            EXTI_EMR_EMR22_Msk                                
#define EXTI_EMR_EMR23_Pos                        (23U)
#define EXTI_EMR_EMR23_Msk                        (0x1UL<<EXTI_EMR_EMR23_Pos)                       /*!< 0x00800000 */
#define EXTI_EMR_EMR23                            EXTI_EMR_EMR23_Msk                                
#define EXTI_EMR_EMR24_Pos                        (24U)
#define EXTI_EMR_EMR24_Msk                        (0x1UL<<EXTI_EMR_EMR24_Pos)                       /*!< 0x01000000 */
#define EXTI_EMR_EMR24                            EXTI_EMR_EMR24_Msk                                
#define EXTI_EMR_EMR25_Pos                        (25U)
#define EXTI_EMR_EMR25_Msk                        (0x1UL<<EXTI_EMR_EMR25_Pos)                       /*!< 0x02000000 */
#define EXTI_EMR_EMR25                            EXTI_EMR_EMR25_Msk                                

