breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for ADC_ANACR register ********************************************/
#define ADC_ANACR_PWRMODE_Pos                     (1U)
#define ADC_ANACR_PWRMODE_Msk                     (0x7UL<<ADC_ANACR_PWRMODE_Pos)                    /*!< 0x0000000E */
#define ADC_ANACR_PWRMODE                         ADC_ANACR_PWRMODE_Msk
#define ADC_ANACR_PWRMODE_0                       (0x1UL<<ADC_ANACR_PWRMODE_Pos)                    /*!< 0x00000002 */
#define ADC_ANACR_PWRMODE_1                       (0x2UL<<ADC_ANACR_PWRMODE_Pos)                    /*!< 0x00000004 */
#define ADC_ANACR_PWRMODE_2                       (0x4UL<<ADC_ANACR_PWRMODE_Pos)                    /*!< 0x00000008 */
#define ADC_ANACR_VREFSEL_Pos                     (4U)
#define ADC_ANACR_VREFSEL_Msk                     (0x1UL<<ADC_ANACR_VREFSEL_Pos)                    /*!< 0x00000010 */
#define ADC_ANACR_VREFSEL                         ADC_ANACR_VREFSEL_Msk                             

/********************************* Bit definition for ADC_CSR register **********************************************/
#define ADC_CSR_ADRDY_MST_Pos                     (0U)
#define ADC_CSR_ADRDY_MST_Msk                     (0x1UL<<ADC_CSR_ADRDY_MST_Pos)                    /*!< 0x00000001 */
#define ADC_CSR_ADRDY_MST                         ADC_CSR_ADRDY_MST_Msk                             
#define ADC_CSR_EOSMP_MST_Pos                     (1U)
#define ADC_CSR_EOSMP_MST_Msk                     (0x1UL<<ADC_CSR_EOSMP_MST_Pos)                    /*!< 0x00000002 */
#define ADC_CSR_EOSMP_MST                         ADC_CSR_EOSMP_MST_Msk                             
#define ADC_CSR_EOC_MST_Pos                       (2U)
#define ADC_CSR_EOC_MST_Msk                       (0x1UL<<ADC_CSR_EOC_MST_Pos)                      /*!< 0x00000004 */
#define ADC_CSR_EOC_MST                           ADC_CSR_EOC_MST_Msk                               
#define ADC_CSR_EOS_MST_Pos                       (3U)
#define ADC_CSR_EOS_MST_Msk                       (0x1UL<<ADC_CSR_EOS_MST_Pos)                      /*!< 0x00000008 */
#define ADC_CSR_EOS_MST                           ADC_CSR_EOS_MST_Msk                               
#define ADC_CSR_OVR_MST_Pos                       (4U)
#define ADC_CSR_OVR_MST_Msk                       (0x1UL<<ADC_CSR_OVR_MST_Pos)                      /*!< 0x00000010 */
#define ADC_CSR_OVR_MST                           ADC_CSR_OVR_MST_Msk                               
#define ADC_CSR_JEOC_MST_Pos                      (5U)
#define ADC_CSR_JEOC_MST_Msk                      (0x1UL<<ADC_CSR_JEOC_MST_Pos)                     /*!< 0x00000020 */
#define ADC_CSR_JEOC_MST                          ADC_CSR_JEOC_MST_Msk                              
#define ADC_CSR_JEOS_MST_Pos                      (6U)
#define ADC_CSR_JEOS_MST_Msk                      (0x1UL<<ADC_CSR_JEOS_MST_Pos)                     /*!< 0x00000040 */
#define ADC_CSR_JEOS_MST                          ADC_CSR_JEOS_MST_Msk                              
#define ADC_CSR_AWD1_MST_Pos                      (7U)
#define ADC_CSR_AWD1_MST_Msk                      (0x1UL<<ADC_CSR_AWD1_MST_Pos)                     /*!< 0x00000080 */
#define ADC_CSR_AWD1_MST                          ADC_CSR_AWD1_MST_Msk                              
#define ADC_CSR_AWD2_MST_Pos                      (8U)
#define ADC_CSR_AWD2_MST_Msk                      (0x1UL<<ADC_CSR_AWD2_MST_Pos)                     /*!< 0x00000100 */
#define ADC_CSR_AWD2_MST                          ADC_CSR_AWD2_MST_Msk                              
#define ADC_CSR_AWD3_MST_Pos                      (9U)
#define ADC_CSR_AWD3_MST_Msk                      (0x1UL<<ADC_CSR_AWD3_MST_Pos)                     /*!< 0x00000200 */
#define ADC_CSR_AWD3_MST                          ADC_CSR_AWD3_MST_Msk                              
#define ADC_CSR_ADRDY_SLV_Pos                     (16U)
#define ADC_CSR_ADRDY_SLV_Msk                     (0x1UL<<ADC_CSR_ADRDY_SLV_Pos)                    /*!< 0x00010000 */
#define ADC_CSR_ADRDY_SLV                         ADC_CSR_ADRDY_SLV_Msk                             
#define ADC_CSR_EOSMP_SLV_Pos                     (17U)
#define ADC_CSR_EOSMP_SLV_Msk                     (0x1UL<<ADC_CSR_EOSMP_SLV_Pos)                    /*!< 0x00020000 */
#define ADC_CSR_EOSMP_SLV                         ADC_CSR_EOSMP_SLV_Msk                             
#define ADC_CSR_EOC_SLV_Pos                       (18U)
#define ADC_CSR_EOC_SLV_Msk                       (0x1UL<<ADC_CSR_EOC_SLV_Pos)                      /*!< 0x00040000 */
#define ADC_CSR_EOC_SLV                           ADC_CSR_EOC_SLV_Msk                               
#define ADC_CSR_EOS_SLV_Pos                       (19U)
#define ADC_CSR_EOS_SLV_Msk                       (0x1UL<<ADC_CSR_EOS_SLV_Pos)                      /*!< 0x00080000 */
#define ADC_CSR_EOS_SLV                           ADC_CSR_EOS_SLV_Msk                               
#define ADC_CSR_OVR_SLV_Pos                       (20U)
#define ADC_CSR_OVR_SLV_Msk                       (0x1UL<<ADC_CSR_OVR_SLV_Pos)                      /*!< 0x00100000 */
#define ADC_CSR_OVR_SLV                           ADC_CSR_OVR_SLV_Msk                               
#define ADC_CSR_JEOC_SLV_Pos                      (21U)
#define ADC_CSR_JEOC_SLV_Msk                      (0x1UL<<ADC_CSR_JEOC_SLV_Pos)                     /*!< 0x00200000 */
#define ADC_CSR_JEOC_SLV                          ADC_CSR_JEOC_SLV_Msk                              
#define ADC_CSR_JEOS_SLV_Pos                      (22U)
#define ADC_CSR_JEOS_SLV_Msk                      (0x1UL<<ADC_CSR_JEOS_SLV_Pos)                     /*!< 0x00400000 */
#define ADC_CSR_JEOS_SLV                          ADC_CSR_JEOS_SLV_Msk                              
#define ADC_CSR_AWD1_SLV_Pos                      (23U)
#define ADC_CSR_AWD1_SLV_Msk                      (0x1UL<<ADC_CSR_AWD1_SLV_Pos)                     /*!< 0x00800000 */
#define ADC_CSR_AWD1_SLV                          ADC_CSR_AWD1_SLV_Msk                              
#define ADC_CSR_AWD2_SLV_Pos                      (24U)
#define ADC_CSR_AWD2_SLV_Msk                      (0x1UL<<ADC_CSR_AWD2_SLV_Pos)                     /*!< 0x01000000 */
#define ADC_CSR_AWD2_SLV                          ADC_CSR_AWD2_SLV_Msk                              
#define ADC_CSR_AWD3_SLV_Pos                      (25U)
#define ADC_CSR_AWD3_SLV_Msk                      (0x1UL<<ADC_CSR_AWD3_SLV_Pos)                     /*!< 0x02000000 */
#define ADC_CSR_AWD3_SLV                          ADC_CSR_AWD3_SLV_Msk                              

/********************************* Bit definition for ADC_CCR register **********************************************/
#define ADC_CCR_DUAL_Pos                          (0U)
#define ADC_CCR_DUAL_Msk                          (0x1FUL<<ADC_CCR_DUAL_Pos)                        /*!< 0x0000001F */
#define ADC_CCR_DUAL                              ADC_CCR_DUAL_Msk
#define ADC_CCR_DUAL_0                            (0x1UL<<ADC_CCR_DUAL_Pos)                         /*!< 0x00000001 */
#define ADC_CCR_DUAL_1                            (0x2UL<<ADC_CCR_DUAL_Pos)                         /*!< 0x00000002 */
#define ADC_CCR_DUAL_2                            (0x4UL<<ADC_CCR_DUAL_Pos)                         /*!< 0x00000004 */
#define ADC_CCR_DUAL_3                            (0x8UL<<ADC_CCR_DUAL_Pos)                         /*!< 0x00000008 */
#define ADC_CCR_DUAL_4                            (0x10UL<<ADC_CCR_DUAL_Pos)                        /*!< 0x00000010 */
#define ADC_CCR_DELAY_Pos                         (8U)
#define ADC_CCR_DELAY_Msk                         (0xFUL<<ADC_CCR_DELAY_Pos)                        /*!< 0x00000F00 */
#define ADC_CCR_DELAY                             ADC_CCR_DELAY_Msk
#define ADC_CCR_DELAY_0                           (0x1UL<<ADC_CCR_DELAY_Pos)                        /*!< 0x00000100 */
#define ADC_CCR_DELAY_1                           (0x2UL<<ADC_CCR_DELAY_Pos)                        /*!< 0x00000200 */
#define ADC_CCR_DELAY_2                           (0x4UL<<ADC_CCR_DELAY_Pos)                        /*!< 0x00000400 */
#define ADC_CCR_DELAY_3                           (0x8UL<<ADC_CCR_DELAY_Pos)                        /*!< 0x00000800 */
#define ADC_CCR_DMACFG_Pos                        (13U)
#define ADC_CCR_DMACFG_Msk                        (0x1UL<<ADC_CCR_DMACFG_Pos)                       /*!< 0x00002000 */
#define ADC_CCR_DMACFG                            ADC_CCR_DMACFG_Msk                                
#define ADC_CCR_MDMA_Pos                          (14U)
#define ADC_CCR_MDMA_Msk                          (0x3UL<<ADC_CCR_MDMA_Pos)                         /*!< 0x0000C000 */
#define ADC_CCR_MDMA                              ADC_CCR_MDMA_Msk
#define ADC_CCR_MDMA_0                            (0x1UL<<ADC_CCR_MDMA_Pos)                         /*!< 0x00004000 */
#define ADC_CCR_MDMA_1                            (0x2UL<<ADC_CCR_MDMA_Pos)                         /*!< 0x00008000 */
#define ADC_CCR_CKMODE_Pos                        (16U)
#define ADC_CCR_CKMODE_Msk                        (0x3UL<<ADC_CCR_CKMODE_Pos)                       /*!< 0x00030000 */
#define ADC_CCR_CKMODE                            ADC_CCR_CKMODE_Msk
#define ADC_CCR_CKMODE_0                          (0x1UL<<ADC_CCR_CKMODE_Pos)                       /*!< 0x00010000 */
#define ADC_CCR_CKMODE_1                          (0x2UL<<ADC_CCR_CKMODE_Pos)                       /*!< 0x00020000 */
#define ADC_CCR_PRESC_Pos                         (18U)
#define ADC_CCR_PRESC_Msk                         (0xFUL<<ADC_CCR_PRESC_Pos)                        /*!< 0x003C0000 */
#define ADC_CCR_PRESC                             ADC_CCR_PRESC_Msk
#define ADC_CCR_PRESC_0                           (0x1UL<<ADC_CCR_PRESC_Pos)                        /*!< 0x00040000 */
#define ADC_CCR_PRESC_1                           (0x2UL<<ADC_CCR_PRESC_Pos)                        /*!< 0x00080000 */
#define ADC_CCR_PRESC_2                           (0x4UL<<ADC_CCR_PRESC_Pos)                        /*!< 0x00100000 */
#define ADC_CCR_PRESC_3                           (0x8UL<<ADC_CCR_PRESC_Pos)                        /*!< 0x00200000 */
#define ADC_CCR_VREFEN_Pos                        (22U)
#define ADC_CCR_VREFEN_Msk                        (0x1UL<<ADC_CCR_VREFEN_Pos)                       /*!< 0x00400000 */
#define ADC_CCR_VREFEN                            ADC_CCR_VREFEN_Msk                                
#define ADC_CCR_VSENSESEL_Pos                     (23U)
#define ADC_CCR_VSENSESEL_Msk                     (0x1UL<<ADC_CCR_VSENSESEL_Pos)                    /*!< 0x00800000 */
#define ADC_CCR_VSENSESEL                         ADC_CCR_VSENSESEL_Msk                             
#define ADC_CCR_BUFFER_EN_Pos                     (24U)
#define ADC_CCR_BUFFER_EN_Msk                     (0x1UL<<ADC_CCR_BUFFER_EN_Pos)                    /*!< 0x01000000 */
#define ADC_CCR_BUFFER_EN                         ADC_CCR_BUFFER_EN_Msk                             
#define ADC_CCR_BUFFER_SEL_CR_Pos                 (25U)
#define ADC_CCR_BUFFER_SEL_CR_Msk                 (0x1UL<<ADC_CCR_BUFFER_SEL_CR_Pos)                /*!< 0x02000000 */
#define ADC_CCR_BUFFER_SEL_CR                     ADC_CCR_BUFFER_SEL_CR_Msk                         
#define ADC_CCR_BUFFER_CAL_CR_Pos                 (26U)
#define ADC_CCR_BUFFER_CAL_CR_Msk                 (0x1UL<<ADC_CCR_BUFFER_CAL_CR_Pos)                /*!< 0x04000000 */
#define ADC_CCR_BUFFER_CAL_CR                     ADC_CCR_BUFFER_CAL_CR_Msk                         

/********************************* Bit definition for ADC_CDR register **********************************************/
#define ADC_CDR_RDATA_MST_Pos                     (0U)
#define ADC_CDR_RDATA_MST_Msk                     (0xFFFFUL<<ADC_CDR_RDATA_MST_Pos)                 /*!< 0x0000FFFF */
#define ADC_CDR_RDATA_MST                         ADC_CDR_RDATA_MST_Msk
#define ADC_CDR_RDATA_SLV_Pos                     (16U)
#define ADC_CDR_RDATA_SLV_Msk                     (0xFFFFUL<<ADC_CDR_RDATA_SLV_Pos)                 /*!< 0xFFFF0000 */
#define ADC_CDR_RDATA_SLV                         ADC_CDR_RDATA_SLV_Msk

