breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for DAC_DHR12R1 register ******************************************/
#define DAC_DHR12R1_DACC1DHR_Pos                  (0U)
#define DAC_DHR12R1_DACC1DHR_Msk                  (0xFFFUL<<DAC_DHR12R1_DACC1DHR_Pos)               /*!< 0x00000FFF */
#define DAC_DHR12R1_DACC1DHR                      DAC_DHR12R1_DACC1DHR_Msk

/********************************* Bit definition for DAC_DHR12L1 register ******************************************/
#define DAC_DHR12L1_DACC1DHR_Pos                  (4U)
#define DAC_DHR12L1_DACC1DHR_Msk                  (0xFFFUL<<DAC_DHR12L1_DACC1DHR_Pos)               /*!< 0x0000FFF0 */
#define DAC_DHR12L1_DACC1DHR                      DAC_DHR12L1_DACC1DHR_Msk

/********************************* Bit definition for DAC_DHR8R1 register *******************************************/
#define DAC_DHR8R1_DACC1DHR_Pos                   (0U)
#define DAC_DHR8R1_DACC1DHR_Msk                   (0xFFUL<<DAC_DHR8R1_DACC1DHR_Pos)                 /*!< 0x000000FF */
#define DAC_DHR8R1_DACC1DHR                       DAC_DHR8R1_DACC1DHR_Msk

/********************************* Bit definition for DAC_DHR12R2 register ******************************************/
#define DAC_DHR12R2_DACC2DHR_Pos                  (0U)
#define DAC_DHR12R2_DACC2DHR_Msk                  (0xFFFUL<<DAC_DHR12R2_DACC2DHR_Pos)               /*!< 0x00000FFF */
#define DAC_DHR12R2_DACC2DHR                      DAC_DHR12R2_DACC2DHR_Msk

/********************************* Bit definition for DAC_DHR12L2 register ******************************************/
#define DAC_DHR12L2_DACC2DHR_Pos                  (4U)
#define DAC_DHR12L2_DACC2DHR_Msk                  (0xFFFUL<<DAC_DHR12L2_DACC2DHR_Pos)               /*!< 0x0000FFF0 */
#define DAC_DHR12L2_DACC2DHR                      DAC_DHR12L2_DACC2DHR_Msk

/********************************* Bit definition for DAC_DHR8R2 register *******************************************/
#define DAC_DHR8R2_DACC2DHR_Pos                   (0U)
#define DAC_DHR8R2_DACC2DHR_Msk                   (0xFFUL<<DAC_DHR8R2_DACC2DHR_Pos)                 /*!< 0x000000FF */
#define DAC_DHR8R2_DACC2DHR                       DAC_DHR8R2_DACC2DHR_Msk

/********************************* Bit definition for DAC_DHR12RD register ******************************************/
#define DAC_DHR12RD_DACC1DHR_Pos                  (0U)
#define DAC_DHR12RD_DACC1DHR_Msk                  (0xFFFUL<<DAC_DHR12RD_DACC1DHR_Pos)               /*!< 0x00000FFF */
#define DAC_DHR12RD_DACC1DHR                      DAC_DHR12RD_DACC1DHR_Msk
#define DAC_DHR12RD_DACC2DHR_Pos                  (16U)
#define DAC_DHR12RD_DACC2DHR_Msk                  (0xFFFUL<<DAC_DHR12RD_DACC2DHR_Pos)               /*!< 0x0FFF0000 */
#define DAC_DHR12RD_DACC2DHR                      DAC_DHR12RD_DACC2DHR_Msk

/********************************* Bit definition for DAC_DHR12LD register ******************************************/
#define DAC_DHR12LD_DACC1DHR_Pos                  (4U)
#define DAC_DHR12LD_DACC1DHR_Msk                  (0xFFFUL<<DAC_DHR12LD_DACC1DHR_Pos)               /*!< 0x0000FFF0 */
#define DAC_DHR12LD_DACC1DHR                      DAC_DHR12LD_DACC1DHR_Msk
#define DAC_DHR12LD_DACC2DHR_Pos                  (20U)
#define DAC_DHR12LD_DACC2DHR_Msk                  (0xFFFUL<<DAC_DHR12LD_DACC2DHR_Pos)               /*!< 0xFFF00000 */
#define DAC_DHR12LD_DACC2DHR                      DAC_DHR12LD_DACC2DHR_Msk

/********************************* Bit definition for DAC_DHR8RD register *******************************************/
#define DAC_DHR8RD_DACC1DHR_Pos                   (0U)
#define DAC_DHR8RD_DACC1DHR_Msk                   (0xFFUL<<DAC_DHR8RD_DACC1DHR_Pos)                 /*!< 0x000000FF */
#define DAC_DHR8RD_DACC1DHR                       DAC_DHR8RD_DACC1DHR_Msk
#define DAC_DHR8RD_DACC2DHR_Pos                   (8U)
#define DAC_DHR8RD_DACC2DHR_Msk                   (0xFFUL<<DAC_DHR8RD_DACC2DHR_Pos)                 /*!< 0x0000FF00 */
#define DAC_DHR8RD_DACC2DHR                       DAC_DHR8RD_DACC2DHR_Msk

/********************************* Bit definition for DAC_DOR1 register *********************************************/
#define DAC_DOR1_DACC1DOR_Pos                     (0U)
#define DAC_DOR1_DACC1DOR_Msk                     (0xFFFUL<<DAC_DOR1_DACC1DOR_Pos)                  /*!< 0x00000FFF */
#define DAC_DOR1_DACC1DOR                         DAC_DOR1_DACC1DOR_Msk
#define DAC_DOR1_DAC_CMPOUT_Pos                   (12U)
#define DAC_DOR1_DAC_CMPOUT_Msk                   (0x1UL<<DAC_DOR1_DAC_CMPOUT_Pos)                  /*!< 0x00001000 */
#define DAC_DOR1_DAC_CMPOUT                       DAC_DOR1_DAC_CMPOUT_Msk                           

/********************************* Bit definition for DAC_DOR2 register *********************************************/
#define DAC_DOR2_DACC2DOR_Pos                     (0U)
#define DAC_DOR2_DACC2DOR_Msk                     (0xFFFUL<<DAC_DOR2_DACC2DOR_Pos)                  /*!< 0x00000FFF */
#define DAC_DOR2_DACC2DOR                         DAC_DOR2_DACC2DOR_Msk

/********************************* Bit definition for DAC_SR register ***********************************************/
#define DAC_SR_DMAUDR1_Pos                        (13U)
#define DAC_SR_DMAUDR1_Msk                        (0x1UL<<DAC_SR_DMAUDR1_Pos)                       /*!< 0x00002000 */
#define DAC_SR_DMAUDR1                            DAC_SR_DMAUDR1_Msk                                
#define DAC_SR_DMAUDR2_Pos                        (29U)
#define DAC_SR_DMAUDR2_Msk                        (0x1UL<<DAC_SR_DMAUDR2_Pos)                       /*!< 0x20000000 */
#define DAC_SR_DMAUDR2                            DAC_SR_DMAUDR2_Msk                                

/********************************* Bit definition for DAC_OC register ***********************************************/
#define DAC_OC_DAC_EXTEN_Pos                      (0U)
#define DAC_OC_DAC_EXTEN_Msk                      (0x3UL<<DAC_OC_DAC_EXTEN_Pos)                     /*!< 0x00000003 */
#define DAC_OC_DAC_EXTEN                          DAC_OC_DAC_EXTEN_Msk
#define DAC_OC_DAC_EXTEN_0                        (0x1UL<<DAC_OC_DAC_EXTEN_Pos)                     /*!< 0x00000001 */
#define DAC_OC_DAC_EXTEN_1                        (0x2UL<<DAC_OC_DAC_EXTEN_Pos)                     /*!< 0x00000002 */
#define DAC_OC_DAC_EXTSRC_CR_Pos                  (2U)
#define DAC_OC_DAC_EXTSRC_CR_Msk                  (0x1UL<<DAC_OC_DAC_EXTSRC_CR_Pos)                 /*!< 0x00000004 */
#define DAC_OC_DAC_EXTSRC_CR                      DAC_OC_DAC_EXTSRC_CR_Msk                          
#define DAC_OC_DAC_VREFSEL_Pos                    (3U)
#define DAC_OC_DAC_VREFSEL_Msk                    (0x1UL<<DAC_OC_DAC_VREFSEL_Pos)                   /*!< 0x00000008 */
#define DAC_OC_DAC_VREFSEL                        DAC_OC_DAC_VREFSEL_Msk                            
#define DAC_OC_DAC_INTER1_CR_Pos                  (5U)
#define DAC_OC_DAC_INTER1_CR_Msk                  (0x1UL<<DAC_OC_DAC_INTER1_CR_Pos)                 /*!< 0x00000020 */
#define DAC_OC_DAC_INTER1_CR                      DAC_OC_DAC_INTER1_CR_Msk                          
#define DAC_OC_DAC_INTER2_CR_Pos                  (6U)
#define DAC_OC_DAC_INTER2_CR_Msk                  (0x1UL<<DAC_OC_DAC_INTER2_CR_Pos)                 /*!< 0x00000040 */
#define DAC_OC_DAC_INTER2_CR                      DAC_OC_DAC_INTER2_CR_Msk                          
#define DAC_OC_DAC_CALMODE_Pos                    (7U)
#define DAC_OC_DAC_CALMODE_Msk                    (0x3UL<<DAC_OC_DAC_CALMODE_Pos)                   /*!< 0x00000180 */
#define DAC_OC_DAC_CALMODE                        DAC_OC_DAC_CALMODE_Msk
#define DAC_OC_DAC_CALMODE_0                      (0x1UL<<DAC_OC_DAC_CALMODE_Pos)                   /*!< 0x00000080 */
#define DAC_OC_DAC_CALMODE_1                      (0x2UL<<DAC_OC_DAC_CALMODE_Pos)                   /*!< 0x00000100 */
#define DAC_OC_DAC_EXTCH_CR_Pos                   (9U)
#define DAC_OC_DAC_EXTCH_CR_Msk                   (0x3UL<<DAC_OC_DAC_EXTCH_CR_Pos)                  /*!< 0x00000600 */
#define DAC_OC_DAC_EXTCH_CR                       DAC_OC_DAC_EXTCH_CR_Msk
#define DAC_OC_DAC_EXTCH_CR_0                     (0x1UL<<DAC_OC_DAC_EXTCH_CR_Pos)                  /*!< 0x00000200 */
#define DAC_OC_DAC_EXTCH_CR_1                     (0x2UL<<DAC_OC_DAC_EXTCH_CR_Pos)                  /*!< 0x00000400 */
#define DAC_OC_DAC_OS_TRIMCR_Pos                  (24U)
#define DAC_OC_DAC_OS_TRIMCR_Msk                  (0x3FUL<<DAC_OC_DAC_OS_TRIMCR_Pos)                /*!< 0x3F000000 */
#define DAC_OC_DAC_OS_TRIMCR                      DAC_OC_DAC_OS_TRIMCR_Msk
#define DAC_OC_DAC_OS_TRIMCR_0                    (0x1UL<<DAC_OC_DAC_OS_TRIMCR_Pos)                 /*!< 0x01000000 */
#define DAC_OC_DAC_OS_TRIMCR_1                    (0x2UL<<DAC_OC_DAC_OS_TRIMCR_Pos)                 /*!< 0x02000000 */
#define DAC_OC_DAC_OS_TRIMCR_2                    (0x4UL<<DAC_OC_DAC_OS_TRIMCR_Pos)                 /*!< 0x04000000 */
#define DAC_OC_DAC_OS_TRIMCR_3                    (0x8UL<<DAC_OC_DAC_OS_TRIMCR_Pos)                 /*!< 0x08000000 */
#define DAC_OC_DAC_OS_TRIMCR_4                    (0x10UL<<DAC_OC_DAC_OS_TRIMCR_Pos)                /*!< 0x10000000 */
#define DAC_OC_DAC_OS_TRIMCR_5                    (0x20UL<<DAC_OC_DAC_OS_TRIMCR_Pos)                /*!< 0x20000000 */

