breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for DAC_RAMPCFGR1 register ****************************************/
#define DAC_RAMPCFGR1_RAMPREFS1_Pos               (0U)
#define DAC_RAMPCFGR1_RAMPREFS1_Msk               (0xFFFUL<<DAC_RAMPCFGR1_RAMPREFS1_Pos)            /*!< 0x00000FFF */
#define DAC_RAMPCFGR1_RAMPREFS1                   DAC_RAMPCFGR1_RAMPREFS1_Msk
#define DAC_RAMPCFGR1_RAMPHSTEPVALS1_Pos          (16U)
#define DAC_RAMPCFGR1_RAMPHSTEPVALS1_Msk          (0xFFFUL<<DAC_RAMPCFGR1_RAMPHSTEPVALS1_Pos)       /*!< 0x0FFF0000 */
#define DAC_RAMPCFGR1_RAMPHSTEPVALS1              DAC_RAMPCFGR1_RAMPHSTEPVALS1_Msk

/********************************* Bit definition for DAC_RAMPCFGR2 register ****************************************/
#define DAC_RAMPCFGR2_RAMPREFS2_Pos               (0U)
#define DAC_RAMPCFGR2_RAMPREFS2_Msk               (0xFFFUL<<DAC_RAMPCFGR2_RAMPREFS2_Pos)            /*!< 0x00000FFF */
#define DAC_RAMPCFGR2_RAMPREFS2                   DAC_RAMPCFGR2_RAMPREFS2_Msk
#define DAC_RAMPCFGR2_RAMPHSTEPVALS2_Pos          (16U)
#define DAC_RAMPCFGR2_RAMPHSTEPVALS2_Msk          (0xFFFUL<<DAC_RAMPCFGR2_RAMPHSTEPVALS2_Pos)       /*!< 0x0FFF0000 */
#define DAC_RAMPCFGR2_RAMPHSTEPVALS2              DAC_RAMPCFGR2_RAMPHSTEPVALS2_Msk

/********************************* Bit definition for DAC_RAMPDLYS register *****************************************/
#define DAC_RAMPDLYS_RAMPDELAY_EN1_Pos            (0U)
#define DAC_RAMPDLYS_RAMPDELAY_EN1_Msk            (0x1UL<<DAC_RAMPDLYS_RAMPDELAY_EN1_Pos)           /*!< 0x00000001 */
#define DAC_RAMPDLYS_RAMPDELAY_EN1                DAC_RAMPDLYS_RAMPDELAY_EN1_Msk                    
#define DAC_RAMPDLYS_RAMPDELAYDATA1_Pos           (1U)
#define DAC_RAMPDLYS_RAMPDELAYDATA1_Msk           (0xFFFUL<<DAC_RAMPDLYS_RAMPDELAYDATA1_Pos)        /*!< 0x00001FFE */
#define DAC_RAMPDLYS_RAMPDELAYDATA1               DAC_RAMPDLYS_RAMPDELAYDATA1_Msk
#define DAC_RAMPDLYS_RAMPDELAY_EN2_Pos            (16U)
#define DAC_RAMPDLYS_RAMPDELAY_EN2_Msk            (0x1UL<<DAC_RAMPDLYS_RAMPDELAY_EN2_Pos)           /*!< 0x00010000 */
#define DAC_RAMPDLYS_RAMPDELAY_EN2                DAC_RAMPDLYS_RAMPDELAY_EN2_Msk                    
#define DAC_RAMPDLYS_RAMPDELAYDATA2_Pos           (17U)
#define DAC_RAMPDLYS_RAMPDELAYDATA2_Msk           (0xFFFUL<<DAC_RAMPDLYS_RAMPDELAYDATA2_Pos)        /*!< 0x1FFE0000 */
#define DAC_RAMPDLYS_RAMPDELAYDATA2               DAC_RAMPDLYS_RAMPDELAYDATA2_Msk

/********************************* Bit definition for DAC_RAMPCR register *******************************************/
#define DAC_RAMPCR_RAMPLOADSEL1_Pos               (0U)
#define DAC_RAMPCR_RAMPLOADSEL1_Msk               (0x1UL<<DAC_RAMPCR_RAMPLOADSEL1_Pos)              /*!< 0x00000001 */
#define DAC_RAMPCR_RAMPLOADSEL1                   DAC_RAMPCR_RAMPLOADSEL1_Msk                       
#define DAC_RAMPCR_RAMPUPTRIGSEL1_Pos             (1U)
#define DAC_RAMPCR_RAMPUPTRIGSEL1_Msk             (0xFUL<<DAC_RAMPCR_RAMPUPTRIGSEL1_Pos)            /*!< 0x0000001E */
#define DAC_RAMPCR_RAMPUPTRIGSEL1                 DAC_RAMPCR_RAMPUPTRIGSEL1_Msk
#define DAC_RAMPCR_RAMPUPTRIGSEL1_0               (0x1UL<<DAC_RAMPCR_RAMPUPTRIGSEL1_Pos)            /*!< 0x00000002 */
#define DAC_RAMPCR_RAMPUPTRIGSEL1_1               (0x2UL<<DAC_RAMPCR_RAMPUPTRIGSEL1_Pos)            /*!< 0x00000004 */
#define DAC_RAMPCR_RAMPUPTRIGSEL1_2               (0x4UL<<DAC_RAMPCR_RAMPUPTRIGSEL1_Pos)            /*!< 0x00000008 */
#define DAC_RAMPCR_RAMPUPTRIGSEL1_3               (0x8UL<<DAC_RAMPCR_RAMPUPTRIGSEL1_Pos)            /*!< 0x00000010 */
#define DAC_RAMPCR_RAMPSTPTRIGSEL1_Pos            (5U)
#define DAC_RAMPCR_RAMPSTPTRIGSEL1_Msk            (0xFUL<<DAC_RAMPCR_RAMPSTPTRIGSEL1_Pos)           /*!< 0x000001E0 */
#define DAC_RAMPCR_RAMPSTPTRIGSEL1                DAC_RAMPCR_RAMPSTPTRIGSEL1_Msk
#define DAC_RAMPCR_RAMPSTPTRIGSEL1_0              (0x1UL<<DAC_RAMPCR_RAMPSTPTRIGSEL1_Pos)           /*!< 0x00000020 */
#define DAC_RAMPCR_RAMPSTPTRIGSEL1_1              (0x2UL<<DAC_RAMPCR_RAMPSTPTRIGSEL1_Pos)           /*!< 0x00000040 */
#define DAC_RAMPCR_RAMPSTPTRIGSEL1_2              (0x4UL<<DAC_RAMPCR_RAMPSTPTRIGSEL1_Pos)           /*!< 0x00000080 */
#define DAC_RAMPCR_RAMPSTPTRIGSEL1_3              (0x8UL<<DAC_RAMPCR_RAMPSTPTRIGSEL1_Pos)           /*!< 0x00000100 */
#define DAC_RAMPCR_RAMPLOADSEL2_Pos               (16U)
#define DAC_RAMPCR_RAMPLOADSEL2_Msk               (0x1UL<<DAC_RAMPCR_RAMPLOADSEL2_Pos)              /*!< 0x00010000 */
#define DAC_RAMPCR_RAMPLOADSEL2                   DAC_RAMPCR_RAMPLOADSEL2_Msk                       
#define DAC_RAMPCR_RAMPUPTRIGSEL2_Pos             (17U)
#define DAC_RAMPCR_RAMPUPTRIGSEL2_Msk             (0xFUL<<DAC_RAMPCR_RAMPUPTRIGSEL2_Pos)            /*!< 0x001E0000 */
#define DAC_RAMPCR_RAMPUPTRIGSEL2                 DAC_RAMPCR_RAMPUPTRIGSEL2_Msk
#define DAC_RAMPCR_RAMPUPTRIGSEL2_0               (0x1UL<<DAC_RAMPCR_RAMPUPTRIGSEL2_Pos)            /*!< 0x00020000 */
#define DAC_RAMPCR_RAMPUPTRIGSEL2_1               (0x2UL<<DAC_RAMPCR_RAMPUPTRIGSEL2_Pos)            /*!< 0x00040000 */
#define DAC_RAMPCR_RAMPUPTRIGSEL2_2               (0x4UL<<DAC_RAMPCR_RAMPUPTRIGSEL2_Pos)            /*!< 0x00080000 */
#define DAC_RAMPCR_RAMPUPTRIGSEL2_3               (0x8UL<<DAC_RAMPCR_RAMPUPTRIGSEL2_Pos)            /*!< 0x00100000 */
#define DAC_RAMPCR_RAMPSTPTRIGSEL2_Pos            (21U)
#define DAC_RAMPCR_RAMPSTPTRIGSEL2_Msk            (0xFUL<<DAC_RAMPCR_RAMPSTPTRIGSEL2_Pos)           /*!< 0x01E00000 */
#define DAC_RAMPCR_RAMPSTPTRIGSEL2                DAC_RAMPCR_RAMPSTPTRIGSEL2_Msk
#define DAC_RAMPCR_RAMPSTPTRIGSEL2_0              (0x1UL<<DAC_RAMPCR_RAMPSTPTRIGSEL2_Pos)           /*!< 0x00200000 */
#define DAC_RAMPCR_RAMPSTPTRIGSEL2_1              (0x2UL<<DAC_RAMPCR_RAMPSTPTRIGSEL2_Pos)           /*!< 0x00400000 */
#define DAC_RAMPCR_RAMPSTPTRIGSEL2_2              (0x4UL<<DAC_RAMPCR_RAMPSTPTRIGSEL2_Pos)           /*!< 0x00800000 */
#define DAC_RAMPCR_RAMPSTPTRIGSEL2_3              (0x8UL<<DAC_RAMPCR_RAMPSTPTRIGSEL2_Pos)           /*!< 0x01000000 */

/********************************* Bit definition for DAC_CLKCR register ********************************************/
#define DAC_CLKCR_DACCLK_SETUP_Pos                (0U)
#define DAC_CLKCR_DACCLK_SETUP_Msk                (0x7UL<<DAC_CLKCR_DACCLK_SETUP_Pos)               /*!< 0x00000007 */
#define DAC_CLKCR_DACCLK_SETUP                    DAC_CLKCR_DACCLK_SETUP_Msk
#define DAC_CLKCR_DACCLK_SETUP_0                  (0x1UL<<DAC_CLKCR_DACCLK_SETUP_Pos)               /*!< 0x00000001 */
#define DAC_CLKCR_DACCLK_SETUP_1                  (0x2UL<<DAC_CLKCR_DACCLK_SETUP_Pos)               /*!< 0x00000002 */
#define DAC_CLKCR_DACCLK_SETUP_2                  (0x4UL<<DAC_CLKCR_DACCLK_SETUP_Pos)               /*!< 0x00000004 */
#define DAC_CLKCR_DACCLK_WIDTH_Pos                (3U)
#define DAC_CLKCR_DACCLK_WIDTH_Msk                (0x7UL<<DAC_CLKCR_DACCLK_WIDTH_Pos)               /*!< 0x00000038 */
#define DAC_CLKCR_DACCLK_WIDTH                    DAC_CLKCR_DACCLK_WIDTH_Msk
#define DAC_CLKCR_DACCLK_WIDTH_0                  (0x1UL<<DAC_CLKCR_DACCLK_WIDTH_Pos)               /*!< 0x00000008 */
#define DAC_CLKCR_DACCLK_WIDTH_1                  (0x2UL<<DAC_CLKCR_DACCLK_WIDTH_Pos)               /*!< 0x00000010 */
#define DAC_CLKCR_DACCLK_WIDTH_2                  (0x4UL<<DAC_CLKCR_DACCLK_WIDTH_Pos)               /*!< 0x00000020 */
#define DAC_CLKCR_DACCLK_HOLD_Pos                 (6U)
#define DAC_CLKCR_DACCLK_HOLD_Msk                 (0x7UL<<DAC_CLKCR_DACCLK_HOLD_Pos)                /*!< 0x000001C0 */
#define DAC_CLKCR_DACCLK_HOLD                     DAC_CLKCR_DACCLK_HOLD_Msk
#define DAC_CLKCR_DACCLK_HOLD_0                   (0x1UL<<DAC_CLKCR_DACCLK_HOLD_Pos)                /*!< 0x00000040 */
#define DAC_CLKCR_DACCLK_HOLD_1                   (0x2UL<<DAC_CLKCR_DACCLK_HOLD_Pos)                /*!< 0x00000080 */
#define DAC_CLKCR_DACCLK_HOLD_2                   (0x4UL<<DAC_CLKCR_DACCLK_HOLD_Pos)                /*!< 0x00000100 */

