breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************************************************************************************************/
/********************************* COMP *****************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for COMP1_CSR register ********************************************/
#define COMP1_CSR_EN_Pos                          (0U)
#define COMP1_CSR_EN_Msk                          (0x1UL<<COMP1_CSR_EN_Pos)                         /*!< 0x00000001 */
#define COMP1_CSR_EN                              COMP1_CSR_EN_Msk                                  
#define COMP1_CSR_INNSEL_Pos                      (3U)
#define COMP1_CSR_INNSEL_Msk                      (0x3UL<<COMP1_CSR_INNSEL_Pos)                     /*!< 0x00000018 */
#define COMP1_CSR_INNSEL                          COMP1_CSR_INNSEL_Msk
#define COMP1_CSR_INNSEL_0                        (0x1UL<<COMP1_CSR_INNSEL_Pos)                     /*!< 0x00000008 */
#define COMP1_CSR_INNSEL_1                        (0x2UL<<COMP1_CSR_INNSEL_Pos)                     /*!< 0x00000010 */
#define COMP1_CSR_INPSEL_Pos                      (8U)
#define COMP1_CSR_INPSEL_Msk                      (0x7UL<<COMP1_CSR_INPSEL_Pos)                     /*!< 0x00000700 */
#define COMP1_CSR_INPSEL                          COMP1_CSR_INPSEL_Msk
#define COMP1_CSR_INPSEL_0                        (0x1UL<<COMP1_CSR_INPSEL_Pos)                     /*!< 0x00000100 */
#define COMP1_CSR_INPSEL_1                        (0x2UL<<COMP1_CSR_INPSEL_Pos)                     /*!< 0x00000200 */
#define COMP1_CSR_INPSEL_2                        (0x4UL<<COMP1_CSR_INPSEL_Pos)                     /*!< 0x00000400 */
#define COMP1_CSR_BLANKSEL_Pos                    (11U)
#define COMP1_CSR_BLANKSEL_Msk                    (0xFUL<<COMP1_CSR_BLANKSEL_Pos)                   /*!< 0x00007800 */
#define COMP1_CSR_BLANKSEL                        COMP1_CSR_BLANKSEL_Msk
#define COMP1_CSR_BLANKSEL_0                      (0x1UL<<COMP1_CSR_BLANKSEL_Pos)                   /*!< 0x00000800 */
#define COMP1_CSR_BLANKSEL_1                      (0x2UL<<COMP1_CSR_BLANKSEL_Pos)                   /*!< 0x00001000 */
#define COMP1_CSR_BLANKSEL_2                      (0x4UL<<COMP1_CSR_BLANKSEL_Pos)                   /*!< 0x00002000 */
#define COMP1_CSR_BLANKSEL_3                      (0x8UL<<COMP1_CSR_BLANKSEL_Pos)                   /*!< 0x00004000 */
#define COMP1_CSR_POLARITY_Pos                    (15U)
#define COMP1_CSR_POLARITY_Msk                    (0x1UL<<COMP1_CSR_POLARITY_Pos)                   /*!< 0x00008000 */
#define COMP1_CSR_POLARITY                        COMP1_CSR_POLARITY_Msk                            
#define COMP1_CSR_HYST_Pos                        (16U)
#define COMP1_CSR_HYST_Msk                        (0x1UL<<COMP1_CSR_HYST_Pos)                       /*!< 0x00010000 */
#define COMP1_CSR_HYST                            COMP1_CSR_HYST_Msk                                
#define COMP1_CSR_PWRMODE_Pos                     (18U)
#define COMP1_CSR_PWRMODE_Msk                     (0x1UL<<COMP1_CSR_PWRMODE_Pos)                    /*!< 0x00040000 */
#define COMP1_CSR_PWRMODE                         COMP1_CSR_PWRMODE_Msk                             
#define COMP1_CSR_WINMODE_Pos                     (19U)
#define COMP1_CSR_WINMODE_Msk                     (0x1UL<<COMP1_CSR_WINMODE_Pos)                    /*!< 0x00080000 */
#define COMP1_CSR_WINMODE                         COMP1_CSR_WINMODE_Msk                             
#define COMP1_CSR_TIM_EXTI_OUT_SEL_Pos            (29U)
#define COMP1_CSR_TIM_EXTI_OUT_SEL_Msk            (0x1UL<<COMP1_CSR_TIM_EXTI_OUT_SEL_Pos)           /*!< 0x20000000 */
#define COMP1_CSR_TIM_EXTI_OUT_SEL                COMP1_CSR_TIM_EXTI_OUT_SEL_Msk                    
#define COMP1_CSR_COMP1_OUT_Pos                   (30U)
#define COMP1_CSR_COMP1_OUT_Msk                   (0x1UL<<COMP1_CSR_COMP1_OUT_Pos)                  /*!< 0x40000000 */
#define COMP1_CSR_COMP1_OUT                       COMP1_CSR_COMP1_OUT_Msk                           
#define COMP1_CSR_LOCK_Pos                        (31U)
#define COMP1_CSR_LOCK_Msk                        (0x1UL<<COMP1_CSR_LOCK_Pos)                       /*!< 0x80000000 */
#define COMP1_CSR_LOCK                            COMP1_CSR_LOCK_Msk                                

/********************************* Bit definition for COMP1_FR register *********************************************/
#define COMP1_FR_FLTEN1_Pos                       (0U)
#define COMP1_FR_FLTEN1_Msk                       (0x1UL<<COMP1_FR_FLTEN1_Pos)                      /*!< 0x00000001 */
#define COMP1_FR_FLTEN1                           COMP1_FR_FLTEN1_Msk                               
#define COMP1_FR_FLTCNT1_Pos                      (16U)
#define COMP1_FR_FLTCNT1_Msk                      (0xFFFFUL<<COMP1_FR_FLTCNT1_Pos)                  /*!< 0xFFFF0000 */
#define COMP1_FR_FLTCNT1                          COMP1_FR_FLTCNT1_Msk

/********************************* Bit definition for COMP2_CSR register ********************************************/
#define COMP2_CSR_EN_Pos                          (0U)
#define COMP2_CSR_EN_Msk                          (0x1UL<<COMP2_CSR_EN_Pos)                         /*!< 0x00000001 */
#define COMP2_CSR_EN                              COMP2_CSR_EN_Msk                                  
#define COMP2_CSR_INNSEL_Pos                      (3U)
#define COMP2_CSR_INNSEL_Msk                      (0x3UL<<COMP2_CSR_INNSEL_Pos)                     /*!< 0x00000018 */
#define COMP2_CSR_INNSEL                          COMP2_CSR_INNSEL_Msk
#define COMP2_CSR_INNSEL_0                        (0x1UL<<COMP2_CSR_INNSEL_Pos)                     /*!< 0x00000008 */
#define COMP2_CSR_INNSEL_1                        (0x2UL<<COMP2_CSR_INNSEL_Pos)                     /*!< 0x00000010 */
#define COMP2_CSR_INPSEL_Pos                      (8U)
#define COMP2_CSR_INPSEL_Msk                      (0x7UL<<COMP2_CSR_INPSEL_Pos)                     /*!< 0x00000700 */
#define COMP2_CSR_INPSEL                          COMP2_CSR_INPSEL_Msk
#define COMP2_CSR_INPSEL_0                        (0x1UL<<COMP2_CSR_INPSEL_Pos)                     /*!< 0x00000100 */
#define COMP2_CSR_INPSEL_1                        (0x2UL<<COMP2_CSR_INPSEL_Pos)                     /*!< 0x00000200 */
#define COMP2_CSR_INPSEL_2                        (0x4UL<<COMP2_CSR_INPSEL_Pos)                     /*!< 0x00000400 */
#define COMP2_CSR_BLANKSEL_Pos                    (11U)
#define COMP2_CSR_BLANKSEL_Msk                    (0xFUL<<COMP2_CSR_BLANKSEL_Pos)                   /*!< 0x00007800 */
#define COMP2_CSR_BLANKSEL                        COMP2_CSR_BLANKSEL_Msk
#define COMP2_CSR_BLANKSEL_0                      (0x1UL<<COMP2_CSR_BLANKSEL_Pos)                   /*!< 0x00000800 */
#define COMP2_CSR_BLANKSEL_1                      (0x2UL<<COMP2_CSR_BLANKSEL_Pos)                   /*!< 0x00001000 */
#define COMP2_CSR_BLANKSEL_2                      (0x4UL<<COMP2_CSR_BLANKSEL_Pos)                   /*!< 0x00002000 */
#define COMP2_CSR_BLANKSEL_3                      (0x8UL<<COMP2_CSR_BLANKSEL_Pos)                   /*!< 0x00004000 */
#define COMP2_CSR_POLARITY_Pos                    (15U)
#define COMP2_CSR_POLARITY_Msk                    (0x1UL<<COMP2_CSR_POLARITY_Pos)                   /*!< 0x00008000 */
#define COMP2_CSR_POLARITY                        COMP2_CSR_POLARITY_Msk                            
#define COMP2_CSR_HYST_Pos                        (16U)
#define COMP2_CSR_HYST_Msk                        (0x1UL<<COMP2_CSR_HYST_Pos)                       /*!< 0x00010000 */
#define COMP2_CSR_HYST                            COMP2_CSR_HYST_Msk                                
#define COMP2_CSR_PWRMODE_Pos                     (18U)
#define COMP2_CSR_PWRMODE_Msk                     (0x1UL<<COMP2_CSR_PWRMODE_Pos)                    /*!< 0x00040000 */
#define COMP2_CSR_PWRMODE                         COMP2_CSR_PWRMODE_Msk                             
#define COMP2_CSR_TIM_EXTI_OUT_SEL_Pos            (29U)
#define COMP2_CSR_TIM_EXTI_OUT_SEL_Msk            (0x1UL<<COMP2_CSR_TIM_EXTI_OUT_SEL_Pos)           /*!< 0x20000000 */
#define COMP2_CSR_TIM_EXTI_OUT_SEL                COMP2_CSR_TIM_EXTI_OUT_SEL_Msk                    
#define COMP2_CSR_COMP2_OUT_Pos                   (30U)
#define COMP2_CSR_COMP2_OUT_Msk                   (0x1UL<<COMP2_CSR_COMP2_OUT_Pos)                  /*!< 0x40000000 */
#define COMP2_CSR_COMP2_OUT                       COMP2_CSR_COMP2_OUT_Msk                           
#define COMP2_CSR_LOCK_Pos                        (31U)
#define COMP2_CSR_LOCK_Msk                        (0x1UL<<COMP2_CSR_LOCK_Pos)                       /*!< 0x80000000 */
#define COMP2_CSR_LOCK                            COMP2_CSR_LOCK_Msk                                

/********************************* Bit definition for COMP2_FR register *********************************************/
#define COMP2_FR_FLTEN2_Pos                       (0U)
#define COMP2_FR_FLTEN2_Msk                       (0x1UL<<COMP2_FR_FLTEN2_Pos)                      /*!< 0x00000001 */
#define COMP2_FR_FLTEN2                           COMP2_FR_FLTEN2_Msk                               
#define COMP2_FR_FLTCNT2_Pos                      (16U)
#define COMP2_FR_FLTCNT2_Msk                      (0xFFFFUL<<COMP2_FR_FLTCNT2_Pos)                  /*!< 0xFFFF0000 */
#define COMP2_FR_FLTCNT2                          COMP2_FR_FLTCNT2_Msk

/********************************* Bit definition for COMP3_CSR register ********************************************/
#define COMP3_CSR_EN_Pos                          (0U)
#define COMP3_CSR_EN_Msk                          (0x1UL<<COMP3_CSR_EN_Pos)                         /*!< 0x00000001 */
#define COMP3_CSR_EN                              COMP3_CSR_EN_Msk                                  
#define COMP3_CSR_INNSEL_Pos                      (3U)
#define COMP3_CSR_INNSEL_Msk                      (0x3UL<<COMP3_CSR_INNSEL_Pos)                     /*!< 0x00000018 */
#define COMP3_CSR_INNSEL                          COMP3_CSR_INNSEL_Msk
#define COMP3_CSR_INNSEL_0                        (0x1UL<<COMP3_CSR_INNSEL_Pos)                     /*!< 0x00000008 */
#define COMP3_CSR_INNSEL_1                        (0x2UL<<COMP3_CSR_INNSEL_Pos)                     /*!< 0x00000010 */
#define COMP3_CSR_INPSEL_Pos                      (8U)
#define COMP3_CSR_INPSEL_Msk                      (0x7UL<<COMP3_CSR_INPSEL_Pos)                     /*!< 0x00000700 */
#define COMP3_CSR_INPSEL                          COMP3_CSR_INPSEL_Msk
#define COMP3_CSR_INPSEL_0                        (0x1UL<<COMP3_CSR_INPSEL_Pos)                     /*!< 0x00000100 */
#define COMP3_CSR_INPSEL_1                        (0x2UL<<COMP3_CSR_INPSEL_Pos)                     /*!< 0x00000200 */
#define COMP3_CSR_INPSEL_2                        (0x4UL<<COMP3_CSR_INPSEL_Pos)                     /*!< 0x00000400 */
#define COMP3_CSR_BLANKSEL_Pos                    (11U)
#define COMP3_CSR_BLANKSEL_Msk                    (0xFUL<<COMP3_CSR_BLANKSEL_Pos)                   /*!< 0x00007800 */
#define COMP3_CSR_BLANKSEL                        COMP3_CSR_BLANKSEL_Msk
#define COMP3_CSR_BLANKSEL_0                      (0x1UL<<COMP3_CSR_BLANKSEL_Pos)                   /*!< 0x00000800 */
#define COMP3_CSR_BLANKSEL_1                      (0x2UL<<COMP3_CSR_BLANKSEL_Pos)                   /*!< 0x00001000 */
#define COMP3_CSR_BLANKSEL_2                      (0x4UL<<COMP3_CSR_BLANKSEL_Pos)                   /*!< 0x00002000 */
#define COMP3_CSR_BLANKSEL_3                      (0x8UL<<COMP3_CSR_BLANKSEL_Pos)                   /*!< 0x00004000 */
#define COMP3_CSR_POLARITY_Pos                    (15U)
#define COMP3_CSR_POLARITY_Msk                    (0x1UL<<COMP3_CSR_POLARITY_Pos)                   /*!< 0x00008000 */
#define COMP3_CSR_POLARITY                        COMP3_CSR_POLARITY_Msk                            
#define COMP3_CSR_HYST_Pos                        (16U)
#define COMP3_CSR_HYST_Msk                        (0x1UL<<COMP3_CSR_HYST_Pos)                       /*!< 0x00010000 */
#define COMP3_CSR_HYST                            COMP3_CSR_HYST_Msk                                
#define COMP3_CSR_PWRMODE_Pos                     (18U)
#define COMP3_CSR_PWRMODE_Msk                     (0x1UL<<COMP3_CSR_PWRMODE_Pos)                    /*!< 0x00040000 */
#define COMP3_CSR_PWRMODE                         COMP3_CSR_PWRMODE_Msk                             
#define COMP3_CSR_WINMODE_Pos                     (19U)
#define COMP3_CSR_WINMODE_Msk                     (0x1UL<<COMP3_CSR_WINMODE_Pos)                    /*!< 0x00080000 */
#define COMP3_CSR_WINMODE                         COMP3_CSR_WINMODE_Msk                             
#define COMP3_CSR_TIM_EXTI_OUT_SEL_Pos            (29U)
#define COMP3_CSR_TIM_EXTI_OUT_SEL_Msk            (0x1UL<<COMP3_CSR_TIM_EXTI_OUT_SEL_Pos)           /*!< 0x20000000 */
#define COMP3_CSR_TIM_EXTI_OUT_SEL                COMP3_CSR_TIM_EXTI_OUT_SEL_Msk                    
#define COMP3_CSR_COMP3_OUT_Pos                   (30U)
#define COMP3_CSR_COMP3_OUT_Msk                   (0x1UL<<COMP3_CSR_COMP3_OUT_Pos)                  /*!< 0x40000000 */
#define COMP3_CSR_COMP3_OUT                       COMP3_CSR_COMP3_OUT_Msk                           
#define COMP3_CSR_LOCK_Pos                        (31U)
#define COMP3_CSR_LOCK_Msk                        (0x1UL<<COMP3_CSR_LOCK_Pos)                       /*!< 0x80000000 */
#define COMP3_CSR_LOCK                            COMP3_CSR_LOCK_Msk                                

/********************************* Bit definition for COMP3_FR register *********************************************/
#define COMP3_FR_FLTEN3_Pos                       (0U)
#define COMP3_FR_FLTEN3_Msk                       (0x1UL<<COMP3_FR_FLTEN3_Pos)                      /*!< 0x00000001 */
#define COMP3_FR_FLTEN3                           COMP3_FR_FLTEN3_Msk                               
#define COMP3_FR_FLTCNT3_Pos                      (16U)
#define COMP3_FR_FLTCNT3_Msk                      (0xFFFFUL<<COMP3_FR_FLTCNT3_Pos)                  /*!< 0xFFFF0000 */
#define COMP3_FR_FLTCNT3                          COMP3_FR_FLTCNT3_Msk

