breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for COMP4_CSR register ********************************************/
#define COMP4_CSR_EN_Pos                          (0U)
#define COMP4_CSR_EN_Msk                          (0x1UL<<COMP4_CSR_EN_Pos)                         /*!< 0x00000001 */
#define COMP4_CSR_EN                              COMP4_CSR_EN_Msk                                  
#define COMP4_CSR_INNSEL_Pos                      (3U)
#define COMP4_CSR_INNSEL_Msk                      (0x3UL<<COMP4_CSR_INNSEL_Pos)                     /*!< 0x00000018 */
#define COMP4_CSR_INNSEL                          COMP4_CSR_INNSEL_Msk
#define COMP4_CSR_INNSEL_0                        (0x1UL<<COMP4_CSR_INNSEL_Pos)                     /*!< 0x00000008 */
#define COMP4_CSR_INNSEL_1                        (0x2UL<<COMP4_CSR_INNSEL_Pos)                     /*!< 0x00000010 */
#define COMP4_CSR_INPSEL_Pos                      (8U)
#define COMP4_CSR_INPSEL_Msk                      (0x7UL<<COMP4_CSR_INPSEL_Pos)                     /*!< 0x00000700 */
#define COMP4_CSR_INPSEL                          COMP4_CSR_INPSEL_Msk
#define COMP4_CSR_INPSEL_0                        (0x1UL<<COMP4_CSR_INPSEL_Pos)                     /*!< 0x00000100 */
#define COMP4_CSR_INPSEL_1                        (0x2UL<<COMP4_CSR_INPSEL_Pos)                     /*!< 0x00000200 */
#define COMP4_CSR_INPSEL_2                        (0x4UL<<COMP4_CSR_INPSEL_Pos)                     /*!< 0x00000400 */
#define COMP4_CSR_BLANKSEL_Pos                    (11U)
#define COMP4_CSR_BLANKSEL_Msk                    (0xFUL<<COMP4_CSR_BLANKSEL_Pos)                   /*!< 0x00007800 */
#define COMP4_CSR_BLANKSEL                        COMP4_CSR_BLANKSEL_Msk
#define COMP4_CSR_BLANKSEL_0                      (0x1UL<<COMP4_CSR_BLANKSEL_Pos)                   /*!< 0x00000800 */
#define COMP4_CSR_BLANKSEL_1                      (0x2UL<<COMP4_CSR_BLANKSEL_Pos)                   /*!< 0x00001000 */
#define COMP4_CSR_BLANKSEL_2                      (0x4UL<<COMP4_CSR_BLANKSEL_Pos)                   /*!< 0x00002000 */
#define COMP4_CSR_BLANKSEL_3                      (0x8UL<<COMP4_CSR_BLANKSEL_Pos)                   /*!< 0x00004000 */
#define COMP4_CSR_POLARITY_Pos                    (15U)
#define COMP4_CSR_POLARITY_Msk                    (0x1UL<<COMP4_CSR_POLARITY_Pos)                   /*!< 0x00008000 */
#define COMP4_CSR_POLARITY                        COMP4_CSR_POLARITY_Msk                            
#define COMP4_CSR_HYST_Pos                        (16U)
#define COMP4_CSR_HYST_Msk                        (0x1UL<<COMP4_CSR_HYST_Pos)                       /*!< 0x00010000 */
#define COMP4_CSR_HYST                            COMP4_CSR_HYST_Msk                                
#define COMP4_CSR_PWRMODE_Pos                     (18U)
#define COMP4_CSR_PWRMODE_Msk                     (0x1UL<<COMP4_CSR_PWRMODE_Pos)                    /*!< 0x00040000 */
#define COMP4_CSR_PWRMODE                         COMP4_CSR_PWRMODE_Msk                             
#define COMP4_CSR_TIM_EXTI_OUT_SEL_Pos            (29U)
#define COMP4_CSR_TIM_EXTI_OUT_SEL_Msk            (0x1UL<<COMP4_CSR_TIM_EXTI_OUT_SEL_Pos)           /*!< 0x20000000 */
#define COMP4_CSR_TIM_EXTI_OUT_SEL                COMP4_CSR_TIM_EXTI_OUT_SEL_Msk                    
#define COMP4_CSR_COMP4_OUT_Pos                   (30U)
#define COMP4_CSR_COMP4_OUT_Msk                   (0x1UL<<COMP4_CSR_COMP4_OUT_Pos)                  /*!< 0x40000000 */
#define COMP4_CSR_COMP4_OUT                       COMP4_CSR_COMP4_OUT_Msk                           
#define COMP4_CSR_LOCK_Pos                        (31U)
#define COMP4_CSR_LOCK_Msk                        (0x1UL<<COMP4_CSR_LOCK_Pos)                       /*!< 0x80000000 */
#define COMP4_CSR_LOCK                            COMP4_CSR_LOCK_Msk                                

/********************************* Bit definition for COMP4_FR register *********************************************/
#define COMP4_FR_FLTEN4_Pos                       (0U)
#define COMP4_FR_FLTEN4_Msk                       (0x1UL<<COMP4_FR_FLTEN4_Pos)                      /*!< 0x00000001 */
#define COMP4_FR_FLTEN4                           COMP4_FR_FLTEN4_Msk                               
#define COMP4_FR_FLTCNT4_Pos                      (16U)
#define COMP4_FR_FLTCNT4_Msk                      (0xFFFFUL<<COMP4_FR_FLTCNT4_Pos)                  /*!< 0xFFFF0000 */
#define COMP4_FR_FLTCNT4                          COMP4_FR_FLTCNT4_Msk

/********************************************************************************************************************/
/********************************* OPA ******************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for OPA1_CSR register *********************************************/
#define OPA1_CSR_OPA1_EN_Pos                      (0U)
#define OPA1_CSR_OPA1_EN_Msk                      (0x1UL<<OPA1_CSR_OPA1_EN_Pos)                     /*!< 0x00000001 */
#define OPA1_CSR_OPA1_EN                          OPA1_CSR_OPA1_EN_Msk                              
#define OPA1_CSR_OPA1_VPSEL_Pos                   (2U)
#define OPA1_CSR_OPA1_VPSEL_Msk                   (0x1UL<<OPA1_CSR_OPA1_VPSEL_Pos)                  /*!< 0x00000004 */
#define OPA1_CSR_OPA1_VPSEL                       OPA1_CSR_OPA1_VPSEL_Msk                           
#define OPA1_CSR_OPA1_VNSEL_Pos                   (5U)
#define OPA1_CSR_OPA1_VNSEL_Msk                   (0x1UL<<OPA1_CSR_OPA1_VNSEL_Pos)                  /*!< 0x00000020 */
#define OPA1_CSR_OPA1_VNSEL                       OPA1_CSR_OPA1_VNSEL_Msk                           
#define OPA1_CSR_OPA1_INTOEN_Pos                  (8U)
#define OPA1_CSR_OPA1_INTOEN_Msk                  (0x1UL<<OPA1_CSR_OPA1_INTOEN_Pos)                 /*!< 0x00000100 */
#define OPA1_CSR_OPA1_INTOEN                      OPA1_CSR_OPA1_INTOEN_Msk                          
#define OPA1_CSR_OPA1_EXTOEN_Pos                  (9U)
#define OPA1_CSR_OPA1_EXTOEN_Msk                  (0x1UL<<OPA1_CSR_OPA1_EXTOEN_Pos)                 /*!< 0x00000200 */
#define OPA1_CSR_OPA1_EXTOEN                      OPA1_CSR_OPA1_EXTOEN_Msk                          
#define OPA1_CSR_OPA1_MODE_Pos                    (14U)
#define OPA1_CSR_OPA1_MODE_Msk                    (0x3UL<<OPA1_CSR_OPA1_MODE_Pos)                   /*!< 0x0000C000 */
#define OPA1_CSR_OPA1_MODE                        OPA1_CSR_OPA1_MODE_Msk
#define OPA1_CSR_OPA1_MODE_0                      (0x1UL<<OPA1_CSR_OPA1_MODE_Pos)                   /*!< 0x00004000 */
#define OPA1_CSR_OPA1_MODE_1                      (0x2UL<<OPA1_CSR_OPA1_MODE_Pos)                   /*!< 0x00008000 */
#define OPA1_CSR_OPA1_PGA_GAIN_Pos                (16U)
#define OPA1_CSR_OPA1_PGA_GAIN_Msk                (0xFUL<<OPA1_CSR_OPA1_PGA_GAIN_Pos)               /*!< 0x000F0000 */
#define OPA1_CSR_OPA1_PGA_GAIN                    OPA1_CSR_OPA1_PGA_GAIN_Msk
#define OPA1_CSR_OPA1_PGA_GAIN_0                  (0x1UL<<OPA1_CSR_OPA1_PGA_GAIN_Pos)               /*!< 0x00010000 */
#define OPA1_CSR_OPA1_PGA_GAIN_1                  (0x2UL<<OPA1_CSR_OPA1_PGA_GAIN_Pos)               /*!< 0x00020000 */
#define OPA1_CSR_OPA1_PGA_GAIN_2                  (0x4UL<<OPA1_CSR_OPA1_PGA_GAIN_Pos)               /*!< 0x00040000 */
#define OPA1_CSR_OPA1_PGA_GAIN_3                  (0x8UL<<OPA1_CSR_OPA1_PGA_GAIN_Pos)               /*!< 0x00080000 */
#define OPA1_CSR_OPA_VBIAS_Pos                    (23U)
#define OPA1_CSR_OPA_VBIAS_Msk                    (0xFUL<<OPA1_CSR_OPA_VBIAS_Pos)                   /*!< 0x07800000 */
#define OPA1_CSR_OPA_VBIAS                        OPA1_CSR_OPA_VBIAS_Msk
#define OPA1_CSR_OPA_VBIAS_0                      (0x1UL<<OPA1_CSR_OPA_VBIAS_Pos)                   /*!< 0x00800000 */
#define OPA1_CSR_OPA_VBIAS_1                      (0x2UL<<OPA1_CSR_OPA_VBIAS_Pos)                   /*!< 0x01000000 */
#define OPA1_CSR_OPA_VBIAS_2                      (0x4UL<<OPA1_CSR_OPA_VBIAS_Pos)                   /*!< 0x02000000 */
#define OPA1_CSR_OPA_VBIAS_3                      (0x8UL<<OPA1_CSR_OPA_VBIAS_Pos)                   /*!< 0x04000000 */
#define OPA1_CSR_OPA_VREF_SEL_Pos                 (27U)
#define OPA1_CSR_OPA_VREF_SEL_Msk                 (0x1UL<<OPA1_CSR_OPA_VREF_SEL_Pos)                /*!< 0x08000000 */
#define OPA1_CSR_OPA_VREF_SEL                     OPA1_CSR_OPA_VREF_SEL_Msk                         
#define OPA1_CSR_OPA1_VBSEL_Pos                   (29U)
#define OPA1_CSR_OPA1_VBSEL_Msk                   (0x1UL<<OPA1_CSR_OPA1_VBSEL_Pos)                  /*!< 0x20000000 */
#define OPA1_CSR_OPA1_VBSEL                       OPA1_CSR_OPA1_VBSEL_Msk                           
#define OPA1_CSR_OPA1_LOCK_Pos                    (31U)
#define OPA1_CSR_OPA1_LOCK_Msk                    (0x1UL<<OPA1_CSR_OPA1_LOCK_Pos)                   /*!< 0x80000000 */
#define OPA1_CSR_OPA1_LOCK                        OPA1_CSR_OPA1_LOCK_Msk                            

/********************************* Bit definition for OPA2_CSR register *********************************************/
#define OPA2_CSR_OPA2_EN_Pos                      (0U)
#define OPA2_CSR_OPA2_EN_Msk                      (0x1UL<<OPA2_CSR_OPA2_EN_Pos)                     /*!< 0x00000001 */
#define OPA2_CSR_OPA2_EN                          OPA2_CSR_OPA2_EN_Msk                              
#define OPA2_CSR_OPA2_VPSEL_Pos                   (2U)
#define OPA2_CSR_OPA2_VPSEL_Msk                   (0x1UL<<OPA2_CSR_OPA2_VPSEL_Pos)                  /*!< 0x00000004 */
#define OPA2_CSR_OPA2_VPSEL                       OPA2_CSR_OPA2_VPSEL_Msk                           
#define OPA2_CSR_OPA2_VNSEL_Pos                   (5U)
#define OPA2_CSR_OPA2_VNSEL_Msk                   (0x3UL<<OPA2_CSR_OPA2_VNSEL_Pos)                  /*!< 0x00000060 */
#define OPA2_CSR_OPA2_VNSEL                       OPA2_CSR_OPA2_VNSEL_Msk
#define OPA2_CSR_OPA2_VNSEL_0                     (0x1UL<<OPA2_CSR_OPA2_VNSEL_Pos)                  /*!< 0x00000020 */
#define OPA2_CSR_OPA2_VNSEL_1                     (0x2UL<<OPA2_CSR_OPA2_VNSEL_Pos)                  /*!< 0x00000040 */
#define OPA2_CSR_OPA2_INTOEN_Pos                  (8U)
#define OPA2_CSR_OPA2_INTOEN_Msk                  (0x1UL<<OPA2_CSR_OPA2_INTOEN_Pos)                 /*!< 0x00000100 */
#define OPA2_CSR_OPA2_INTOEN                      OPA2_CSR_OPA2_INTOEN_Msk                          
#define OPA2_CSR_OPA2_EXTOEN_Pos                  (9U)
#define OPA2_CSR_OPA2_EXTOEN_Msk                  (0x1UL<<OPA2_CSR_OPA2_EXTOEN_Pos)                 /*!< 0x00000200 */
#define OPA2_CSR_OPA2_EXTOEN                      OPA2_CSR_OPA2_EXTOEN_Msk                          
#define OPA2_CSR_OPA2_PGA_GAIN_Pos                (16U)
#define OPA2_CSR_OPA2_PGA_GAIN_Msk                (0xFUL<<OPA2_CSR_OPA2_PGA_GAIN_Pos)               /*!< 0x000F0000 */
#define OPA2_CSR_OPA2_PGA_GAIN                    OPA2_CSR_OPA2_PGA_GAIN_Msk
#define OPA2_CSR_OPA2_PGA_GAIN_0                  (0x1UL<<OPA2_CSR_OPA2_PGA_GAIN_Pos)               /*!< 0x00010000 */
#define OPA2_CSR_OPA2_PGA_GAIN_1                  (0x2UL<<OPA2_CSR_OPA2_PGA_GAIN_Pos)               /*!< 0x00020000 */
#define OPA2_CSR_OPA2_PGA_GAIN_2                  (0x4UL<<OPA2_CSR_OPA2_PGA_GAIN_Pos)               /*!< 0x00040000 */
#define OPA2_CSR_OPA2_PGA_GAIN_3                  (0x8UL<<OPA2_CSR_OPA2_PGA_GAIN_Pos)               /*!< 0x00080000 */
#define OPA2_CSR_OPA2_VBSEL_Pos                   (29U)
#define OPA2_CSR_OPA2_VBSEL_Msk                   (0x1UL<<OPA2_CSR_OPA2_VBSEL_Pos)                  /*!< 0x20000000 */
#define OPA2_CSR_OPA2_VBSEL                       OPA2_CSR_OPA2_VBSEL_Msk                           
#define OPA2_CSR_OPA2_LOCK_Pos                    (31U)
#define OPA2_CSR_OPA2_LOCK_Msk                    (0x1UL<<OPA2_CSR_OPA2_LOCK_Pos)                   /*!< 0x80000000 */
#define OPA2_CSR_OPA2_LOCK                        OPA2_CSR_OPA2_LOCK_Msk                            

/********************************* Bit definition for OPA3_CSR register *********************************************/
#define OPA3_CSR_OPA3_EN_Pos                      (0U)
#define OPA3_CSR_OPA3_EN_Msk                      (0x1UL<<OPA3_CSR_OPA3_EN_Pos)                     /*!< 0x00000001 */
#define OPA3_CSR_OPA3_EN                          OPA3_CSR_OPA3_EN_Msk                              
#define OPA3_CSR_OPA3_VPSEL_Pos                   (2U)
#define OPA3_CSR_OPA3_VPSEL_Msk                   (0x1UL<<OPA3_CSR_OPA3_VPSEL_Pos)                  /*!< 0x00000004 */
#define OPA3_CSR_OPA3_VPSEL                       OPA3_CSR_OPA3_VPSEL_Msk                           
#define OPA3_CSR_OPA3_VNSEL_Pos                   (5U)
#define OPA3_CSR_OPA3_VNSEL_Msk                   (0x3UL<<OPA3_CSR_OPA3_VNSEL_Pos)                  /*!< 0x00000060 */
#define OPA3_CSR_OPA3_VNSEL                       OPA3_CSR_OPA3_VNSEL_Msk
#define OPA3_CSR_OPA3_VNSEL_0                     (0x1UL<<OPA3_CSR_OPA3_VNSEL_Pos)                  /*!< 0x00000020 */
#define OPA3_CSR_OPA3_VNSEL_1                     (0x2UL<<OPA3_CSR_OPA3_VNSEL_Pos)                  /*!< 0x00000040 */
#define OPA3_CSR_OPA3_INTOEN_Pos                  (8U)
#define OPA3_CSR_OPA3_INTOEN_Msk                  (0x1UL<<OPA3_CSR_OPA3_INTOEN_Pos)                 /*!< 0x00000100 */
#define OPA3_CSR_OPA3_INTOEN                      OPA3_CSR_OPA3_INTOEN_Msk                          
#define OPA3_CSR_OPA3_EXTOEN_Pos                  (9U)
#define OPA3_CSR_OPA3_EXTOEN_Msk                  (0x1UL<<OPA3_CSR_OPA3_EXTOEN_Pos)                 /*!< 0x00000200 */
#define OPA3_CSR_OPA3_EXTOEN                      OPA3_CSR_OPA3_EXTOEN_Msk                          
#define OPA3_CSR_OPA3_MODE_Pos                    (14U)
#define OPA3_CSR_OPA3_MODE_Msk                    (0x3UL<<OPA3_CSR_OPA3_MODE_Pos)                   /*!< 0x0000C000 */
#define OPA3_CSR_OPA3_MODE                        OPA3_CSR_OPA3_MODE_Msk
#define OPA3_CSR_OPA3_MODE_0                      (0x1UL<<OPA3_CSR_OPA3_MODE_Pos)                   /*!< 0x00004000 */
#define OPA3_CSR_OPA3_MODE_1                      (0x2UL<<OPA3_CSR_OPA3_MODE_Pos)                   /*!< 0x00008000 */
#define OPA3_CSR_OPA3_PGA_GAIN_Pos                (16U)
#define OPA3_CSR_OPA3_PGA_GAIN_Msk                (0xFUL<<OPA3_CSR_OPA3_PGA_GAIN_Pos)               /*!< 0x000F0000 */
#define OPA3_CSR_OPA3_PGA_GAIN                    OPA3_CSR_OPA3_PGA_GAIN_Msk
#define OPA3_CSR_OPA3_PGA_GAIN_0                  (0x1UL<<OPA3_CSR_OPA3_PGA_GAIN_Pos)               /*!< 0x00010000 */
#define OPA3_CSR_OPA3_PGA_GAIN_1                  (0x2UL<<OPA3_CSR_OPA3_PGA_GAIN_Pos)               /*!< 0x00020000 */
#define OPA3_CSR_OPA3_PGA_GAIN_2                  (0x4UL<<OPA3_CSR_OPA3_PGA_GAIN_Pos)               /*!< 0x00040000 */
#define OPA3_CSR_OPA3_PGA_GAIN_3                  (0x8UL<<OPA3_CSR_OPA3_PGA_GAIN_Pos)               /*!< 0x00080000 */
#define OPA3_CSR_OPA3_VBSEL_Pos                   (29U)
#define OPA3_CSR_OPA3_VBSEL_Msk                   (0x1UL<<OPA3_CSR_OPA3_VBSEL_Pos)                  /*!< 0x20000000 */
#define OPA3_CSR_OPA3_VBSEL                       OPA3_CSR_OPA3_VBSEL_Msk                           
#define OPA3_CSR_OPA3_LOCK_Pos                    (31U)
#define OPA3_CSR_OPA3_LOCK_Msk                    (0x1UL<<OPA3_CSR_OPA3_LOCK_Pos)                   /*!< 0x80000000 */
#define OPA3_CSR_OPA3_LOCK                        OPA3_CSR_OPA3_LOCK_Msk                            

/********************************* Bit definition for OPA4_CSR register *********************************************/
#define OPA4_CSR_OPA4_EN_Pos                      (0U)
#define OPA4_CSR_OPA4_EN_Msk                      (0x1UL<<OPA4_CSR_OPA4_EN_Pos)                     /*!< 0x00000001 */
#define OPA4_CSR_OPA4_EN                          OPA4_CSR_OPA4_EN_Msk                              
#define OPA4_CSR_OPA4_VNSEL_Pos                   (5U)
#define OPA4_CSR_OPA4_VNSEL_Msk                   (0x1UL<<OPA4_CSR_OPA4_VNSEL_Pos)                  /*!< 0x00000020 */
#define OPA4_CSR_OPA4_VNSEL                       OPA4_CSR_OPA4_VNSEL_Msk                           
#define OPA4_CSR_OPA4_INTOEN_Pos                  (8U)
#define OPA4_CSR_OPA4_INTOEN_Msk                  (0x1UL<<OPA4_CSR_OPA4_INTOEN_Pos)                 /*!< 0x00000100 */
#define OPA4_CSR_OPA4_INTOEN                      OPA4_CSR_OPA4_INTOEN_Msk                          
#define OPA4_CSR_OPA4_EXTOEN_Pos                  (9U)
#define OPA4_CSR_OPA4_EXTOEN_Msk                  (0x1UL<<OPA4_CSR_OPA4_EXTOEN_Pos)                 /*!< 0x00000200 */
#define OPA4_CSR_OPA4_EXTOEN                      OPA4_CSR_OPA4_EXTOEN_Msk                          
#define OPA4_CSR_OPA4_MODE_Pos                    (14U)
#define OPA4_CSR_OPA4_MODE_Msk                    (0x3UL<<OPA4_CSR_OPA4_MODE_Pos)                   /*!< 0x0000C000 */
#define OPA4_CSR_OPA4_MODE                        OPA4_CSR_OPA4_MODE_Msk
#define OPA4_CSR_OPA4_MODE_0                      (0x1UL<<OPA4_CSR_OPA4_MODE_Pos)                   /*!< 0x00004000 */
#define OPA4_CSR_OPA4_MODE_1                      (0x2UL<<OPA4_CSR_OPA4_MODE_Pos)                   /*!< 0x00008000 */
#define OPA4_CSR_OPA4_PGA_GAIN_Pos                (16U)
#define OPA4_CSR_OPA4_PGA_GAIN_Msk                (0xFUL<<OPA4_CSR_OPA4_PGA_GAIN_Pos)               /*!< 0x000F0000 */
#define OPA4_CSR_OPA4_PGA_GAIN                    OPA4_CSR_OPA4_PGA_GAIN_Msk
#define OPA4_CSR_OPA4_PGA_GAIN_0                  (0x1UL<<OPA4_CSR_OPA4_PGA_GAIN_Pos)               /*!< 0x00010000 */
#define OPA4_CSR_OPA4_PGA_GAIN_1                  (0x2UL<<OPA4_CSR_OPA4_PGA_GAIN_Pos)               /*!< 0x00020000 */
#define OPA4_CSR_OPA4_PGA_GAIN_2                  (0x4UL<<OPA4_CSR_OPA4_PGA_GAIN_Pos)               /*!< 0x00040000 */
#define OPA4_CSR_OPA4_PGA_GAIN_3                  (0x8UL<<OPA4_CSR_OPA4_PGA_GAIN_Pos)               /*!< 0x00080000 */
#define OPA4_CSR_OPA4_VBSEL_Pos                   (29U)
#define OPA4_CSR_OPA4_VBSEL_Msk                   (0x1UL<<OPA4_CSR_OPA4_VBSEL_Pos)                  /*!< 0x20000000 */
#define OPA4_CSR_OPA4_VBSEL                       OPA4_CSR_OPA4_VBSEL_Msk                           
#define OPA4_CSR_OPA4_LOCK_Pos                    (31U)
#define OPA4_CSR_OPA4_LOCK_Msk                    (0x1UL<<OPA4_CSR_OPA4_LOCK_Pos)                   /*!< 0x80000000 */
#define OPA4_CSR_OPA4_LOCK                        OPA4_CSR_OPA4_LOCK_Msk                            

