breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************************************************************************************************/
/********************************* TIM ******************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for TIM_CR1 register **********************************************/
#define TIM_CR1_CEN_Pos                           (0U)
#define TIM_CR1_CEN_Msk                           (0x1UL<<TIM_CR1_CEN_Pos)                          /*!< 0x00000001 */
#define TIM_CR1_CEN                               TIM_CR1_CEN_Msk                                   
#define TIM_CR1_UDIS_Pos                          (1U)
#define TIM_CR1_UDIS_Msk                          (0x1UL<<TIM_CR1_UDIS_Pos)                         /*!< 0x00000002 */
#define TIM_CR1_UDIS                              TIM_CR1_UDIS_Msk                                  
#define TIM_CR1_URS_Pos                           (2U)
#define TIM_CR1_URS_Msk                           (0x1UL<<TIM_CR1_URS_Pos)                          /*!< 0x00000004 */
#define TIM_CR1_URS                               TIM_CR1_URS_Msk                                   
#define TIM_CR1_OPM_Pos                           (3U)
#define TIM_CR1_OPM_Msk                           (0x1UL<<TIM_CR1_OPM_Pos)                          /*!< 0x00000008 */
#define TIM_CR1_OPM                               TIM_CR1_OPM_Msk                                   
#define TIM_CR1_DIR_Pos                           (4U)
#define TIM_CR1_DIR_Msk                           (0x1UL<<TIM_CR1_DIR_Pos)                          /*!< 0x00000010 */
#define TIM_CR1_DIR                               TIM_CR1_DIR_Msk                                   
#define TIM_CR1_CMS_Pos                           (5U)
#define TIM_CR1_CMS_Msk                           (0x3UL<<TIM_CR1_CMS_Pos)                          /*!< 0x00000060 */
#define TIM_CR1_CMS                               TIM_CR1_CMS_Msk
#define TIM_CR1_CMS_0                             (0x1UL<<TIM_CR1_CMS_Pos)                          /*!< 0x00000020 */
#define TIM_CR1_CMS_1                             (0x2UL<<TIM_CR1_CMS_Pos)                          /*!< 0x00000040 */
#define TIM_CR1_ARPE_Pos                          (7U)
#define TIM_CR1_ARPE_Msk                          (0x1UL<<TIM_CR1_ARPE_Pos)                         /*!< 0x00000080 */
#define TIM_CR1_ARPE                              TIM_CR1_ARPE_Msk                                  
#define TIM_CR1_CKD_Pos                           (8U)
#define TIM_CR1_CKD_Msk                           (0x3UL<<TIM_CR1_CKD_Pos)                          /*!< 0x00000300 */
#define TIM_CR1_CKD                               TIM_CR1_CKD_Msk
#define TIM_CR1_CKD_0                             (0x1UL<<TIM_CR1_CKD_Pos)                          /*!< 0x00000100 */
#define TIM_CR1_CKD_1                             (0x2UL<<TIM_CR1_CKD_Pos)                          /*!< 0x00000200 */
#define TIM_CR1_UIFREMAP_Pos                      (11U)
#define TIM_CR1_UIFREMAP_Msk                      (0x1UL<<TIM_CR1_UIFREMAP_Pos)                     /*!< 0x00000800 */
#define TIM_CR1_UIFREMAP                          TIM_CR1_UIFREMAP_Msk                              
#define TIM_CR1_DITHEN_Pos                        (12U)
#define TIM_CR1_DITHEN_Msk                        (0x1UL<<TIM_CR1_DITHEN_Pos)                       /*!< 0x00001000 */
#define TIM_CR1_DITHEN                            TIM_CR1_DITHEN_Msk                                

/********************************* Bit definition for TIM_CR2 register **********************************************/
#define TIM_CR2_CCPC_Pos                          (0U)
#define TIM_CR2_CCPC_Msk                          (0x1UL<<TIM_CR2_CCPC_Pos)                         /*!< 0x00000001 */
#define TIM_CR2_CCPC                              TIM_CR2_CCPC_Msk                                  
#define TIM_CR2_CCUS_Pos                          (2U)
#define TIM_CR2_CCUS_Msk                          (0x1UL<<TIM_CR2_CCUS_Pos)                         /*!< 0x00000004 */
#define TIM_CR2_CCUS                              TIM_CR2_CCUS_Msk                                  
#define TIM_CR2_CCDS_Pos                          (3U)
#define TIM_CR2_CCDS_Msk                          (0x1UL<<TIM_CR2_CCDS_Pos)                         /*!< 0x00000008 */
#define TIM_CR2_CCDS                              TIM_CR2_CCDS_Msk                                  
//#define TIM_CR2_MMS_Pos                           (4U)
//#define TIM_CR2_MMS_Msk                           (0x7UL<<TIM_CR2_MMS_Pos)                          /*!< 0x00000070 */
//#define TIM_CR2_MMS                               TIM_CR2_MMS_Msk
//#define TIM_CR2_MMS_0                             (0x1UL<<TIM_CR2_MMS_Pos)                          /*!< 0x00000010 */
//#define TIM_CR2_MMS_1                             (0x2UL<<TIM_CR2_MMS_Pos)                          /*!< 0x00000020 */
//#define TIM_CR2_MMS_2                             (0x4UL<<TIM_CR2_MMS_Pos)                          /*!< 0x00000040 */
#define TIM_CR2_TI1S_Pos                          (7U)
#define TIM_CR2_TI1S_Msk                          (0x1UL<<TIM_CR2_TI1S_Pos)                         /*!< 0x00000080 */
#define TIM_CR2_TI1S                              TIM_CR2_TI1S_Msk                                  
#define TIM_CR2_OIS1_Pos                          (8U)
#define TIM_CR2_OIS1_Msk                          (0x1UL<<TIM_CR2_OIS1_Pos)                         /*!< 0x00000100 */
#define TIM_CR2_OIS1                              TIM_CR2_OIS1_Msk                                  
#define TIM_CR2_OIS1N_Pos                         (9U)
#define TIM_CR2_OIS1N_Msk                         (0x1UL<<TIM_CR2_OIS1N_Pos)                        /*!< 0x00000200 */
#define TIM_CR2_OIS1N                             TIM_CR2_OIS1N_Msk                                 
#define TIM_CR2_OIS2_Pos                          (10U)
#define TIM_CR2_OIS2_Msk                          (0x1UL<<TIM_CR2_OIS2_Pos)                         /*!< 0x00000400 */
#define TIM_CR2_OIS2                              TIM_CR2_OIS2_Msk                                  
#define TIM_CR2_OIS2N_Pos                         (11U)
#define TIM_CR2_OIS2N_Msk                         (0x1UL<<TIM_CR2_OIS2N_Pos)                        /*!< 0x00000800 */
#define TIM_CR2_OIS2N                             TIM_CR2_OIS2N_Msk                                 
#define TIM_CR2_OIS3_Pos                          (12U)
#define TIM_CR2_OIS3_Msk                          (0x1UL<<TIM_CR2_OIS3_Pos)                         /*!< 0x00001000 */
#define TIM_CR2_OIS3                              TIM_CR2_OIS3_Msk                                  
#define TIM_CR2_OIS3N_Pos                         (13U)
#define TIM_CR2_OIS3N_Msk                         (0x1UL<<TIM_CR2_OIS3N_Pos)                        /*!< 0x00002000 */
#define TIM_CR2_OIS3N                             TIM_CR2_OIS3N_Msk                                 
#define TIM_CR2_OIS4_Pos                          (14U)
#define TIM_CR2_OIS4_Msk                          (0x1UL<<TIM_CR2_OIS4_Pos)                         /*!< 0x00004000 */
#define TIM_CR2_OIS4                              TIM_CR2_OIS4_Msk                                  
#define TIM_CR2_OIS4N_Pos                         (15U)
#define TIM_CR2_OIS4N_Msk                         (0x1UL<<TIM_CR2_OIS4N_Pos)                        /*!< 0x00008000 */
#define TIM_CR2_OIS4N                             TIM_CR2_OIS4N_Msk                                 
#define TIM_CR2_OIS5_Pos                          (16U)
#define TIM_CR2_OIS5_Msk                          (0x1UL<<TIM_CR2_OIS5_Pos)                         /*!< 0x00010000 */
#define TIM_CR2_OIS5                              TIM_CR2_OIS5_Msk                                  
#define TIM_CR2_OIS6_Pos                          (18U)
#define TIM_CR2_OIS6_Msk                          (0x1UL<<TIM_CR2_OIS6_Pos)                         /*!< 0x00040000 */
#define TIM_CR2_OIS6                              TIM_CR2_OIS6_Msk                                  
#define TIM_CR2_MMS2_Pos                          (20U)
#define TIM_CR2_MMS2_Msk                          (0xFUL<<TIM_CR2_MMS2_Pos)                         /*!< 0x00F00000 */
#define TIM_CR2_MMS2                              TIM_CR2_MMS2_Msk
#define TIM_CR2_MMS2_0                            (0x1UL<<TIM_CR2_MMS2_Pos)                         /*!< 0x00100000 */
#define TIM_CR2_MMS2_1                            (0x2UL<<TIM_CR2_MMS2_Pos)                         /*!< 0x00200000 */
#define TIM_CR2_MMS2_2                            (0x4UL<<TIM_CR2_MMS2_Pos)                         /*!< 0x00400000 */
#define TIM_CR2_MMS2_3                            (0x8UL<<TIM_CR2_MMS2_Pos)                         /*!< 0x00800000 */
//#define TIM_CR2_MMS_Pos                           (25U)
//#define TIM_CR2_MMS_Msk                           (0x1UL<<TIM_CR2_MMS_Pos)                          /*!< 0x02000000 */
//#define TIM_CR2_MMS                               TIM_CR2_MMS_Msk                                   

/********************************* Bit definition for TIM_SMCR register *********************************************/
//#define TIM_SMCR_SMS_Pos                          (0U)
//#define TIM_SMCR_SMS_Msk                          (0x7UL<<TIM_SMCR_SMS_Pos)                         /*!< 0x00000007 */
//#define TIM_SMCR_SMS                              TIM_SMCR_SMS_Msk
//#define TIM_SMCR_SMS_0                            (0x1UL<<TIM_SMCR_SMS_Pos)                         /*!< 0x00000001 */
//#define TIM_SMCR_SMS_1                            (0x2UL<<TIM_SMCR_SMS_Pos)                         /*!< 0x00000002 */
//#define TIM_SMCR_SMS_2                            (0x4UL<<TIM_SMCR_SMS_Pos)                         /*!< 0x00000004 */
#define TIM_SMCR_OCCS_Pos                         (3U)
#define TIM_SMCR_OCCS_Msk                         (0x1UL<<TIM_SMCR_OCCS_Pos)                        /*!< 0x00000008 */
#define TIM_SMCR_OCCS                             TIM_SMCR_OCCS_Msk                                 
//#define TIM_SMCR_TS_Pos                           (4U)
//#define TIM_SMCR_TS_Msk                           (0x7UL<<TIM_SMCR_TS_Pos)                          /*!< 0x00000070 */
//#define TIM_SMCR_TS                               TIM_SMCR_TS_Msk
//#define TIM_SMCR_TS_0                             (0x1UL<<TIM_SMCR_TS_Pos)                          /*!< 0x00000010 */
//#define TIM_SMCR_TS_1                             (0x2UL<<TIM_SMCR_TS_Pos)                          /*!< 0x00000020 */
//#define TIM_SMCR_TS_2                             (0x4UL<<TIM_SMCR_TS_Pos)                          /*!< 0x00000040 */
#define TIM_SMCR_MSM_Pos                          (7U)
#define TIM_SMCR_MSM_Msk                          (0x1UL<<TIM_SMCR_MSM_Pos)                         /*!< 0x00000080 */
#define TIM_SMCR_MSM                              TIM_SMCR_MSM_Msk                                  
#define TIM_SMCR_ETF_Pos                          (8U)
#define TIM_SMCR_ETF_Msk                          (0xFUL<<TIM_SMCR_ETF_Pos)                         /*!< 0x00000F00 */
#define TIM_SMCR_ETF                              TIM_SMCR_ETF_Msk
#define TIM_SMCR_ETF_0                            (0x1UL<<TIM_SMCR_ETF_Pos)                         /*!< 0x00000100 */
#define TIM_SMCR_ETF_1                            (0x2UL<<TIM_SMCR_ETF_Pos)                         /*!< 0x00000200 */
#define TIM_SMCR_ETF_2                            (0x4UL<<TIM_SMCR_ETF_Pos)                         /*!< 0x00000400 */
#define TIM_SMCR_ETF_3                            (0x8UL<<TIM_SMCR_ETF_Pos)                         /*!< 0x00000800 */
#define TIM_SMCR_ETPS_Pos                         (12U)
#define TIM_SMCR_ETPS_Msk                         (0x3UL<<TIM_SMCR_ETPS_Pos)                        /*!< 0x00003000 */
#define TIM_SMCR_ETPS                             TIM_SMCR_ETPS_Msk
#define TIM_SMCR_ETPS_0                           (0x1UL<<TIM_SMCR_ETPS_Pos)                        /*!< 0x00001000 */
#define TIM_SMCR_ETPS_1                           (0x2UL<<TIM_SMCR_ETPS_Pos)                        /*!< 0x00002000 */
#define TIM_SMCR_ECE_Pos                          (14U)
#define TIM_SMCR_ECE_Msk                          (0x1UL<<TIM_SMCR_ECE_Pos)                         /*!< 0x00004000 */
#define TIM_SMCR_ECE                              TIM_SMCR_ECE_Msk                                  
#define TIM_SMCR_ETP_Pos                          (15U)
#define TIM_SMCR_ETP_Msk                          (0x1UL<<TIM_SMCR_ETP_Pos)                         /*!< 0x00008000 */
#define TIM_SMCR_ETP                              TIM_SMCR_ETP_Msk                                  
//#define TIM_SMCR_SMS_Pos                          (16U)
//#define TIM_SMCR_SMS_Msk                          (0x1UL<<TIM_SMCR_SMS_Pos)                         /*!< 0x00010000 */
//#define TIM_SMCR_SMS                              TIM_SMCR_SMS_Msk                                  
//#define TIM_SMCR_TS_Pos                           (20U)
//#define TIM_SMCR_TS_Msk                           (0x3UL<<TIM_SMCR_TS_Pos)                          /*!< 0x00300000 */
//#define TIM_SMCR_TS                               TIM_SMCR_TS_Msk
#define TIM_SMCR_TS_0                             (0x1UL<<TIM_SMCR_TS_Pos)                          /*!< 0x00100000 */
#define TIM_SMCR_TS_1                             (0x2UL<<TIM_SMCR_TS_Pos)                          /*!< 0x00200000 */
#define TIM_SMCR_SMSPE_Pos                        (24U)
#define TIM_SMCR_SMSPE_Msk                        (0x1UL<<TIM_SMCR_SMSPE_Pos)                       /*!< 0x01000000 */
#define TIM_SMCR_SMSPE                            TIM_SMCR_SMSPE_Msk                                
#define TIM_SMCR_SMSPS_Pos                        (25U)
#define TIM_SMCR_SMSPS_Msk                        (0x1UL<<TIM_SMCR_SMSPS_Pos)                       /*!< 0x02000000 */
#define TIM_SMCR_SMSPS                            TIM_SMCR_SMSPS_Msk                                

/********************************* Bit definition for TIM_DIER register *********************************************/
#define TIM_DIER_UIE_Pos                          (0U)
#define TIM_DIER_UIE_Msk                          (0x1UL<<TIM_DIER_UIE_Pos)                         /*!< 0x00000001 */
#define TIM_DIER_UIE                              TIM_DIER_UIE_Msk                                  
#define TIM_DIER_CC1IE_Pos                        (1U)
#define TIM_DIER_CC1IE_Msk                        (0x1UL<<TIM_DIER_CC1IE_Pos)                       /*!< 0x00000002 */
#define TIM_DIER_CC1IE                            TIM_DIER_CC1IE_Msk                                
#define TIM_DIER_CC2IE_Pos                        (2U)
#define TIM_DIER_CC2IE_Msk                        (0x1UL<<TIM_DIER_CC2IE_Pos)                       /*!< 0x00000004 */
#define TIM_DIER_CC2IE                            TIM_DIER_CC2IE_Msk                                
#define TIM_DIER_CC3IE_Pos                        (3U)
#define TIM_DIER_CC3IE_Msk                        (0x1UL<<TIM_DIER_CC3IE_Pos)                       /*!< 0x00000008 */
#define TIM_DIER_CC3IE                            TIM_DIER_CC3IE_Msk                                
#define TIM_DIER_CC4IE_Pos                        (4U)
#define TIM_DIER_CC4IE_Msk                        (0x1UL<<TIM_DIER_CC4IE_Pos)                       /*!< 0x00000010 */
#define TIM_DIER_CC4IE                            TIM_DIER_CC4IE_Msk                                
#define TIM_DIER_COMIE_Pos                        (5U)
#define TIM_DIER_COMIE_Msk                        (0x1UL<<TIM_DIER_COMIE_Pos)                       /*!< 0x00000020 */
#define TIM_DIER_COMIE                            TIM_DIER_COMIE_Msk                                
#define TIM_DIER_TIE_Pos                          (6U)
#define TIM_DIER_TIE_Msk                          (0x1UL<<TIM_DIER_TIE_Pos)                         /*!< 0x00000040 */
#define TIM_DIER_TIE                              TIM_DIER_TIE_Msk                                  
#define TIM_DIER_BIE_Pos                          (7U)
#define TIM_DIER_BIE_Msk                          (0x1UL<<TIM_DIER_BIE_Pos)                         /*!< 0x00000080 */
#define TIM_DIER_BIE                              TIM_DIER_BIE_Msk                                  
#define TIM_DIER_UDE_Pos                          (8U)
#define TIM_DIER_UDE_Msk                          (0x1UL<<TIM_DIER_UDE_Pos)                         /*!< 0x00000100 */
#define TIM_DIER_UDE                              TIM_DIER_UDE_Msk                                  
#define TIM_DIER_CC1DE_Pos                        (9U)
#define TIM_DIER_CC1DE_Msk                        (0x1UL<<TIM_DIER_CC1DE_Pos)                       /*!< 0x00000200 */
#define TIM_DIER_CC1DE                            TIM_DIER_CC1DE_Msk                                
#define TIM_DIER_CC2DE_Pos                        (10U)
#define TIM_DIER_CC2DE_Msk                        (0x1UL<<TIM_DIER_CC2DE_Pos)                       /*!< 0x00000400 */
#define TIM_DIER_CC2DE                            TIM_DIER_CC2DE_Msk                                
#define TIM_DIER_CC3DE_Pos                        (11U)
#define TIM_DIER_CC3DE_Msk                        (0x1UL<<TIM_DIER_CC3DE_Pos)                       /*!< 0x00000800 */
#define TIM_DIER_CC3DE                            TIM_DIER_CC3DE_Msk                                
#define TIM_DIER_CC4DE_Pos                        (12U)
#define TIM_DIER_CC4DE_Msk                        (0x1UL<<TIM_DIER_CC4DE_Pos)                       /*!< 0x00001000 */
#define TIM_DIER_CC4DE                            TIM_DIER_CC4DE_Msk                                
#define TIM_DIER_COMDE_Pos                        (13U)
#define TIM_DIER_COMDE_Msk                        (0x1UL<<TIM_DIER_COMDE_Pos)                       /*!< 0x00002000 */
#define TIM_DIER_COMDE                            TIM_DIER_COMDE_Msk                                
#define TIM_DIER_TDE_Pos                          (14U)
#define TIM_DIER_TDE_Msk                          (0x1UL<<TIM_DIER_TDE_Pos)                         /*!< 0x00004000 */
#define TIM_DIER_TDE                              TIM_DIER_TDE_Msk                                  
#define TIM_DIER_IDXIE_Pos                        (20U)
#define TIM_DIER_IDXIE_Msk                        (0x1UL<<TIM_DIER_IDXIE_Pos)                       /*!< 0x00100000 */
#define TIM_DIER_IDXIE                            TIM_DIER_IDXIE_Msk                                
#define TIM_DIER_DIRIE_Pos                        (21U)
#define TIM_DIER_DIRIE_Msk                        (0x1UL<<TIM_DIER_DIRIE_Pos)                       /*!< 0x00200000 */
#define TIM_DIER_DIRIE                            TIM_DIER_DIRIE_Msk                                
#define TIM_DIER_IERRIE_Pos                       (22U)
#define TIM_DIER_IERRIE_Msk                       (0x1UL<<TIM_DIER_IERRIE_Pos)                      /*!< 0x00400000 */
#define TIM_DIER_IERRIE                           TIM_DIER_IERRIE_Msk                               
#define TIM_DIER_TERRIE_Pos                       (23U)
#define TIM_DIER_TERRIE_Msk                       (0x1UL<<TIM_DIER_TERRIE_Pos)                      /*!< 0x00800000 */
#define TIM_DIER_TERRIE                           TIM_DIER_TERRIE_Msk                               

