breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for TIM_SR register ***********************************************/
#define TIM_SR_UIF_Pos                            (0U)
#define TIM_SR_UIF_Msk                            (0x1UL<<TIM_SR_UIF_Pos)                           /*!< 0x00000001 */
#define TIM_SR_UIF                                TIM_SR_UIF_Msk                                    
#define TIM_SR_CC1IF_Pos                          (1U)
#define TIM_SR_CC1IF_Msk                          (0x1UL<<TIM_SR_CC1IF_Pos)                         /*!< 0x00000002 */
#define TIM_SR_CC1IF                              TIM_SR_CC1IF_Msk                                  
#define TIM_SR_CC2IF_Pos                          (2U)
#define TIM_SR_CC2IF_Msk                          (0x1UL<<TIM_SR_CC2IF_Pos)                         /*!< 0x00000004 */
#define TIM_SR_CC2IF                              TIM_SR_CC2IF_Msk                                  
#define TIM_SR_CC3IF_Pos                          (3U)
#define TIM_SR_CC3IF_Msk                          (0x1UL<<TIM_SR_CC3IF_Pos)                         /*!< 0x00000008 */
#define TIM_SR_CC3IF                              TIM_SR_CC3IF_Msk                                  
#define TIM_SR_CC4IF_Pos                          (4U)
#define TIM_SR_CC4IF_Msk                          (0x1UL<<TIM_SR_CC4IF_Pos)                         /*!< 0x00000010 */
#define TIM_SR_CC4IF                              TIM_SR_CC4IF_Msk                                  
#define TIM_SR_COMIF_Pos                          (5U)
#define TIM_SR_COMIF_Msk                          (0x1UL<<TIM_SR_COMIF_Pos)                         /*!< 0x00000020 */
#define TIM_SR_COMIF                              TIM_SR_COMIF_Msk                                  
#define TIM_SR_TIF_Pos                            (6U)
#define TIM_SR_TIF_Msk                            (0x1UL<<TIM_SR_TIF_Pos)                           /*!< 0x00000040 */
#define TIM_SR_TIF                                TIM_SR_TIF_Msk                                    
#define TIM_SR_BIF_Pos                            (7U)
#define TIM_SR_BIF_Msk                            (0x1UL<<TIM_SR_BIF_Pos)                           /*!< 0x00000080 */
#define TIM_SR_BIF                                TIM_SR_BIF_Msk                                    
#define TIM_SR_B2IF_Pos                           (8U)
#define TIM_SR_B2IF_Msk                           (0x1UL<<TIM_SR_B2IF_Pos)                          /*!< 0x00000100 */
#define TIM_SR_B2IF                               TIM_SR_B2IF_Msk                                   
#define TIM_SR_CC1OF_Pos                          (9U)
#define TIM_SR_CC1OF_Msk                          (0x1UL<<TIM_SR_CC1OF_Pos)                         /*!< 0x00000200 */
#define TIM_SR_CC1OF                              TIM_SR_CC1OF_Msk                                  
#define TIM_SR_CC2OF_Pos                          (10U)
#define TIM_SR_CC2OF_Msk                          (0x1UL<<TIM_SR_CC2OF_Pos)                         /*!< 0x00000400 */
#define TIM_SR_CC2OF                              TIM_SR_CC2OF_Msk                                  
#define TIM_SR_CC3OF_Pos                          (11U)
#define TIM_SR_CC3OF_Msk                          (0x1UL<<TIM_SR_CC3OF_Pos)                         /*!< 0x00000800 */
#define TIM_SR_CC3OF                              TIM_SR_CC3OF_Msk                                  
#define TIM_SR_CC4OF_Pos                          (12U)
#define TIM_SR_CC4OF_Msk                          (0x1UL<<TIM_SR_CC4OF_Pos)                         /*!< 0x00001000 */
#define TIM_SR_CC4OF                              TIM_SR_CC4OF_Msk                                  
#define TIM_SR_SBIF_Pos                           (13U)
#define TIM_SR_SBIF_Msk                           (0x1UL<<TIM_SR_SBIF_Pos)                          /*!< 0x00002000 */
#define TIM_SR_SBIF                               TIM_SR_SBIF_Msk                                   
#define TIM_SR_CC5IF_Pos                          (16U)
#define TIM_SR_CC5IF_Msk                          (0x1UL<<TIM_SR_CC5IF_Pos)                         /*!< 0x00010000 */
#define TIM_SR_CC5IF                              TIM_SR_CC5IF_Msk                                  
#define TIM_SR_CC6IF_Pos                          (17U)
#define TIM_SR_CC6IF_Msk                          (0x1UL<<TIM_SR_CC6IF_Pos)                         /*!< 0x00020000 */
#define TIM_SR_CC6IF                              TIM_SR_CC6IF_Msk                                  
#define TIM_SR_IC1IR_Pos                          (18U)
#define TIM_SR_IC1IR_Msk                          (0x1UL<<TIM_SR_IC1IR_Pos)                         /*!< 0x00040000 */
#define TIM_SR_IC1IR                              TIM_SR_IC1IR_Msk                                  
#define TIM_SR_IC2IR_Pos                          (19U)
#define TIM_SR_IC2IR_Msk                          (0x1UL<<TIM_SR_IC2IR_Pos)                         /*!< 0x00080000 */
#define TIM_SR_IC2IR                              TIM_SR_IC2IR_Msk                                  
#define TIM_SR_IDXF_Pos                           (20U)
#define TIM_SR_IDXF_Msk                           (0x1UL<<TIM_SR_IDXF_Pos)                          /*!< 0x00100000 */
#define TIM_SR_IDXF                               TIM_SR_IDXF_Msk                                   
#define TIM_SR_DIRF_Pos                           (21U)
#define TIM_SR_DIRF_Msk                           (0x1UL<<TIM_SR_DIRF_Pos)                          /*!< 0x00200000 */
#define TIM_SR_DIRF                               TIM_SR_DIRF_Msk                                   
#define TIM_SR_IERRF_Pos                          (22U)
#define TIM_SR_IERRF_Msk                          (0x1UL<<TIM_SR_IERRF_Pos)                         /*!< 0x00400000 */
#define TIM_SR_IERRF                              TIM_SR_IERRF_Msk                                  
#define TIM_SR_TERRF_Pos                          (23U)
#define TIM_SR_TERRF_Msk                          (0x1UL<<TIM_SR_TERRF_Pos)                         /*!< 0x00800000 */
#define TIM_SR_TERRF                              TIM_SR_TERRF_Msk                                  
#define TIM_SR_IC3IR_Pos                          (24U)
#define TIM_SR_IC3IR_Msk                          (0x1UL<<TIM_SR_IC3IR_Pos)                         /*!< 0x01000000 */
#define TIM_SR_IC3IR                              TIM_SR_IC3IR_Msk                                  
#define TIM_SR_IC4IR_Pos                          (25U)
#define TIM_SR_IC4IR_Msk                          (0x1UL<<TIM_SR_IC4IR_Pos)                         /*!< 0x02000000 */
#define TIM_SR_IC4IR                              TIM_SR_IC4IR_Msk                                  
#define TIM_SR_IC1IF_Pos                          (26U)
#define TIM_SR_IC1IF_Msk                          (0x1UL<<TIM_SR_IC1IF_Pos)                         /*!< 0x04000000 */
#define TIM_SR_IC1IF                              TIM_SR_IC1IF_Msk                                  
#define TIM_SR_IC2IF_Pos                          (27U)
#define TIM_SR_IC2IF_Msk                          (0x1UL<<TIM_SR_IC2IF_Pos)                         /*!< 0x08000000 */
#define TIM_SR_IC2IF                              TIM_SR_IC2IF_Msk                                  
#define TIM_SR_IC3IF_Pos                          (28U)
#define TIM_SR_IC3IF_Msk                          (0x1UL<<TIM_SR_IC3IF_Pos)                         /*!< 0x10000000 */
#define TIM_SR_IC3IF                              TIM_SR_IC3IF_Msk                                  
#define TIM_SR_IC4IF_Pos                          (29U)
#define TIM_SR_IC4IF_Msk                          (0x1UL<<TIM_SR_IC4IF_Pos)                         /*!< 0x20000000 */
#define TIM_SR_IC4IF                              TIM_SR_IC4IF_Msk                                  

/********************************* Bit definition for TIM_EGR register **********************************************/
#define TIM_EGR_UG_Pos                            (0U)
#define TIM_EGR_UG_Msk                            (0x1UL<<TIM_EGR_UG_Pos)                           /*!< 0x00000001 */
#define TIM_EGR_UG                                TIM_EGR_UG_Msk                                    
#define TIM_EGR_CC1G_Pos                          (1U)
#define TIM_EGR_CC1G_Msk                          (0x1UL<<TIM_EGR_CC1G_Pos)                         /*!< 0x00000002 */
#define TIM_EGR_CC1G                              TIM_EGR_CC1G_Msk                                  
#define TIM_EGR_CC2G_Pos                          (2U)
#define TIM_EGR_CC2G_Msk                          (0x1UL<<TIM_EGR_CC2G_Pos)                         /*!< 0x00000004 */
#define TIM_EGR_CC2G                              TIM_EGR_CC2G_Msk                                  
#define TIM_EGR_CC3G_Pos                          (3U)
#define TIM_EGR_CC3G_Msk                          (0x1UL<<TIM_EGR_CC3G_Pos)                         /*!< 0x00000008 */
#define TIM_EGR_CC3G                              TIM_EGR_CC3G_Msk                                  
#define TIM_EGR_CC4G_Pos                          (4U)
#define TIM_EGR_CC4G_Msk                          (0x1UL<<TIM_EGR_CC4G_Pos)                         /*!< 0x00000010 */
#define TIM_EGR_CC4G                              TIM_EGR_CC4G_Msk                                  
#define TIM_EGR_COMG_Pos                          (5U)
#define TIM_EGR_COMG_Msk                          (0x1UL<<TIM_EGR_COMG_Pos)                         /*!< 0x00000020 */
#define TIM_EGR_COMG                              TIM_EGR_COMG_Msk                                  
#define TIM_EGR_TG_Pos                            (6U)
#define TIM_EGR_TG_Msk                            (0x1UL<<TIM_EGR_TG_Pos)                           /*!< 0x00000040 */
#define TIM_EGR_TG                                TIM_EGR_TG_Msk                                    
#define TIM_EGR_BG_Pos                            (7U)
#define TIM_EGR_BG_Msk                            (0x1UL<<TIM_EGR_BG_Pos)                           /*!< 0x00000080 */
#define TIM_EGR_BG                                TIM_EGR_BG_Msk                                    
#define TIM_EGR_B2G_Pos                           (8U)
#define TIM_EGR_B2G_Msk                           (0x1UL<<TIM_EGR_B2G_Pos)                          /*!< 0x00000100 */
#define TIM_EGR_B2G                               TIM_EGR_B2G_Msk                                   


