breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for TIM_DTR2 register *********************************************/
#define TIM_DTR2_DTGF_Pos                         (0U)
#define TIM_DTR2_DTGF_Msk                         (0xFFUL<<TIM_DTR2_DTGF_Pos)                       /*!< 0x000000FF */
#define TIM_DTR2_DTGF                             TIM_DTR2_DTGF_Msk
#define TIM_DTR2_DTAE_Pos                         (16U)
#define TIM_DTR2_DTAE_Msk                         (0x1UL<<TIM_DTR2_DTAE_Pos)                        /*!< 0x00010000 */
#define TIM_DTR2_DTAE                             TIM_DTR2_DTAE_Msk                                 
#define TIM_DTR2_DTPE_Pos                         (17U)
#define TIM_DTR2_DTPE_Msk                         (0x1UL<<TIM_DTR2_DTPE_Pos)                        /*!< 0x00020000 */
#define TIM_DTR2_DTPE                             TIM_DTR2_DTPE_Msk                                 

/********************************* Bit definition for TIM_ECR register **********************************************/
#define TIM_ECR_IE_Pos                            (0U)
#define TIM_ECR_IE_Msk                            (0x1UL<<TIM_ECR_IE_Pos)                           /*!< 0x00000001 */
#define TIM_ECR_IE                                TIM_ECR_IE_Msk                                    
#define TIM_ECR_IDIR_Pos                          (1U)
#define TIM_ECR_IDIR_Msk                          (0x3UL<<TIM_ECR_IDIR_Pos)                         /*!< 0x00000006 */
#define TIM_ECR_IDIR                              TIM_ECR_IDIR_Msk
#define TIM_ECR_IDIR_0                            (0x1UL<<TIM_ECR_IDIR_Pos)                         /*!< 0x00000002 */
#define TIM_ECR_IDIR_1                            (0x2UL<<TIM_ECR_IDIR_Pos)                         /*!< 0x00000004 */
#define TIM_ECR_FIDX_Pos                          (5U)
#define TIM_ECR_FIDX_Msk                          (0x1UL<<TIM_ECR_FIDX_Pos)                         /*!< 0x00000020 */
#define TIM_ECR_FIDX                              TIM_ECR_FIDX_Msk                                  
#define TIM_ECR_IPOS_Pos                          (6U)
#define TIM_ECR_IPOS_Msk                          (0x3UL<<TIM_ECR_IPOS_Pos)                         /*!< 0x000000C0 */
#define TIM_ECR_IPOS                              TIM_ECR_IPOS_Msk
#define TIM_ECR_IPOS_0                            (0x1UL<<TIM_ECR_IPOS_Pos)                         /*!< 0x00000040 */
#define TIM_ECR_IPOS_1                            (0x2UL<<TIM_ECR_IPOS_Pos)                         /*!< 0x00000080 */
#define TIM_ECR_PW_Pos                            (16U)
#define TIM_ECR_PW_Msk                            (0xFFUL<<TIM_ECR_PW_Pos)                          /*!< 0x00FF0000 */
#define TIM_ECR_PW                                TIM_ECR_PW_Msk
#define TIM_ECR_PWPRSC_Pos                        (24U)
#define TIM_ECR_PWPRSC_Msk                        (0x7UL<<TIM_ECR_PWPRSC_Pos)                       /*!< 0x07000000 */
#define TIM_ECR_PWPRSC                            TIM_ECR_PWPRSC_Msk
#define TIM_ECR_PWPRSC_0                          (0x1UL<<TIM_ECR_PWPRSC_Pos)                       /*!< 0x01000000 */
#define TIM_ECR_PWPRSC_1                          (0x2UL<<TIM_ECR_PWPRSC_Pos)                       /*!< 0x02000000 */
#define TIM_ECR_PWPRSC_2                          (0x4UL<<TIM_ECR_PWPRSC_Pos)                       /*!< 0x04000000 */

/********************************* Bit definition for TIM_TISEL register ********************************************/
#define TIM_TISEL_TI1SEL_Pos                      (0U)
#define TIM_TISEL_TI1SEL_Msk                      (0xFUL<<TIM_TISEL_TI1SEL_Pos)                     /*!< 0x0000000F */
#define TIM_TISEL_TI1SEL                          TIM_TISEL_TI1SEL_Msk
#define TIM_TISEL_TI1SEL_0                        (0x1UL<<TIM_TISEL_TI1SEL_Pos)                     /*!< 0x00000001 */
#define TIM_TISEL_TI1SEL_1                        (0x2UL<<TIM_TISEL_TI1SEL_Pos)                     /*!< 0x00000002 */
#define TIM_TISEL_TI1SEL_2                        (0x4UL<<TIM_TISEL_TI1SEL_Pos)                     /*!< 0x00000004 */
#define TIM_TISEL_TI1SEL_3                        (0x8UL<<TIM_TISEL_TI1SEL_Pos)                     /*!< 0x00000008 */
#define TIM_TISEL_TI2SEL_Pos                      (8U)
#define TIM_TISEL_TI2SEL_Msk                      (0xFUL<<TIM_TISEL_TI2SEL_Pos)                     /*!< 0x00000F00 */
#define TIM_TISEL_TI2SEL                          TIM_TISEL_TI2SEL_Msk
#define TIM_TISEL_TI2SEL_0                        (0x1UL<<TIM_TISEL_TI2SEL_Pos)                     /*!< 0x00000100 */
#define TIM_TISEL_TI2SEL_1                        (0x2UL<<TIM_TISEL_TI2SEL_Pos)                     /*!< 0x00000200 */
#define TIM_TISEL_TI2SEL_2                        (0x4UL<<TIM_TISEL_TI2SEL_Pos)                     /*!< 0x00000400 */
#define TIM_TISEL_TI2SEL_3                        (0x8UL<<TIM_TISEL_TI2SEL_Pos)                     /*!< 0x00000800 */
#define TIM_TISEL_TI3SEL_Pos                      (16U)
#define TIM_TISEL_TI3SEL_Msk                      (0xFUL<<TIM_TISEL_TI3SEL_Pos)                     /*!< 0x000F0000 */
#define TIM_TISEL_TI3SEL                          TIM_TISEL_TI3SEL_Msk
#define TIM_TISEL_TI3SEL_0                        (0x1UL<<TIM_TISEL_TI3SEL_Pos)                     /*!< 0x00010000 */
#define TIM_TISEL_TI3SEL_1                        (0x2UL<<TIM_TISEL_TI3SEL_Pos)                     /*!< 0x00020000 */
#define TIM_TISEL_TI3SEL_2                        (0x4UL<<TIM_TISEL_TI3SEL_Pos)                     /*!< 0x00040000 */
#define TIM_TISEL_TI3SEL_3                        (0x8UL<<TIM_TISEL_TI3SEL_Pos)                     /*!< 0x00080000 */
#define TIM_TISEL_TI4SEL_Pos                      (24U)
#define TIM_TISEL_TI4SEL_Msk                      (0xFUL<<TIM_TISEL_TI4SEL_Pos)                     /*!< 0x0F000000 */
#define TIM_TISEL_TI4SEL                          TIM_TISEL_TI4SEL_Msk
#define TIM_TISEL_TI4SEL_0                        (0x1UL<<TIM_TISEL_TI4SEL_Pos)                     /*!< 0x01000000 */
#define TIM_TISEL_TI4SEL_1                        (0x2UL<<TIM_TISEL_TI4SEL_Pos)                     /*!< 0x02000000 */
#define TIM_TISEL_TI4SEL_2                        (0x4UL<<TIM_TISEL_TI4SEL_Pos)                     /*!< 0x04000000 */
#define TIM_TISEL_TI4SEL_3                        (0x8UL<<TIM_TISEL_TI4SEL_Pos)                     /*!< 0x08000000 */

