breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for TIM_AF1 register **********************************************/
#define TIM_AF1_BKINE_Pos                         (0U)
#define TIM_AF1_BKINE_Msk                         (0x1UL<<TIM_AF1_BKINE_Pos)                        /*!< 0x00000001 */
#define TIM_AF1_BKINE                             TIM_AF1_BKINE_Msk                                 
#define TIM_AF1_BKCMP1E_Pos                       (1U)
#define TIM_AF1_BKCMP1E_Msk                       (0x1UL<<TIM_AF1_BKCMP1E_Pos)                      /*!< 0x00000002 */
#define TIM_AF1_BKCMP1E                           TIM_AF1_BKCMP1E_Msk                               
#define TIM_AF1_BKCMP2E_Pos                       (2U)
#define TIM_AF1_BKCMP2E_Msk                       (0x1UL<<TIM_AF1_BKCMP2E_Pos)                      /*!< 0x00000004 */
#define TIM_AF1_BKCMP2E                           TIM_AF1_BKCMP2E_Msk                               
#define TIM_AF1_BKCMP3E_Pos                       (3U)
#define TIM_AF1_BKCMP3E_Msk                       (0x1UL<<TIM_AF1_BKCMP3E_Pos)                      /*!< 0x00000008 */
#define TIM_AF1_BKCMP3E                           TIM_AF1_BKCMP3E_Msk                               
#define TIM_AF1_BKCMP4E_Pos                       (4U)
#define TIM_AF1_BKCMP4E_Msk                       (0x1UL<<TIM_AF1_BKCMP4E_Pos)                      /*!< 0x00000010 */
#define TIM_AF1_BKCMP4E                           TIM_AF1_BKCMP4E_Msk                               
#define TIM_AF1_BKINP_Pos                         (9U)
#define TIM_AF1_BKINP_Msk                         (0x1UL<<TIM_AF1_BKINP_Pos)                        /*!< 0x00000200 */
#define TIM_AF1_BKINP                             TIM_AF1_BKINP_Msk                                 
#define TIM_AF1_BKCMP1P_Pos                       (10U)
#define TIM_AF1_BKCMP1P_Msk                       (0x1UL<<TIM_AF1_BKCMP1P_Pos)                      /*!< 0x00000400 */
#define TIM_AF1_BKCMP1P                           TIM_AF1_BKCMP1P_Msk                               
#define TIM_AF1_BKCMP2P_Pos                       (11U)
#define TIM_AF1_BKCMP2P_Msk                       (0x1UL<<TIM_AF1_BKCMP2P_Pos)                      /*!< 0x00000800 */
#define TIM_AF1_BKCMP2P                           TIM_AF1_BKCMP2P_Msk                               
#define TIM_AF1_BKCMP3P_Pos                       (12U)
#define TIM_AF1_BKCMP3P_Msk                       (0x1UL<<TIM_AF1_BKCMP3P_Pos)                      /*!< 0x00001000 */
#define TIM_AF1_BKCMP3P                           TIM_AF1_BKCMP3P_Msk                               
#define TIM_AF1_BKCMP4P_Pos                       (13U)
#define TIM_AF1_BKCMP4P_Msk                       (0x1UL<<TIM_AF1_BKCMP4P_Pos)                      /*!< 0x00002000 */
#define TIM_AF1_BKCMP4P                           TIM_AF1_BKCMP4P_Msk                               
#define TIM_AF1_ETRSEL_Pos                        (14U)
#define TIM_AF1_ETRSEL_Msk                        (0xFUL<<TIM_AF1_ETRSEL_Pos)                       /*!< 0x0003C000 */
#define TIM_AF1_ETRSEL                            TIM_AF1_ETRSEL_Msk
#define TIM_AF1_ETRSEL_0                          (0x1UL<<TIM_AF1_ETRSEL_Pos)                       /*!< 0x00004000 */
#define TIM_AF1_ETRSEL_1                          (0x2UL<<TIM_AF1_ETRSEL_Pos)                       /*!< 0x00008000 */
#define TIM_AF1_ETRSEL_2                          (0x4UL<<TIM_AF1_ETRSEL_Pos)                       /*!< 0x00010000 */
#define TIM_AF1_ETRSEL_3                          (0x8UL<<TIM_AF1_ETRSEL_Pos)                       /*!< 0x00020000 */
#define TIM_AF1_INTR_SEL_Pos                      (18U)
#define TIM_AF1_INTR_SEL_Msk                      (0x3UL<<TIM_AF1_INTR_SEL_Pos)                     /*!< 0x000C0000 */
#define TIM_AF1_INTR_SEL                          TIM_AF1_INTR_SEL_Msk
#define TIM_AF1_INTR_SEL_0                        (0x1UL<<TIM_AF1_INTR_SEL_Pos)                     /*!< 0x00040000 */
#define TIM_AF1_INTR_SEL_1                        (0x2UL<<TIM_AF1_INTR_SEL_Pos)                     /*!< 0x00080000 */
#define TIM_AF1_PWM_PHS_EN_Pos                    (20U)
#define TIM_AF1_PWM_PHS_EN_Msk                    (0x1UL<<TIM_AF1_PWM_PHS_EN_Pos)                   /*!< 0x00100000 */
#define TIM_AF1_PWM_PHS_EN                        TIM_AF1_PWM_PHS_EN_Msk                            

/********************************* Bit definition for TIM_AF2 register **********************************************/
#define TIM_AF2_BK2INE_Pos                        (0U)
#define TIM_AF2_BK2INE_Msk                        (0x1UL<<TIM_AF2_BK2INE_Pos)                       /*!< 0x00000001 */
#define TIM_AF2_BK2INE                            TIM_AF2_BK2INE_Msk                                
#define TIM_AF2_BK2CMP1E_Pos                      (1U)
#define TIM_AF2_BK2CMP1E_Msk                      (0x1UL<<TIM_AF2_BK2CMP1E_Pos)                     /*!< 0x00000002 */
#define TIM_AF2_BK2CMP1E                          TIM_AF2_BK2CMP1E_Msk                              
#define TIM_AF2_BK2CMP2E_Pos                      (2U)
#define TIM_AF2_BK2CMP2E_Msk                      (0x1UL<<TIM_AF2_BK2CMP2E_Pos)                     /*!< 0x00000004 */
#define TIM_AF2_BK2CMP2E                          TIM_AF2_BK2CMP2E_Msk                              
#define TIM_AF2_BK2CMP3E_Pos                      (3U)
#define TIM_AF2_BK2CMP3E_Msk                      (0x1UL<<TIM_AF2_BK2CMP3E_Pos)                     /*!< 0x00000008 */
#define TIM_AF2_BK2CMP3E                          TIM_AF2_BK2CMP3E_Msk                              
#define TIM_AF2_BK2CMP4E_Pos                      (4U)
#define TIM_AF2_BK2CMP4E_Msk                      (0x1UL<<TIM_AF2_BK2CMP4E_Pos)                     /*!< 0x00000010 */
#define TIM_AF2_BK2CMP4E                          TIM_AF2_BK2CMP4E_Msk                              
#define TIM_AF2_BK2INP_Pos                        (9U)
#define TIM_AF2_BK2INP_Msk                        (0x1UL<<TIM_AF2_BK2INP_Pos)                       /*!< 0x00000200 */
#define TIM_AF2_BK2INP                            TIM_AF2_BK2INP_Msk                                
#define TIM_AF2_BK2CMP1P_Pos                      (10U)
#define TIM_AF2_BK2CMP1P_Msk                      (0x1UL<<TIM_AF2_BK2CMP1P_Pos)                     /*!< 0x00000400 */
#define TIM_AF2_BK2CMP1P                          TIM_AF2_BK2CMP1P_Msk                              
#define TIM_AF2_BK2CMP2P_Pos                      (11U)
#define TIM_AF2_BK2CMP2P_Msk                      (0x1UL<<TIM_AF2_BK2CMP2P_Pos)                     /*!< 0x00000800 */
#define TIM_AF2_BK2CMP2P                          TIM_AF2_BK2CMP2P_Msk                              
#define TIM_AF2_BK2CMP3P_Pos                      (12U)
#define TIM_AF2_BK2CMP3P_Msk                      (0x1UL<<TIM_AF2_BK2CMP3P_Pos)                     /*!< 0x00001000 */
#define TIM_AF2_BK2CMP3P                          TIM_AF2_BK2CMP3P_Msk                              
#define TIM_AF2_BK2CMP4P_Pos                      (13U)
#define TIM_AF2_BK2CMP4P_Msk                      (0x1UL<<TIM_AF2_BK2CMP4P_Pos)                     /*!< 0x00002000 */
#define TIM_AF2_BK2CMP4P                          TIM_AF2_BK2CMP4P_Msk                              
#define TIM_AF2_OCRSEL_Pos                        (16U)
#define TIM_AF2_OCRSEL_Msk                        (0x7UL<<TIM_AF2_OCRSEL_Pos)                       /*!< 0x00070000 */
#define TIM_AF2_OCRSEL                            TIM_AF2_OCRSEL_Msk
#define TIM_AF2_OCRSEL_0                          (0x1UL<<TIM_AF2_OCRSEL_Pos)                       /*!< 0x00010000 */
#define TIM_AF2_OCRSEL_1                          (0x2UL<<TIM_AF2_OCRSEL_Pos)                       /*!< 0x00020000 */
#define TIM_AF2_OCRSEL_2                          (0x4UL<<TIM_AF2_OCRSEL_Pos)                       /*!< 0x00040000 */

