breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for TIM_OR1 register **********************************************/
#define TIM_OR1_BID_BG_EXTEND_DIS_Pos             (30U)
#define TIM_OR1_BID_BG_EXTEND_DIS_Msk             (0x1UL<<TIM_OR1_BID_BG_EXTEND_DIS_Pos)            /*!< 0x40000000 */
#define TIM_OR1_BID_BG_EXTEND_DIS                 TIM_OR1_BID_BG_EXTEND_DIS_Msk                     
#define TIM_OR1_DG_MSK_DIS_Pos                    (31U)
#define TIM_OR1_DG_MSK_DIS_Msk                    (0x1UL<<TIM_OR1_DG_MSK_DIS_Pos)                   /*!< 0x80000000 */
#define TIM_OR1_DG_MSK_DIS                        TIM_OR1_DG_MSK_DIS_Msk                            

/********************************* Bit definition for TIM_MTADCCR register ******************************************/
#define TIM_MTADCCR_MTZEROE_Pos                   (0U)
#define TIM_MTADCCR_MTZEROE_Msk                   (0x1UL<<TIM_MTADCCR_MTZEROE_Pos)                  /*!< 0x00000001 */
#define TIM_MTADCCR_MTZEROE                       TIM_MTADCCR_MTZEROE_Msk                           
#define TIM_MTADCCR_MTARRE_Pos                    (1U)
#define TIM_MTADCCR_MTARRE_Msk                    (0x1UL<<TIM_MTADCCR_MTARRE_Pos)                   /*!< 0x00000002 */
#define TIM_MTADCCR_MTARRE                        TIM_MTADCCR_MTARRE_Msk                            
#define TIM_MTADCCR_UMTCCR1E_Pos                  (2U)
#define TIM_MTADCCR_UMTCCR1E_Msk                  (0x1UL<<TIM_MTADCCR_UMTCCR1E_Pos)                 /*!< 0x00000004 */
#define TIM_MTADCCR_UMTCCR1E                      TIM_MTADCCR_UMTCCR1E_Msk                          
#define TIM_MTADCCR_UMTCCR1HE_Pos                 (3U)
#define TIM_MTADCCR_UMTCCR1HE_Msk                 (0x1UL<<TIM_MTADCCR_UMTCCR1HE_Pos)                /*!< 0x00000008 */
#define TIM_MTADCCR_UMTCCR1HE                     TIM_MTADCCR_UMTCCR1HE_Msk                         
#define TIM_MTADCCR_UMTCCR2E_Pos                  (4U)
#define TIM_MTADCCR_UMTCCR2E_Msk                  (0x1UL<<TIM_MTADCCR_UMTCCR2E_Pos)                 /*!< 0x00000010 */
#define TIM_MTADCCR_UMTCCR2E                      TIM_MTADCCR_UMTCCR2E_Msk                          
#define TIM_MTADCCR_UMTCCR2HE_Pos                 (5U)
#define TIM_MTADCCR_UMTCCR2HE_Msk                 (0x1UL<<TIM_MTADCCR_UMTCCR2HE_Pos)                /*!< 0x00000020 */
#define TIM_MTADCCR_UMTCCR2HE                     TIM_MTADCCR_UMTCCR2HE_Msk                         
#define TIM_MTADCCR_UMTCCR3E_Pos                  (6U)
#define TIM_MTADCCR_UMTCCR3E_Msk                  (0x1UL<<TIM_MTADCCR_UMTCCR3E_Pos)                 /*!< 0x00000040 */
#define TIM_MTADCCR_UMTCCR3E                      TIM_MTADCCR_UMTCCR3E_Msk                          
#define TIM_MTADCCR_UMTCCR3HE_Pos                 (7U)
#define TIM_MTADCCR_UMTCCR3HE_Msk                 (0x1UL<<TIM_MTADCCR_UMTCCR3HE_Pos)                /*!< 0x00000080 */
#define TIM_MTADCCR_UMTCCR3HE                     TIM_MTADCCR_UMTCCR3HE_Msk                         
#define TIM_MTADCCR_UMTCCR4E_Pos                  (8U)
#define TIM_MTADCCR_UMTCCR4E_Msk                  (0x1UL<<TIM_MTADCCR_UMTCCR4E_Pos)                 /*!< 0x00000100 */
#define TIM_MTADCCR_UMTCCR4E                      TIM_MTADCCR_UMTCCR4E_Msk                          
#define TIM_MTADCCR_UMTCCR4HE_Pos                 (9U)
#define TIM_MTADCCR_UMTCCR4HE_Msk                 (0x1UL<<TIM_MTADCCR_UMTCCR4HE_Pos)                /*!< 0x00000200 */
#define TIM_MTADCCR_UMTCCR4HE                     TIM_MTADCCR_UMTCCR4HE_Msk                         
#define TIM_MTADCCR_DMTCCR1E_Pos                  (10U)
#define TIM_MTADCCR_DMTCCR1E_Msk                  (0x1UL<<TIM_MTADCCR_DMTCCR1E_Pos)                 /*!< 0x00000400 */
#define TIM_MTADCCR_DMTCCR1E                      TIM_MTADCCR_DMTCCR1E_Msk                          
#define TIM_MTADCCR_DMTCCR1HE_Pos                 (11U)
#define TIM_MTADCCR_DMTCCR1HE_Msk                 (0x1UL<<TIM_MTADCCR_DMTCCR1HE_Pos)                /*!< 0x00000800 */
#define TIM_MTADCCR_DMTCCR1HE                     TIM_MTADCCR_DMTCCR1HE_Msk                         
#define TIM_MTADCCR_DMTCCR2E_Pos                  (12U)
#define TIM_MTADCCR_DMTCCR2E_Msk                  (0x1UL<<TIM_MTADCCR_DMTCCR2E_Pos)                 /*!< 0x00001000 */
#define TIM_MTADCCR_DMTCCR2E                      TIM_MTADCCR_DMTCCR2E_Msk                          
#define TIM_MTADCCR_DMTCCR2HE_Pos                 (13U)
#define TIM_MTADCCR_DMTCCR2HE_Msk                 (0x1UL<<TIM_MTADCCR_DMTCCR2HE_Pos)                /*!< 0x00002000 */
#define TIM_MTADCCR_DMTCCR2HE                     TIM_MTADCCR_DMTCCR2HE_Msk                         
#define TIM_MTADCCR_DMTCCR3E_Pos                  (14U)
#define TIM_MTADCCR_DMTCCR3E_Msk                  (0x1UL<<TIM_MTADCCR_DMTCCR3E_Pos)                 /*!< 0x00004000 */
#define TIM_MTADCCR_DMTCCR3E                      TIM_MTADCCR_DMTCCR3E_Msk                          
#define TIM_MTADCCR_DMTCCR3HE_Pos                 (15U)
#define TIM_MTADCCR_DMTCCR3HE_Msk                 (0x1UL<<TIM_MTADCCR_DMTCCR3HE_Pos)                /*!< 0x00008000 */
#define TIM_MTADCCR_DMTCCR3HE                     TIM_MTADCCR_DMTCCR3HE_Msk                         
#define TIM_MTADCCR_DMTCCR4E_Pos                  (16U)
#define TIM_MTADCCR_DMTCCR4E_Msk                  (0x1UL<<TIM_MTADCCR_DMTCCR4E_Pos)                 /*!< 0x00010000 */
#define TIM_MTADCCR_DMTCCR4E                      TIM_MTADCCR_DMTCCR4E_Msk                          
#define TIM_MTADCCR_DMTCCR4HE_Pos                 (17U)
#define TIM_MTADCCR_DMTCCR4HE_Msk                 (0x1UL<<TIM_MTADCCR_DMTCCR4HE_Pos)                /*!< 0x00020000 */
#define TIM_MTADCCR_DMTCCR4HE                     TIM_MTADCCR_DMTCCR4HE_Msk                         
#define TIM_MTADCCR_MTADCE_Pos                    (18U)
#define TIM_MTADCCR_MTADCE_Msk                    (0x1UL<<TIM_MTADCCR_MTADCE_Pos)                   /*!< 0x00040000 */
#define TIM_MTADCCR_MTADCE                        TIM_MTADCCR_MTADCE_Msk                            

/********************************* Bit definition for TIM_DCR register **********************************************/
#define TIM_DCR_DBA_Pos                           (0U)
#define TIM_DCR_DBA_Msk                           (0x1FUL<<TIM_DCR_DBA_Pos)                         /*!< 0x0000001F */
#define TIM_DCR_DBA                               TIM_DCR_DBA_Msk
#define TIM_DCR_DBA_0                             (0x1UL<<TIM_DCR_DBA_Pos)                          /*!< 0x00000001 */
#define TIM_DCR_DBA_1                             (0x2UL<<TIM_DCR_DBA_Pos)                          /*!< 0x00000002 */
#define TIM_DCR_DBA_2                             (0x4UL<<TIM_DCR_DBA_Pos)                          /*!< 0x00000004 */
#define TIM_DCR_DBA_3                             (0x8UL<<TIM_DCR_DBA_Pos)                          /*!< 0x00000008 */
#define TIM_DCR_DBA_4                             (0x10UL<<TIM_DCR_DBA_Pos)                         /*!< 0x00000010 */
#define TIM_DCR_DBL_Pos                           (8U)
#define TIM_DCR_DBL_Msk                           (0x1FUL<<TIM_DCR_DBL_Pos)                         /*!< 0x00001F00 */
#define TIM_DCR_DBL                               TIM_DCR_DBL_Msk
#define TIM_DCR_DBL_0                             (0x1UL<<TIM_DCR_DBL_Pos)                          /*!< 0x00000100 */
#define TIM_DCR_DBL_1                             (0x2UL<<TIM_DCR_DBL_Pos)                          /*!< 0x00000200 */
#define TIM_DCR_DBL_2                             (0x4UL<<TIM_DCR_DBL_Pos)                          /*!< 0x00000400 */
#define TIM_DCR_DBL_3                             (0x8UL<<TIM_DCR_DBL_Pos)                          /*!< 0x00000800 */
#define TIM_DCR_DBL_4                             (0x10UL<<TIM_DCR_DBL_Pos)                         /*!< 0x00001000 */

/********************************* Bit definition for TIM_DMAR register *********************************************/
#define TIM_DMAR_DMAB_Pos                         (0U)
#define TIM_DMAR_DMAB_Msk                         (0xFFFFFFFFUL<<TIM_DMAR_DMAB_Pos)                 /*!< 0xFFFFFFFF */
#define TIM_DMAR_DMAB                             TIM_DMAR_DMAB_Msk

