breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************************************************************************************************/
/********************************* DBGMCU ***************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for DBGMCU_IDCODE register ****************************************/
#define DBGMCU_IDCODE_REV_ID_Pos                  (0U)
#define DBGMCU_IDCODE_REV_ID_Msk                  (0xFFFFFFFFUL<<DBGMCU_IDCODE_REV_ID_Pos)          /*!< 0xFFFFFFFF */
#define DBGMCU_IDCODE_REV_ID                      DBGMCU_IDCODE_REV_ID_Msk

/********************************* Bit definition for DBGMCU_CR1 register *******************************************/
#define DBGMCU_CR1_DBG_SLEEP_Pos                  (0U)
#define DBGMCU_CR1_DBG_SLEEP_Msk                  (0x1UL<<DBGMCU_CR1_DBG_SLEEP_Pos)                 /*!< 0x00000001 */
#define DBGMCU_CR1_DBG_SLEEP                      DBGMCU_CR1_DBG_SLEEP_Msk                          
#define DBGMCU_CR1_DBG_STOP_Pos                   (1U)
#define DBGMCU_CR1_DBG_STOP_Msk                   (0x1UL<<DBGMCU_CR1_DBG_STOP_Pos)                  /*!< 0x00000002 */
#define DBGMCU_CR1_DBG_STOP                       DBGMCU_CR1_DBG_STOP_Msk                           
#define DBGMCU_CR1_DBG_STDBY_Pos                  (2U)
#define DBGMCU_CR1_DBG_STDBY_Msk                  (0x1UL<<DBGMCU_CR1_DBG_STDBY_Pos)                 /*!< 0x00000004 */
#define DBGMCU_CR1_DBG_STDBY                      DBGMCU_CR1_DBG_STDBY_Msk                          
#define DBGMCU_CR1_DBG_IWDG_STOP_Pos              (8U)
#define DBGMCU_CR1_DBG_IWDG_STOP_Msk              (0x1UL<<DBGMCU_CR1_DBG_IWDG_STOP_Pos)             /*!< 0x00000100 */
#define DBGMCU_CR1_DBG_IWDG_STOP                  DBGMCU_CR1_DBG_IWDG_STOP_Msk                      
#define DBGMCU_CR1_DBG_WWDG_STOP_Pos              (9U)
#define DBGMCU_CR1_DBG_WWDG_STOP_Msk              (0x1UL<<DBGMCU_CR1_DBG_WWDG_STOP_Pos)             /*!< 0x00000200 */
#define DBGMCU_CR1_DBG_WWDG_STOP                  DBGMCU_CR1_DBG_WWDG_STOP_Msk                      
#define DBGMCU_CR1_DBG_TIM1_STOP_Pos              (10U)
#define DBGMCU_CR1_DBG_TIM1_STOP_Msk              (0x1UL<<DBGMCU_CR1_DBG_TIM1_STOP_Pos)             /*!< 0x00000400 */
#define DBGMCU_CR1_DBG_TIM1_STOP                  DBGMCU_CR1_DBG_TIM1_STOP_Msk                      
#define DBGMCU_CR1_DBG_TIM2_STOP_Pos              (11U)
#define DBGMCU_CR1_DBG_TIM2_STOP_Msk              (0x1UL<<DBGMCU_CR1_DBG_TIM2_STOP_Pos)             /*!< 0x00000800 */
#define DBGMCU_CR1_DBG_TIM2_STOP                  DBGMCU_CR1_DBG_TIM2_STOP_Msk                      
#define DBGMCU_CR1_DBG_TIM3_STOP_Pos              (12U)
#define DBGMCU_CR1_DBG_TIM3_STOP_Msk              (0x1UL<<DBGMCU_CR1_DBG_TIM3_STOP_Pos)             /*!< 0x00001000 */
#define DBGMCU_CR1_DBG_TIM3_STOP                  DBGMCU_CR1_DBG_TIM3_STOP_Msk                      
#define DBGMCU_CR1_DBG_I2C1_SMBUS_TIMEOUT_Pos     (15U)
#define DBGMCU_CR1_DBG_I2C1_SMBUS_TIMEOUT_Msk     (0x1UL<<DBGMCU_CR1_DBG_I2C1_SMBUS_TIMEOUT_Pos)    /*!< 0x00008000 */
#define DBGMCU_CR1_DBG_I2C1_SMBUS_TIMEOUT         DBGMCU_CR1_DBG_I2C1_SMBUS_TIMEOUT_Msk             
#define DBGMCU_CR1_DBG_I2C2_SMBUS_TIMEOUT_Pos     (16U)
#define DBGMCU_CR1_DBG_I2C2_SMBUS_TIMEOUT_Msk     (0x1UL<<DBGMCU_CR1_DBG_I2C2_SMBUS_TIMEOUT_Pos)    /*!< 0x00010000 */
#define DBGMCU_CR1_DBG_I2C2_SMBUS_TIMEOUT         DBGMCU_CR1_DBG_I2C2_SMBUS_TIMEOUT_Msk             
#define DBGMCU_CR1_DBG_TIM8_STOP_Pos              (17U)
#define DBGMCU_CR1_DBG_TIM8_STOP_Msk              (0x1UL<<DBGMCU_CR1_DBG_TIM8_STOP_Pos)             /*!< 0x00020000 */
#define DBGMCU_CR1_DBG_TIM8_STOP                  DBGMCU_CR1_DBG_TIM8_STOP_Msk                      
#define DBGMCU_CR1_DBG_TIM6_STOP_Pos              (19U)
#define DBGMCU_CR1_DBG_TIM6_STOP_Msk              (0x1UL<<DBGMCU_CR1_DBG_TIM6_STOP_Pos)             /*!< 0x00080000 */
#define DBGMCU_CR1_DBG_TIM6_STOP                  DBGMCU_CR1_DBG_TIM6_STOP_Msk                      
#define DBGMCU_CR1_DBG_TIM7_STOP_Pos              (20U)
#define DBGMCU_CR1_DBG_TIM7_STOP_Msk              (0x1UL<<DBGMCU_CR1_DBG_TIM7_STOP_Pos)             /*!< 0x00100000 */
#define DBGMCU_CR1_DBG_TIM7_STOP                  DBGMCU_CR1_DBG_TIM7_STOP_Msk                      

/********************************* Bit definition for DBGMCU_CR2 register *******************************************/
#define DBGMCU_CR2_DBG_HRPWM_CLK_OFF_Pos          (16U)
#define DBGMCU_CR2_DBG_HRPWM_CLK_OFF_Msk          (0x1UL<<DBGMCU_CR2_DBG_HRPWM_CLK_OFF_Pos)         /*!< 0x00010000 */
#define DBGMCU_CR2_DBG_HRPWM_CLK_OFF              DBGMCU_CR2_DBG_HRPWM_CLK_OFF_Msk                  
#define DBGMCU_CR2_DBG_HRPWM_EN_Pos               (17U)
#define DBGMCU_CR2_DBG_HRPWM_EN_Msk               (0x1UL<<DBGMCU_CR2_DBG_HRPWM_EN_Pos)              /*!< 0x00020000 */
#define DBGMCU_CR2_DBG_HRPWM_EN                   DBGMCU_CR2_DBG_HRPWM_EN_Msk                       

/********************************************************************************************************************/
/********************************* VREFBUF **************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for VREFBUF_CR register *******************************************/
#define VREFBUF_CR_VREFBUFEN_Pos                  (0U)
#define VREFBUF_CR_VREFBUFEN_Msk                  (0x1UL<<VREFBUF_CR_VREFBUFEN_Pos)                 /*!< 0x00000001 */
#define VREFBUF_CR_VREFBUFEN                      VREFBUF_CR_VREFBUFEN_Msk                          
#define VREFBUF_CR_VREFBUFSEL_Pos                 (1U)
#define VREFBUF_CR_VREFBUFSEL_Msk                 (0x7UL<<VREFBUF_CR_VREFBUFSEL_Pos)                /*!< 0x0000000E */
#define VREFBUF_CR_VREFBUFSEL                     VREFBUF_CR_VREFBUFSEL_Msk
#define VREFBUF_CR_VREFBUFSEL_0                   (0x1UL<<VREFBUF_CR_VREFBUFSEL_Pos)                /*!< 0x00000002 */
#define VREFBUF_CR_VREFBUFSEL_1                   (0x2UL<<VREFBUF_CR_VREFBUFSEL_Pos)                /*!< 0x00000004 */
#define VREFBUF_CR_VREFBUFSEL_2                   (0x4UL<<VREFBUF_CR_VREFBUFSEL_Pos)                /*!< 0x00000008 */

