breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************************************************************************************************/
/********************************* PWR ******************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for PWR_CR1 register **********************************************/
#define PWR_CR1_LPMS_ACTIVE_Pos                   (0U)
#define PWR_CR1_LPMS_ACTIVE_Msk                   (0x1UL<<PWR_CR1_LPMS_ACTIVE_Pos)                  /*!< 0x00000001 */
#define PWR_CR1_LPMS_ACTIVE                       PWR_CR1_LPMS_ACTIVE_Msk                           
#define PWR_CR1_LPMS_SLP_Pos                      (1U)
#define PWR_CR1_LPMS_SLP_Msk                      (0x1UL<<PWR_CR1_LPMS_SLP_Pos)                     /*!< 0x00000002 */
#define PWR_CR1_LPMS_SLP                          PWR_CR1_LPMS_SLP_Msk                              
#define PWR_CR1_VR_MODE_SLP_Pos                   (4U)
#define PWR_CR1_VR_MODE_SLP_Msk                   (0x1UL<<PWR_CR1_VR_MODE_SLP_Pos)                  /*!< 0x00000010 */
#define PWR_CR1_VR_MODE_SLP                       PWR_CR1_VR_MODE_SLP_Msk                           
#define PWR_CR1_DBP_Pos                           (8U)
#define PWR_CR1_DBP_Msk                           (0x1UL<<PWR_CR1_DBP_Pos)                          /*!< 0x00000100 */
#define PWR_CR1_DBP                               PWR_CR1_DBP_Msk                                   
#define PWR_CR1_FLS_WUPT_Pos                      (12U)
#define PWR_CR1_FLS_WUPT_Msk                      (0x3UL<<PWR_CR1_FLS_WUPT_Pos)                     /*!< 0x00003000 */
#define PWR_CR1_FLS_WUPT                          PWR_CR1_FLS_WUPT_Msk
#define PWR_CR1_FLS_WUPT_0                        (0x1UL<<PWR_CR1_FLS_WUPT_Pos)                     /*!< 0x00001000 */
#define PWR_CR1_FLS_WUPT_1                        (0x2UL<<PWR_CR1_FLS_WUPT_Pos)                     /*!< 0x00002000 */
#define PWR_CR1_MR_VSEL_Pos                       (16U)
#define PWR_CR1_MR_VSEL_Msk                       (0x1UL<<PWR_CR1_MR_VSEL_Pos)                      /*!< 0x00010000 */
#define PWR_CR1_MR_VSEL                           PWR_CR1_MR_VSEL_Msk                               
#define PWR_CR1_HSION_CTRL_Pos                    (25U)
#define PWR_CR1_HSION_CTRL_Msk                    (0x1UL<<PWR_CR1_HSION_CTRL_Pos)                   /*!< 0x02000000 */
#define PWR_CR1_HSION_CTRL                        PWR_CR1_HSION_CTRL_Msk                            
#define PWR_CR1_STDBY_MRRDY_WAIT_Pos              (26U)
#define PWR_CR1_STDBY_MRRDY_WAIT_Msk              (0x3UL<<PWR_CR1_STDBY_MRRDY_WAIT_Pos)             /*!< 0x0C000000 */
#define PWR_CR1_STDBY_MRRDY_WAIT                  PWR_CR1_STDBY_MRRDY_WAIT_Msk
#define PWR_CR1_STDBY_MRRDY_WAIT_0                (0x1UL<<PWR_CR1_STDBY_MRRDY_WAIT_Pos)             /*!< 0x04000000 */
#define PWR_CR1_STDBY_MRRDY_WAIT_1                (0x2UL<<PWR_CR1_STDBY_MRRDY_WAIT_Pos)             /*!< 0x08000000 */

/********************************* Bit definition for PWR_CR2 register **********************************************/
#define PWR_CR2_PVDE_Pos                          (0U)
#define PWR_CR2_PVDE_Msk                          (0x1UL<<PWR_CR2_PVDE_Pos)                         /*!< 0x00000001 */
#define PWR_CR2_PVDE                              PWR_CR2_PVDE_Msk                                  
#define PWR_CR2_PVDT_Pos                          (1U)
#define PWR_CR2_PVDT_Msk                          (0x7UL<<PWR_CR2_PVDT_Pos)                         /*!< 0x0000000E */
#define PWR_CR2_PVDT                              PWR_CR2_PVDT_Msk
#define PWR_CR2_PVDT_0                            (0x1UL<<PWR_CR2_PVDT_Pos)                         /*!< 0x00000002 */
#define PWR_CR2_PVDT_1                            (0x2UL<<PWR_CR2_PVDT_Pos)                         /*!< 0x00000004 */
#define PWR_CR2_PVDT_2                            (0x4UL<<PWR_CR2_PVDT_Pos)                         /*!< 0x00000008 */
#define PWR_CR2_FLTEN_Pos                         (8U)
#define PWR_CR2_FLTEN_Msk                         (0x1UL<<PWR_CR2_FLTEN_Pos)                        /*!< 0x00000100 */
#define PWR_CR2_FLTEN                             PWR_CR2_FLTEN_Msk                                 
#define PWR_CR2_FLT_CTRL_Pos                      (9U)
#define PWR_CR2_FLT_CTRL_Msk                      (0x7UL<<PWR_CR2_FLT_CTRL_Pos)                     /*!< 0x00000E00 */
#define PWR_CR2_FLT_CTRL                          PWR_CR2_FLT_CTRL_Msk
#define PWR_CR2_FLT_CTRL_0                        (0x1UL<<PWR_CR2_FLT_CTRL_Pos)                     /*!< 0x00000200 */
#define PWR_CR2_FLT_CTRL_1                        (0x2UL<<PWR_CR2_FLT_CTRL_Pos)                     /*!< 0x00000400 */
#define PWR_CR2_FLT_CTRL_2                        (0x4UL<<PWR_CR2_FLT_CTRL_Pos)                     /*!< 0x00000800 */

/********************************* Bit definition for PWR_CR3 register **********************************************/
#define PWR_CR3_EWUPX_Pos                         (0U)
#define PWR_CR3_EWUPX_Msk                         (0x1FUL<<PWR_CR3_EWUPX_Pos)                       /*!< 0x0000001F */
#define PWR_CR3_EWUPX                             PWR_CR3_EWUPX_Msk
#define PWR_CR3_EWUPX_0                           (0x1UL<<PWR_CR3_EWUPX_Pos)                        /*!< 0x00000001 */
#define PWR_CR3_EWUPX_1                           (0x2UL<<PWR_CR3_EWUPX_Pos)                        /*!< 0x00000002 */
#define PWR_CR3_EWUPX_2                           (0x4UL<<PWR_CR3_EWUPX_Pos)                        /*!< 0x00000004 */
#define PWR_CR3_EWUPX_3                           (0x8UL<<PWR_CR3_EWUPX_Pos)                        /*!< 0x00000008 */
#define PWR_CR3_EWUPX_4                           (0x10UL<<PWR_CR3_EWUPX_Pos)                       /*!< 0x00000010 */
#define PWR_CR3_RRS_Pos                           (16U)
#define PWR_CR3_RRS_Msk                           (0x1UL<<PWR_CR3_RRS_Pos)                          /*!< 0x00010000 */
#define PWR_CR3_RRS                               PWR_CR3_RRS_Msk                                   

/********************************* Bit definition for PWR_CR4 register **********************************************/
#define PWR_CR4_WUPX_Pos                          (0U)
#define PWR_CR4_WUPX_Msk                          (0x3FFUL<<PWR_CR4_WUPX_Pos)                       /*!< 0x000003FF */
#define PWR_CR4_WUPX                              PWR_CR4_WUPX_Msk

/********************************* Bit definition for PWR_SR register ***********************************************/
#define PWR_SR_WUFX_Pos                           (0U)
#define PWR_SR_WUFX_Msk                           (0x1FUL<<PWR_SR_WUFX_Pos)                         /*!< 0x0000001F */
#define PWR_SR_WUFX                               PWR_SR_WUFX_Msk
#define PWR_SR_WUFX_0                             (0x1UL<<PWR_SR_WUFX_Pos)                          /*!< 0x00000001 */
#define PWR_SR_WUFX_1                             (0x2UL<<PWR_SR_WUFX_Pos)                          /*!< 0x00000002 */
#define PWR_SR_WUFX_2                             (0x4UL<<PWR_SR_WUFX_Pos)                          /*!< 0x00000004 */
#define PWR_SR_WUFX_3                             (0x8UL<<PWR_SR_WUFX_Pos)                          /*!< 0x00000008 */
#define PWR_SR_WUFX_4                             (0x10UL<<PWR_SR_WUFX_Pos)                         /*!< 0x00000010 */
#define PWR_SR_SBF_Pos                            (16U)
#define PWR_SR_SBF_Msk                            (0x1UL<<PWR_SR_SBF_Pos)                           /*!< 0x00010000 */
#define PWR_SR_SBF                                PWR_SR_SBF_Msk                                    
#define PWR_SR_PVDO_Pos                           (22U)
#define PWR_SR_PVDO_Msk                           (0x1UL<<PWR_SR_PVDO_Pos)                          /*!< 0x00400000 */
#define PWR_SR_PVDO                               PWR_SR_PVDO_Msk                                   
#define PWR_SR_MR_RDY_Pos                         (23U)
#define PWR_SR_MR_RDY_Msk                         (0x1UL<<PWR_SR_MR_RDY_Pos)                        /*!< 0x00800000 */
#define PWR_SR_MR_RDY                             PWR_SR_MR_RDY_Msk                                 

