breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for PWR_SCR register **********************************************/
#define PWR_SCR_CWUFX_Pos                         (0U)
#define PWR_SCR_CWUFX_Msk                         (0x1FUL<<PWR_SCR_CWUFX_Pos)                       /*!< 0x0000001F */
#define PWR_SCR_CWUFX                             PWR_SCR_CWUFX_Msk
#define PWR_SCR_CWUFX_0                           (0x1UL<<PWR_SCR_CWUFX_Pos)                        /*!< 0x00000001 */
#define PWR_SCR_CWUFX_1                           (0x2UL<<PWR_SCR_CWUFX_Pos)                        /*!< 0x00000002 */
#define PWR_SCR_CWUFX_2                           (0x4UL<<PWR_SCR_CWUFX_Pos)                        /*!< 0x00000004 */
#define PWR_SCR_CWUFX_3                           (0x8UL<<PWR_SCR_CWUFX_Pos)                        /*!< 0x00000008 */
#define PWR_SCR_CWUFX_4                           (0x10UL<<PWR_SCR_CWUFX_Pos)                       /*!< 0x00000010 */
#define PWR_SCR_CSBF_Pos                          (16U)
#define PWR_SCR_CSBF_Msk                          (0x1UL<<PWR_SCR_CSBF_Pos)                         /*!< 0x00010000 */
#define PWR_SCR_CSBF                              PWR_SCR_CSBF_Msk                                  

/********************************************************************************************************************/
/********************************* HRPWMC ***************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for HRPWMC_IXBSEL1_2 register *************************************/
#define HRPWMC_IXBSEL1_2_SEL1_Pos                 (0U)
#define HRPWMC_IXBSEL1_2_SEL1_Msk                 (0x3FUL<<HRPWMC_IXBSEL1_2_SEL1_Pos)               /*!< 0x0000003F */
#define HRPWMC_IXBSEL1_2_SEL1                     HRPWMC_IXBSEL1_2_SEL1_Msk                         /*!< eallow, inputxbar_lock */
#define HRPWMC_IXBSEL1_2_SEL1_0                   (0x1UL<<HRPWMC_IXBSEL1_2_SEL1_Pos)                /*!< 0x00000001 */
#define HRPWMC_IXBSEL1_2_SEL1_1                   (0x2UL<<HRPWMC_IXBSEL1_2_SEL1_Pos)                /*!< 0x00000002 */
#define HRPWMC_IXBSEL1_2_SEL1_2                   (0x4UL<<HRPWMC_IXBSEL1_2_SEL1_Pos)                /*!< 0x00000004 */
#define HRPWMC_IXBSEL1_2_SEL1_3                   (0x8UL<<HRPWMC_IXBSEL1_2_SEL1_Pos)                /*!< 0x00000008 */
#define HRPWMC_IXBSEL1_2_SEL1_4                   (0x10UL<<HRPWMC_IXBSEL1_2_SEL1_Pos)               /*!< 0x00000010 */
#define HRPWMC_IXBSEL1_2_SEL1_5                   (0x20UL<<HRPWMC_IXBSEL1_2_SEL1_Pos)               /*!< 0x00000020 */
#define HRPWMC_IXBSEL1_2_SEL2_Pos                 (16U)
#define HRPWMC_IXBSEL1_2_SEL2_Msk                 (0x3FUL<<HRPWMC_IXBSEL1_2_SEL2_Pos)               /*!< 0x003F0000 */
#define HRPWMC_IXBSEL1_2_SEL2                     HRPWMC_IXBSEL1_2_SEL2_Msk                         /*!< eallow, inputxbar_lock */
#define HRPWMC_IXBSEL1_2_SEL2_0                   (0x1UL<<HRPWMC_IXBSEL1_2_SEL2_Pos)                /*!< 0x00010000 */
#define HRPWMC_IXBSEL1_2_SEL2_1                   (0x2UL<<HRPWMC_IXBSEL1_2_SEL2_Pos)                /*!< 0x00020000 */
#define HRPWMC_IXBSEL1_2_SEL2_2                   (0x4UL<<HRPWMC_IXBSEL1_2_SEL2_Pos)                /*!< 0x00040000 */
#define HRPWMC_IXBSEL1_2_SEL2_3                   (0x8UL<<HRPWMC_IXBSEL1_2_SEL2_Pos)                /*!< 0x00080000 */
#define HRPWMC_IXBSEL1_2_SEL2_4                   (0x10UL<<HRPWMC_IXBSEL1_2_SEL2_Pos)               /*!< 0x00100000 */
#define HRPWMC_IXBSEL1_2_SEL2_5                   (0x20UL<<HRPWMC_IXBSEL1_2_SEL2_Pos)               /*!< 0x00200000 */

/********************************* Bit definition for HRPWMC_IXBSEL3_4 register *************************************/
#define HRPWMC_IXBSEL3_4_SEL3_Pos                 (0U)
#define HRPWMC_IXBSEL3_4_SEL3_Msk                 (0x3FUL<<HRPWMC_IXBSEL3_4_SEL3_Pos)               /*!< 0x0000003F */
#define HRPWMC_IXBSEL3_4_SEL3                     HRPWMC_IXBSEL3_4_SEL3_Msk                         /*!< eallow, inputxbar_lock */
#define HRPWMC_IXBSEL3_4_SEL3_0                   (0x1UL<<HRPWMC_IXBSEL3_4_SEL3_Pos)                /*!< 0x00000001 */
#define HRPWMC_IXBSEL3_4_SEL3_1                   (0x2UL<<HRPWMC_IXBSEL3_4_SEL3_Pos)                /*!< 0x00000002 */
#define HRPWMC_IXBSEL3_4_SEL3_2                   (0x4UL<<HRPWMC_IXBSEL3_4_SEL3_Pos)                /*!< 0x00000004 */
#define HRPWMC_IXBSEL3_4_SEL3_3                   (0x8UL<<HRPWMC_IXBSEL3_4_SEL3_Pos)                /*!< 0x00000008 */
#define HRPWMC_IXBSEL3_4_SEL3_4                   (0x10UL<<HRPWMC_IXBSEL3_4_SEL3_Pos)               /*!< 0x00000010 */
#define HRPWMC_IXBSEL3_4_SEL3_5                   (0x20UL<<HRPWMC_IXBSEL3_4_SEL3_Pos)               /*!< 0x00000020 */
#define HRPWMC_IXBSEL3_4_SEL4_Pos                 (16U)
#define HRPWMC_IXBSEL3_4_SEL4_Msk                 (0x3FUL<<HRPWMC_IXBSEL3_4_SEL4_Pos)               /*!< 0x003F0000 */
#define HRPWMC_IXBSEL3_4_SEL4                     HRPWMC_IXBSEL3_4_SEL4_Msk                         /*!< eallow, inputxbar_lock */
#define HRPWMC_IXBSEL3_4_SEL4_0                   (0x1UL<<HRPWMC_IXBSEL3_4_SEL4_Pos)                /*!< 0x00010000 */
#define HRPWMC_IXBSEL3_4_SEL4_1                   (0x2UL<<HRPWMC_IXBSEL3_4_SEL4_Pos)                /*!< 0x00020000 */
#define HRPWMC_IXBSEL3_4_SEL4_2                   (0x4UL<<HRPWMC_IXBSEL3_4_SEL4_Pos)                /*!< 0x00040000 */
#define HRPWMC_IXBSEL3_4_SEL4_3                   (0x8UL<<HRPWMC_IXBSEL3_4_SEL4_Pos)                /*!< 0x00080000 */
#define HRPWMC_IXBSEL3_4_SEL4_4                   (0x10UL<<HRPWMC_IXBSEL3_4_SEL4_Pos)               /*!< 0x00100000 */
#define HRPWMC_IXBSEL3_4_SEL4_5                   (0x20UL<<HRPWMC_IXBSEL3_4_SEL4_Pos)               /*!< 0x00200000 */

/********************************* Bit definition for HRPWMC_IXBSEL5_6 register *************************************/
#define HRPWMC_IXBSEL5_6_SEL5_Pos                 (0U)
#define HRPWMC_IXBSEL5_6_SEL5_Msk                 (0x3FUL<<HRPWMC_IXBSEL5_6_SEL5_Pos)               /*!< 0x0000003F */
#define HRPWMC_IXBSEL5_6_SEL5                     HRPWMC_IXBSEL5_6_SEL5_Msk                         /*!< eallow, inputxbar_lock */
#define HRPWMC_IXBSEL5_6_SEL5_0                   (0x1UL<<HRPWMC_IXBSEL5_6_SEL5_Pos)                /*!< 0x00000001 */
#define HRPWMC_IXBSEL5_6_SEL5_1                   (0x2UL<<HRPWMC_IXBSEL5_6_SEL5_Pos)                /*!< 0x00000002 */
#define HRPWMC_IXBSEL5_6_SEL5_2                   (0x4UL<<HRPWMC_IXBSEL5_6_SEL5_Pos)                /*!< 0x00000004 */
#define HRPWMC_IXBSEL5_6_SEL5_3                   (0x8UL<<HRPWMC_IXBSEL5_6_SEL5_Pos)                /*!< 0x00000008 */
#define HRPWMC_IXBSEL5_6_SEL5_4                   (0x10UL<<HRPWMC_IXBSEL5_6_SEL5_Pos)               /*!< 0x00000010 */
#define HRPWMC_IXBSEL5_6_SEL5_5                   (0x20UL<<HRPWMC_IXBSEL5_6_SEL5_Pos)               /*!< 0x00000020 */
#define HRPWMC_IXBSEL5_6_SEL6_Pos                 (16U)
#define HRPWMC_IXBSEL5_6_SEL6_Msk                 (0x3FUL<<HRPWMC_IXBSEL5_6_SEL6_Pos)               /*!< 0x003F0000 */
#define HRPWMC_IXBSEL5_6_SEL6                     HRPWMC_IXBSEL5_6_SEL6_Msk                         /*!< eallow, inputxbar_lock */
#define HRPWMC_IXBSEL5_6_SEL6_0                   (0x1UL<<HRPWMC_IXBSEL5_6_SEL6_Pos)                /*!< 0x00010000 */
#define HRPWMC_IXBSEL5_6_SEL6_1                   (0x2UL<<HRPWMC_IXBSEL5_6_SEL6_Pos)                /*!< 0x00020000 */
#define HRPWMC_IXBSEL5_6_SEL6_2                   (0x4UL<<HRPWMC_IXBSEL5_6_SEL6_Pos)                /*!< 0x00040000 */
#define HRPWMC_IXBSEL5_6_SEL6_3                   (0x8UL<<HRPWMC_IXBSEL5_6_SEL6_Pos)                /*!< 0x00080000 */
#define HRPWMC_IXBSEL5_6_SEL6_4                   (0x10UL<<HRPWMC_IXBSEL5_6_SEL6_Pos)               /*!< 0x00100000 */
#define HRPWMC_IXBSEL5_6_SEL6_5                   (0x20UL<<HRPWMC_IXBSEL5_6_SEL6_Pos)               /*!< 0x00200000 */

