breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for HRPWMC_IXBSEL7_8 register *************************************/
#define HRPWMC_IXBSEL7_8_SEL7_Pos                 (0U)
#define HRPWMC_IXBSEL7_8_SEL7_Msk                 (0x3FUL<<HRPWMC_IXBSEL7_8_SEL7_Pos)               /*!< 0x0000003F */
#define HRPWMC_IXBSEL7_8_SEL7                     HRPWMC_IXBSEL7_8_SEL7_Msk                         /*!< eallow, inputxbar_lock */
#define HRPWMC_IXBSEL7_8_SEL7_0                   (0x1UL<<HRPWMC_IXBSEL7_8_SEL7_Pos)                /*!< 0x00000001 */
#define HRPWMC_IXBSEL7_8_SEL7_1                   (0x2UL<<HRPWMC_IXBSEL7_8_SEL7_Pos)                /*!< 0x00000002 */
#define HRPWMC_IXBSEL7_8_SEL7_2                   (0x4UL<<HRPWMC_IXBSEL7_8_SEL7_Pos)                /*!< 0x00000004 */
#define HRPWMC_IXBSEL7_8_SEL7_3                   (0x8UL<<HRPWMC_IXBSEL7_8_SEL7_Pos)                /*!< 0x00000008 */
#define HRPWMC_IXBSEL7_8_SEL7_4                   (0x10UL<<HRPWMC_IXBSEL7_8_SEL7_Pos)               /*!< 0x00000010 */
#define HRPWMC_IXBSEL7_8_SEL7_5                   (0x20UL<<HRPWMC_IXBSEL7_8_SEL7_Pos)               /*!< 0x00000020 */
#define HRPWMC_IXBSEL7_8_SEL8_Pos                 (16U)
#define HRPWMC_IXBSEL7_8_SEL8_Msk                 (0x3FUL<<HRPWMC_IXBSEL7_8_SEL8_Pos)               /*!< 0x003F0000 */
#define HRPWMC_IXBSEL7_8_SEL8                     HRPWMC_IXBSEL7_8_SEL8_Msk                         /*!< eallow, inputxbar_lock */
#define HRPWMC_IXBSEL7_8_SEL8_0                   (0x1UL<<HRPWMC_IXBSEL7_8_SEL8_Pos)                /*!< 0x00010000 */
#define HRPWMC_IXBSEL7_8_SEL8_1                   (0x2UL<<HRPWMC_IXBSEL7_8_SEL8_Pos)                /*!< 0x00020000 */
#define HRPWMC_IXBSEL7_8_SEL8_2                   (0x4UL<<HRPWMC_IXBSEL7_8_SEL8_Pos)                /*!< 0x00040000 */
#define HRPWMC_IXBSEL7_8_SEL8_3                   (0x8UL<<HRPWMC_IXBSEL7_8_SEL8_Pos)                /*!< 0x00080000 */
#define HRPWMC_IXBSEL7_8_SEL8_4                   (0x10UL<<HRPWMC_IXBSEL7_8_SEL8_Pos)               /*!< 0x00100000 */
#define HRPWMC_IXBSEL7_8_SEL8_5                   (0x20UL<<HRPWMC_IXBSEL7_8_SEL8_Pos)               /*!< 0x00200000 */

/********************************* Bit definition for HRPWMC_IXBSEL9_10 register ************************************/
#define HRPWMC_IXBSEL9_10_SEL9_Pos                (0U)
#define HRPWMC_IXBSEL9_10_SEL9_Msk                (0x3FUL<<HRPWMC_IXBSEL9_10_SEL9_Pos)              /*!< 0x0000003F */
#define HRPWMC_IXBSEL9_10_SEL9                    HRPWMC_IXBSEL9_10_SEL9_Msk                        /*!< eallow, inputxbar_lock */
#define HRPWMC_IXBSEL9_10_SEL9_0                  (0x1UL<<HRPWMC_IXBSEL9_10_SEL9_Pos)               /*!< 0x00000001 */
#define HRPWMC_IXBSEL9_10_SEL9_1                  (0x2UL<<HRPWMC_IXBSEL9_10_SEL9_Pos)               /*!< 0x00000002 */
#define HRPWMC_IXBSEL9_10_SEL9_2                  (0x4UL<<HRPWMC_IXBSEL9_10_SEL9_Pos)               /*!< 0x00000004 */
#define HRPWMC_IXBSEL9_10_SEL9_3                  (0x8UL<<HRPWMC_IXBSEL9_10_SEL9_Pos)               /*!< 0x00000008 */
#define HRPWMC_IXBSEL9_10_SEL9_4                  (0x10UL<<HRPWMC_IXBSEL9_10_SEL9_Pos)              /*!< 0x00000010 */
#define HRPWMC_IXBSEL9_10_SEL9_5                  (0x20UL<<HRPWMC_IXBSEL9_10_SEL9_Pos)              /*!< 0x00000020 */
#define HRPWMC_IXBSEL9_10_SEL10_Pos               (16U)
#define HRPWMC_IXBSEL9_10_SEL10_Msk               (0x3FUL<<HRPWMC_IXBSEL9_10_SEL10_Pos)             /*!< 0x003F0000 */
#define HRPWMC_IXBSEL9_10_SEL10                   HRPWMC_IXBSEL9_10_SEL10_Msk                       /*!< eallow, inputxbar_lock */
#define HRPWMC_IXBSEL9_10_SEL10_0                 (0x1UL<<HRPWMC_IXBSEL9_10_SEL10_Pos)              /*!< 0x00010000 */
#define HRPWMC_IXBSEL9_10_SEL10_1                 (0x2UL<<HRPWMC_IXBSEL9_10_SEL10_Pos)              /*!< 0x00020000 */
#define HRPWMC_IXBSEL9_10_SEL10_2                 (0x4UL<<HRPWMC_IXBSEL9_10_SEL10_Pos)              /*!< 0x00040000 */
#define HRPWMC_IXBSEL9_10_SEL10_3                 (0x8UL<<HRPWMC_IXBSEL9_10_SEL10_Pos)              /*!< 0x00080000 */
#define HRPWMC_IXBSEL9_10_SEL10_4                 (0x10UL<<HRPWMC_IXBSEL9_10_SEL10_Pos)             /*!< 0x00100000 */
#define HRPWMC_IXBSEL9_10_SEL10_5                 (0x20UL<<HRPWMC_IXBSEL9_10_SEL10_Pos)             /*!< 0x00200000 */

/********************************* Bit definition for HRPWMC_IXBSEL11_12 register ***********************************/
#define HRPWMC_IXBSEL11_12_SEL11_Pos              (0U)
#define HRPWMC_IXBSEL11_12_SEL11_Msk              (0x3FUL<<HRPWMC_IXBSEL11_12_SEL11_Pos)            /*!< 0x0000003F */
#define HRPWMC_IXBSEL11_12_SEL11                  HRPWMC_IXBSEL11_12_SEL11_Msk                      /*!< eallow, inputxbar_lock */
#define HRPWMC_IXBSEL11_12_SEL11_0                (0x1UL<<HRPWMC_IXBSEL11_12_SEL11_Pos)             /*!< 0x00000001 */
#define HRPWMC_IXBSEL11_12_SEL11_1                (0x2UL<<HRPWMC_IXBSEL11_12_SEL11_Pos)             /*!< 0x00000002 */
#define HRPWMC_IXBSEL11_12_SEL11_2                (0x4UL<<HRPWMC_IXBSEL11_12_SEL11_Pos)             /*!< 0x00000004 */
#define HRPWMC_IXBSEL11_12_SEL11_3                (0x8UL<<HRPWMC_IXBSEL11_12_SEL11_Pos)             /*!< 0x00000008 */
#define HRPWMC_IXBSEL11_12_SEL11_4                (0x10UL<<HRPWMC_IXBSEL11_12_SEL11_Pos)            /*!< 0x00000010 */
#define HRPWMC_IXBSEL11_12_SEL11_5                (0x20UL<<HRPWMC_IXBSEL11_12_SEL11_Pos)            /*!< 0x00000020 */
#define HRPWMC_IXBSEL11_12_SEL12_Pos              (16U)
#define HRPWMC_IXBSEL11_12_SEL12_Msk              (0x3FUL<<HRPWMC_IXBSEL11_12_SEL12_Pos)            /*!< 0x003F0000 */
#define HRPWMC_IXBSEL11_12_SEL12                  HRPWMC_IXBSEL11_12_SEL12_Msk                      /*!< eallow, inputxbar_lock */
#define HRPWMC_IXBSEL11_12_SEL12_0                (0x1UL<<HRPWMC_IXBSEL11_12_SEL12_Pos)             /*!< 0x00010000 */
#define HRPWMC_IXBSEL11_12_SEL12_1                (0x2UL<<HRPWMC_IXBSEL11_12_SEL12_Pos)             /*!< 0x00020000 */
#define HRPWMC_IXBSEL11_12_SEL12_2                (0x4UL<<HRPWMC_IXBSEL11_12_SEL12_Pos)             /*!< 0x00040000 */
#define HRPWMC_IXBSEL11_12_SEL12_3                (0x8UL<<HRPWMC_IXBSEL11_12_SEL12_Pos)             /*!< 0x00080000 */
#define HRPWMC_IXBSEL11_12_SEL12_4                (0x10UL<<HRPWMC_IXBSEL11_12_SEL12_Pos)            /*!< 0x00100000 */
#define HRPWMC_IXBSEL11_12_SEL12_5                (0x20UL<<HRPWMC_IXBSEL11_12_SEL12_Pos)            /*!< 0x00200000 */

/********************************* Bit definition for HRPWMC_IXBSEL13_14 register ***********************************/
#define HRPWMC_IXBSEL13_14_SEL13_Pos              (0U)
#define HRPWMC_IXBSEL13_14_SEL13_Msk              (0x3FUL<<HRPWMC_IXBSEL13_14_SEL13_Pos)            /*!< 0x0000003F */
#define HRPWMC_IXBSEL13_14_SEL13                  HRPWMC_IXBSEL13_14_SEL13_Msk                      /*!< eallow, inputxbar_lock */
#define HRPWMC_IXBSEL13_14_SEL13_0                (0x1UL<<HRPWMC_IXBSEL13_14_SEL13_Pos)             /*!< 0x00000001 */
#define HRPWMC_IXBSEL13_14_SEL13_1                (0x2UL<<HRPWMC_IXBSEL13_14_SEL13_Pos)             /*!< 0x00000002 */
#define HRPWMC_IXBSEL13_14_SEL13_2                (0x4UL<<HRPWMC_IXBSEL13_14_SEL13_Pos)             /*!< 0x00000004 */
#define HRPWMC_IXBSEL13_14_SEL13_3                (0x8UL<<HRPWMC_IXBSEL13_14_SEL13_Pos)             /*!< 0x00000008 */
#define HRPWMC_IXBSEL13_14_SEL13_4                (0x10UL<<HRPWMC_IXBSEL13_14_SEL13_Pos)            /*!< 0x00000010 */
#define HRPWMC_IXBSEL13_14_SEL13_5                (0x20UL<<HRPWMC_IXBSEL13_14_SEL13_Pos)            /*!< 0x00000020 */
#define HRPWMC_IXBSEL13_14_SEL14_Pos              (16U)
#define HRPWMC_IXBSEL13_14_SEL14_Msk              (0x3FUL<<HRPWMC_IXBSEL13_14_SEL14_Pos)            /*!< 0x003F0000 */
#define HRPWMC_IXBSEL13_14_SEL14                  HRPWMC_IXBSEL13_14_SEL14_Msk                      /*!< eallow, inputxbar_lock */
#define HRPWMC_IXBSEL13_14_SEL14_0                (0x1UL<<HRPWMC_IXBSEL13_14_SEL14_Pos)             /*!< 0x00010000 */
#define HRPWMC_IXBSEL13_14_SEL14_1                (0x2UL<<HRPWMC_IXBSEL13_14_SEL14_Pos)             /*!< 0x00020000 */
#define HRPWMC_IXBSEL13_14_SEL14_2                (0x4UL<<HRPWMC_IXBSEL13_14_SEL14_Pos)             /*!< 0x00040000 */
#define HRPWMC_IXBSEL13_14_SEL14_3                (0x8UL<<HRPWMC_IXBSEL13_14_SEL14_Pos)             /*!< 0x00080000 */
#define HRPWMC_IXBSEL13_14_SEL14_4                (0x10UL<<HRPWMC_IXBSEL13_14_SEL14_Pos)            /*!< 0x00100000 */
#define HRPWMC_IXBSEL13_14_SEL14_5                (0x20UL<<HRPWMC_IXBSEL13_14_SEL14_Pos)            /*!< 0x00200000 */

/********************************* Bit definition for HRPWMC_IXBAQSEL register **************************************/
#define HRPWMC_IXBAQSEL_AQSEL1_Pos                (0U)
#define HRPWMC_IXBAQSEL_AQSEL1_Msk                (0x3UL<<HRPWMC_IXBAQSEL_AQSEL1_Pos)               /*!< 0x00000003 */
#define HRPWMC_IXBAQSEL_AQSEL1                    HRPWMC_IXBAQSEL_AQSEL1_Msk                        /*!< eallow, lock_fl */
#define HRPWMC_IXBAQSEL_AQSEL1_0                  (0x1UL<<HRPWMC_IXBAQSEL_AQSEL1_Pos)               /*!< 0x00000001 */
#define HRPWMC_IXBAQSEL_AQSEL1_1                  (0x2UL<<HRPWMC_IXBAQSEL_AQSEL1_Pos)               /*!< 0x00000002 */
#define HRPWMC_IXBAQSEL_AQSEL2_Pos                (2U)
#define HRPWMC_IXBAQSEL_AQSEL2_Msk                (0x3UL<<HRPWMC_IXBAQSEL_AQSEL2_Pos)               /*!< 0x0000000C */
#define HRPWMC_IXBAQSEL_AQSEL2                    HRPWMC_IXBAQSEL_AQSEL2_Msk                        /*!< eallow, lock_fl */
#define HRPWMC_IXBAQSEL_AQSEL2_0                  (0x1UL<<HRPWMC_IXBAQSEL_AQSEL2_Pos)               /*!< 0x00000004 */
#define HRPWMC_IXBAQSEL_AQSEL2_1                  (0x2UL<<HRPWMC_IXBAQSEL_AQSEL2_Pos)               /*!< 0x00000008 */
#define HRPWMC_IXBAQSEL_AQSEL3_Pos                (4U)
#define HRPWMC_IXBAQSEL_AQSEL3_Msk                (0x3UL<<HRPWMC_IXBAQSEL_AQSEL3_Pos)               /*!< 0x00000030 */
#define HRPWMC_IXBAQSEL_AQSEL3                    HRPWMC_IXBAQSEL_AQSEL3_Msk                        /*!< eallow, lock_fl */
#define HRPWMC_IXBAQSEL_AQSEL3_0                  (0x1UL<<HRPWMC_IXBAQSEL_AQSEL3_Pos)               /*!< 0x00000010 */
#define HRPWMC_IXBAQSEL_AQSEL3_1                  (0x2UL<<HRPWMC_IXBAQSEL_AQSEL3_Pos)               /*!< 0x00000020 */
#define HRPWMC_IXBAQSEL_AQSEL4_Pos                (6U)
#define HRPWMC_IXBAQSEL_AQSEL4_Msk                (0x3UL<<HRPWMC_IXBAQSEL_AQSEL4_Pos)               /*!< 0x000000C0 */
#define HRPWMC_IXBAQSEL_AQSEL4                    HRPWMC_IXBAQSEL_AQSEL4_Msk                        /*!< eallow, lock_fl */
#define HRPWMC_IXBAQSEL_AQSEL4_0                  (0x1UL<<HRPWMC_IXBAQSEL_AQSEL4_Pos)               /*!< 0x00000040 */
#define HRPWMC_IXBAQSEL_AQSEL4_1                  (0x2UL<<HRPWMC_IXBAQSEL_AQSEL4_Pos)               /*!< 0x00000080 */
#define HRPWMC_IXBAQSEL_AQSEL5_Pos                (8U)
#define HRPWMC_IXBAQSEL_AQSEL5_Msk                (0x3UL<<HRPWMC_IXBAQSEL_AQSEL5_Pos)               /*!< 0x00000300 */
#define HRPWMC_IXBAQSEL_AQSEL5                    HRPWMC_IXBAQSEL_AQSEL5_Msk                        /*!< eallow, lock_fl */
#define HRPWMC_IXBAQSEL_AQSEL5_0                  (0x1UL<<HRPWMC_IXBAQSEL_AQSEL5_Pos)               /*!< 0x00000100 */
#define HRPWMC_IXBAQSEL_AQSEL5_1                  (0x2UL<<HRPWMC_IXBAQSEL_AQSEL5_Pos)               /*!< 0x00000200 */
#define HRPWMC_IXBAQSEL_AQSEL6_Pos                (10U)
#define HRPWMC_IXBAQSEL_AQSEL6_Msk                (0x3UL<<HRPWMC_IXBAQSEL_AQSEL6_Pos)               /*!< 0x00000C00 */
#define HRPWMC_IXBAQSEL_AQSEL6                    HRPWMC_IXBAQSEL_AQSEL6_Msk                        /*!< eallow, lock_fl */
#define HRPWMC_IXBAQSEL_AQSEL6_0                  (0x1UL<<HRPWMC_IXBAQSEL_AQSEL6_Pos)               /*!< 0x00000400 */
#define HRPWMC_IXBAQSEL_AQSEL6_1                  (0x2UL<<HRPWMC_IXBAQSEL_AQSEL6_Pos)               /*!< 0x00000800 */
#define HRPWMC_IXBAQSEL_AQSEL7_Pos                (12U)
#define HRPWMC_IXBAQSEL_AQSEL7_Msk                (0x3UL<<HRPWMC_IXBAQSEL_AQSEL7_Pos)               /*!< 0x00003000 */
#define HRPWMC_IXBAQSEL_AQSEL7                    HRPWMC_IXBAQSEL_AQSEL7_Msk                        /*!< eallow, lock_fl */
#define HRPWMC_IXBAQSEL_AQSEL7_0                  (0x1UL<<HRPWMC_IXBAQSEL_AQSEL7_Pos)               /*!< 0x00001000 */
#define HRPWMC_IXBAQSEL_AQSEL7_1                  (0x2UL<<HRPWMC_IXBAQSEL_AQSEL7_Pos)               /*!< 0x00002000 */
#define HRPWMC_IXBAQSEL_AQSEL8_Pos                (14U)
#define HRPWMC_IXBAQSEL_AQSEL8_Msk                (0x3UL<<HRPWMC_IXBAQSEL_AQSEL8_Pos)               /*!< 0x0000C000 */
#define HRPWMC_IXBAQSEL_AQSEL8                    HRPWMC_IXBAQSEL_AQSEL8_Msk                        /*!< eallow, lock_fl */
#define HRPWMC_IXBAQSEL_AQSEL8_0                  (0x1UL<<HRPWMC_IXBAQSEL_AQSEL8_Pos)               /*!< 0x00004000 */
#define HRPWMC_IXBAQSEL_AQSEL8_1                  (0x2UL<<HRPWMC_IXBAQSEL_AQSEL8_Pos)               /*!< 0x00008000 */
#define HRPWMC_IXBAQSEL_AQSEL9_Pos                (16U)
#define HRPWMC_IXBAQSEL_AQSEL9_Msk                (0x3UL<<HRPWMC_IXBAQSEL_AQSEL9_Pos)               /*!< 0x00030000 */
#define HRPWMC_IXBAQSEL_AQSEL9                    HRPWMC_IXBAQSEL_AQSEL9_Msk                        /*!< eallow, lock_fl */
#define HRPWMC_IXBAQSEL_AQSEL9_0                  (0x1UL<<HRPWMC_IXBAQSEL_AQSEL9_Pos)               /*!< 0x00010000 */
#define HRPWMC_IXBAQSEL_AQSEL9_1                  (0x2UL<<HRPWMC_IXBAQSEL_AQSEL9_Pos)               /*!< 0x00020000 */
#define HRPWMC_IXBAQSEL_AQSEL10_Pos               (18U)
#define HRPWMC_IXBAQSEL_AQSEL10_Msk               (0x3UL<<HRPWMC_IXBAQSEL_AQSEL10_Pos)              /*!< 0x000C0000 */
#define HRPWMC_IXBAQSEL_AQSEL10                   HRPWMC_IXBAQSEL_AQSEL10_Msk                       /*!< eallow, lock_fl */
#define HRPWMC_IXBAQSEL_AQSEL10_0                 (0x1UL<<HRPWMC_IXBAQSEL_AQSEL10_Pos)              /*!< 0x00040000 */
#define HRPWMC_IXBAQSEL_AQSEL10_1                 (0x2UL<<HRPWMC_IXBAQSEL_AQSEL10_Pos)              /*!< 0x00080000 */
#define HRPWMC_IXBAQSEL_AQSEL11_Pos               (20U)
#define HRPWMC_IXBAQSEL_AQSEL11_Msk               (0x3UL<<HRPWMC_IXBAQSEL_AQSEL11_Pos)              /*!< 0x00300000 */
#define HRPWMC_IXBAQSEL_AQSEL11                   HRPWMC_IXBAQSEL_AQSEL11_Msk                       /*!< eallow, lock_fl */
#define HRPWMC_IXBAQSEL_AQSEL11_0                 (0x1UL<<HRPWMC_IXBAQSEL_AQSEL11_Pos)              /*!< 0x00100000 */
#define HRPWMC_IXBAQSEL_AQSEL11_1                 (0x2UL<<HRPWMC_IXBAQSEL_AQSEL11_Pos)              /*!< 0x00200000 */
#define HRPWMC_IXBAQSEL_AQSEL12_Pos               (22U)
#define HRPWMC_IXBAQSEL_AQSEL12_Msk               (0x3UL<<HRPWMC_IXBAQSEL_AQSEL12_Pos)              /*!< 0x00C00000 */
#define HRPWMC_IXBAQSEL_AQSEL12                   HRPWMC_IXBAQSEL_AQSEL12_Msk                       /*!< eallow, lock_fl */
#define HRPWMC_IXBAQSEL_AQSEL12_0                 (0x1UL<<HRPWMC_IXBAQSEL_AQSEL12_Pos)              /*!< 0x00400000 */
#define HRPWMC_IXBAQSEL_AQSEL12_1                 (0x2UL<<HRPWMC_IXBAQSEL_AQSEL12_Pos)              /*!< 0x00800000 */
#define HRPWMC_IXBAQSEL_AQSEL13_Pos               (24U)
#define HRPWMC_IXBAQSEL_AQSEL13_Msk               (0x3UL<<HRPWMC_IXBAQSEL_AQSEL13_Pos)              /*!< 0x03000000 */
#define HRPWMC_IXBAQSEL_AQSEL13                   HRPWMC_IXBAQSEL_AQSEL13_Msk                       /*!< eallow, lock_fl */
#define HRPWMC_IXBAQSEL_AQSEL13_0                 (0x1UL<<HRPWMC_IXBAQSEL_AQSEL13_Pos)              /*!< 0x01000000 */
#define HRPWMC_IXBAQSEL_AQSEL13_1                 (0x2UL<<HRPWMC_IXBAQSEL_AQSEL13_Pos)              /*!< 0x02000000 */
#define HRPWMC_IXBAQSEL_AQSEL14_Pos               (26U)
#define HRPWMC_IXBAQSEL_AQSEL14_Msk               (0x3UL<<HRPWMC_IXBAQSEL_AQSEL14_Pos)              /*!< 0x0C000000 */
#define HRPWMC_IXBAQSEL_AQSEL14                   HRPWMC_IXBAQSEL_AQSEL14_Msk                       /*!< eallow, lock_fl */
#define HRPWMC_IXBAQSEL_AQSEL14_0                 (0x1UL<<HRPWMC_IXBAQSEL_AQSEL14_Pos)              /*!< 0x04000000 */
#define HRPWMC_IXBAQSEL_AQSEL14_1                 (0x2UL<<HRPWMC_IXBAQSEL_AQSEL14_Pos)              /*!< 0x08000000 */

/********************************* Bit definition for HRPWMC_IXBSEL_LOCK register ***********************************/
#define HRPWMC_IXBSEL_LOCK_LOCK1_Pos              (0U)
#define HRPWMC_IXBSEL_LOCK_LOCK1_Msk              (0x1UL<<HRPWMC_IXBSEL_LOCK_LOCK1_Pos)             /*!< 0x00000001 */
#define HRPWMC_IXBSEL_LOCK_LOCK1                  HRPWMC_IXBSEL_LOCK_LOCK1_Msk                      /*!< eallow */
#define HRPWMC_IXBSEL_LOCK_LOCK2_Pos              (1U)
#define HRPWMC_IXBSEL_LOCK_LOCK2_Msk              (0x1UL<<HRPWMC_IXBSEL_LOCK_LOCK2_Pos)             /*!< 0x00000002 */
#define HRPWMC_IXBSEL_LOCK_LOCK2                  HRPWMC_IXBSEL_LOCK_LOCK2_Msk                      /*!< eallow */
#define HRPWMC_IXBSEL_LOCK_LOCK3_Pos              (2U)
#define HRPWMC_IXBSEL_LOCK_LOCK3_Msk              (0x1UL<<HRPWMC_IXBSEL_LOCK_LOCK3_Pos)             /*!< 0x00000004 */
#define HRPWMC_IXBSEL_LOCK_LOCK3                  HRPWMC_IXBSEL_LOCK_LOCK3_Msk                      /*!< eallow */
#define HRPWMC_IXBSEL_LOCK_LOCK4_Pos              (3U)
#define HRPWMC_IXBSEL_LOCK_LOCK4_Msk              (0x1UL<<HRPWMC_IXBSEL_LOCK_LOCK4_Pos)             /*!< 0x00000008 */
#define HRPWMC_IXBSEL_LOCK_LOCK4                  HRPWMC_IXBSEL_LOCK_LOCK4_Msk                      /*!< eallow */
#define HRPWMC_IXBSEL_LOCK_LOCK5_Pos              (4U)
#define HRPWMC_IXBSEL_LOCK_LOCK5_Msk              (0x1UL<<HRPWMC_IXBSEL_LOCK_LOCK5_Pos)             /*!< 0x00000010 */
#define HRPWMC_IXBSEL_LOCK_LOCK5                  HRPWMC_IXBSEL_LOCK_LOCK5_Msk                      /*!< eallow */
#define HRPWMC_IXBSEL_LOCK_LOCK6_Pos              (5U)
#define HRPWMC_IXBSEL_LOCK_LOCK6_Msk              (0x1UL<<HRPWMC_IXBSEL_LOCK_LOCK6_Pos)             /*!< 0x00000020 */
#define HRPWMC_IXBSEL_LOCK_LOCK6                  HRPWMC_IXBSEL_LOCK_LOCK6_Msk                      /*!< eallow */
#define HRPWMC_IXBSEL_LOCK_LOCK7_Pos              (6U)
#define HRPWMC_IXBSEL_LOCK_LOCK7_Msk              (0x1UL<<HRPWMC_IXBSEL_LOCK_LOCK7_Pos)             /*!< 0x00000040 */
#define HRPWMC_IXBSEL_LOCK_LOCK7                  HRPWMC_IXBSEL_LOCK_LOCK7_Msk                      /*!< eallow */
#define HRPWMC_IXBSEL_LOCK_LOCK8_Pos              (7U)
#define HRPWMC_IXBSEL_LOCK_LOCK8_Msk              (0x1UL<<HRPWMC_IXBSEL_LOCK_LOCK8_Pos)             /*!< 0x00000080 */
#define HRPWMC_IXBSEL_LOCK_LOCK8                  HRPWMC_IXBSEL_LOCK_LOCK8_Msk                      /*!< eallow */
#define HRPWMC_IXBSEL_LOCK_LOCK9_Pos              (8U)
#define HRPWMC_IXBSEL_LOCK_LOCK9_Msk              (0x1UL<<HRPWMC_IXBSEL_LOCK_LOCK9_Pos)             /*!< 0x00000100 */
#define HRPWMC_IXBSEL_LOCK_LOCK9                  HRPWMC_IXBSEL_LOCK_LOCK9_Msk                      /*!< eallow */
#define HRPWMC_IXBSEL_LOCK_LOCK10_Pos             (9U)
#define HRPWMC_IXBSEL_LOCK_LOCK10_Msk             (0x1UL<<HRPWMC_IXBSEL_LOCK_LOCK10_Pos)            /*!< 0x00000200 */
#define HRPWMC_IXBSEL_LOCK_LOCK10                 HRPWMC_IXBSEL_LOCK_LOCK10_Msk                     /*!< eallow */
#define HRPWMC_IXBSEL_LOCK_LOCK11_Pos             (10U)
#define HRPWMC_IXBSEL_LOCK_LOCK11_Msk             (0x1UL<<HRPWMC_IXBSEL_LOCK_LOCK11_Pos)            /*!< 0x00000400 */
#define HRPWMC_IXBSEL_LOCK_LOCK11                 HRPWMC_IXBSEL_LOCK_LOCK11_Msk                     /*!< eallow */
#define HRPWMC_IXBSEL_LOCK_LOCK12_Pos             (11U)
#define HRPWMC_IXBSEL_LOCK_LOCK12_Msk             (0x1UL<<HRPWMC_IXBSEL_LOCK_LOCK12_Pos)            /*!< 0x00000800 */
#define HRPWMC_IXBSEL_LOCK_LOCK12                 HRPWMC_IXBSEL_LOCK_LOCK12_Msk                     /*!< eallow */
#define HRPWMC_IXBSEL_LOCK_LOCK13_Pos             (12U)
#define HRPWMC_IXBSEL_LOCK_LOCK13_Msk             (0x1UL<<HRPWMC_IXBSEL_LOCK_LOCK13_Pos)            /*!< 0x00001000 */
#define HRPWMC_IXBSEL_LOCK_LOCK13                 HRPWMC_IXBSEL_LOCK_LOCK13_Msk                     /*!< eallow */
#define HRPWMC_IXBSEL_LOCK_LOCK14_Pos             (13U)
#define HRPWMC_IXBSEL_LOCK_LOCK14_Msk             (0x1UL<<HRPWMC_IXBSEL_LOCK_LOCK14_Pos)            /*!< 0x00002000 */
#define HRPWMC_IXBSEL_LOCK_LOCK14                 HRPWMC_IXBSEL_LOCK_LOCK14_Msk                     /*!< eallow */
#define HRPWMC_IXBSEL_LOCK_LOCK_FL_Pos            (31U)
#define HRPWMC_IXBSEL_LOCK_LOCK_FL_Msk            (0x1UL<<HRPWMC_IXBSEL_LOCK_LOCK_FL_Pos)           /*!< 0x80000000 */
#define HRPWMC_IXBSEL_LOCK_LOCK_FL                HRPWMC_IXBSEL_LOCK_LOCK_FL_Msk                    /*!< eallow */

/********************************* Bit definition for HRPWMC_IXBCTRL register ***************************************/
#define HRPWMC_IXBCTRL_ISAPRD0_Pos                (0U)
#define HRPWMC_IXBCTRL_ISAPRD0_Msk                (0xFFUL<<HRPWMC_IXBCTRL_ISAPRD0_Pos)              /*!< 0x000000FF */
#define HRPWMC_IXBCTRL_ISAPRD0                    HRPWMC_IXBCTRL_ISAPRD0_Msk                        /*!< eallow, lock_fl */
#define HRPWMC_IXBCTRL_ISAPRD1_Pos                (8U)
#define HRPWMC_IXBCTRL_ISAPRD1_Msk                (0xFFUL<<HRPWMC_IXBCTRL_ISAPRD1_Pos)              /*!< 0x0000FF00 */
#define HRPWMC_IXBCTRL_ISAPRD1                    HRPWMC_IXBCTRL_ISAPRD1_Msk                        /*!< eallow, lock_fl */

