breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for HRPWMC_HXB8_0 register ****************************************/
#define HRPWMC_HXB8_0_MUX0_Pos                    (0U)
#define HRPWMC_HXB8_0_MUX0_Msk                    (0x3UL<<HRPWMC_HXB8_0_MUX0_Pos)                   /*!< 0x00000003 */
#define HRPWMC_HXB8_0_MUX0                        HRPWMC_HXB8_0_MUX0_Msk                            /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB8_0_MUX0_0                      (0x1UL<<HRPWMC_HXB8_0_MUX0_Pos)                   /*!< 0x00000001 */
#define HRPWMC_HXB8_0_MUX0_1                      (0x2UL<<HRPWMC_HXB8_0_MUX0_Pos)                   /*!< 0x00000002 */
#define HRPWMC_HXB8_0_MUX1_Pos                    (2U)
#define HRPWMC_HXB8_0_MUX1_Msk                    (0x3UL<<HRPWMC_HXB8_0_MUX1_Pos)                   /*!< 0x0000000C */
#define HRPWMC_HXB8_0_MUX1                        HRPWMC_HXB8_0_MUX1_Msk                            /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB8_0_MUX1_0                      (0x1UL<<HRPWMC_HXB8_0_MUX1_Pos)                   /*!< 0x00000004 */
#define HRPWMC_HXB8_0_MUX1_1                      (0x2UL<<HRPWMC_HXB8_0_MUX1_Pos)                   /*!< 0x00000008 */
#define HRPWMC_HXB8_0_MUX2_Pos                    (4U)
#define HRPWMC_HXB8_0_MUX2_Msk                    (0x3UL<<HRPWMC_HXB8_0_MUX2_Pos)                   /*!< 0x00000030 */
#define HRPWMC_HXB8_0_MUX2                        HRPWMC_HXB8_0_MUX2_Msk                            /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB8_0_MUX2_0                      (0x1UL<<HRPWMC_HXB8_0_MUX2_Pos)                   /*!< 0x00000010 */
#define HRPWMC_HXB8_0_MUX2_1                      (0x2UL<<HRPWMC_HXB8_0_MUX2_Pos)                   /*!< 0x00000020 */
#define HRPWMC_HXB8_0_MUX3_Pos                    (6U)
#define HRPWMC_HXB8_0_MUX3_Msk                    (0x3UL<<HRPWMC_HXB8_0_MUX3_Pos)                   /*!< 0x000000C0 */
#define HRPWMC_HXB8_0_MUX3                        HRPWMC_HXB8_0_MUX3_Msk                            /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB8_0_MUX3_0                      (0x1UL<<HRPWMC_HXB8_0_MUX3_Pos)                   /*!< 0x00000040 */
#define HRPWMC_HXB8_0_MUX3_1                      (0x2UL<<HRPWMC_HXB8_0_MUX3_Pos)                   /*!< 0x00000080 */
#define HRPWMC_HXB8_0_MUX4_Pos                    (8U)
#define HRPWMC_HXB8_0_MUX4_Msk                    (0x3UL<<HRPWMC_HXB8_0_MUX4_Pos)                   /*!< 0x00000300 */
#define HRPWMC_HXB8_0_MUX4                        HRPWMC_HXB8_0_MUX4_Msk                            /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB8_0_MUX4_0                      (0x1UL<<HRPWMC_HXB8_0_MUX4_Pos)                   /*!< 0x00000100 */
#define HRPWMC_HXB8_0_MUX4_1                      (0x2UL<<HRPWMC_HXB8_0_MUX4_Pos)                   /*!< 0x00000200 */
#define HRPWMC_HXB8_0_MUX5_Pos                    (10U)
#define HRPWMC_HXB8_0_MUX5_Msk                    (0x3UL<<HRPWMC_HXB8_0_MUX5_Pos)                   /*!< 0x00000C00 */
#define HRPWMC_HXB8_0_MUX5                        HRPWMC_HXB8_0_MUX5_Msk                            /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB8_0_MUX5_0                      (0x1UL<<HRPWMC_HXB8_0_MUX5_Pos)                   /*!< 0x00000400 */
#define HRPWMC_HXB8_0_MUX5_1                      (0x2UL<<HRPWMC_HXB8_0_MUX5_Pos)                   /*!< 0x00000800 */
#define HRPWMC_HXB8_0_MUX6_Pos                    (12U)
#define HRPWMC_HXB8_0_MUX6_Msk                    (0x3UL<<HRPWMC_HXB8_0_MUX6_Pos)                   /*!< 0x00003000 */
#define HRPWMC_HXB8_0_MUX6                        HRPWMC_HXB8_0_MUX6_Msk                            /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB8_0_MUX6_0                      (0x1UL<<HRPWMC_HXB8_0_MUX6_Pos)                   /*!< 0x00001000 */
#define HRPWMC_HXB8_0_MUX6_1                      (0x2UL<<HRPWMC_HXB8_0_MUX6_Pos)                   /*!< 0x00002000 */
#define HRPWMC_HXB8_0_MUX7_Pos                    (14U)
#define HRPWMC_HXB8_0_MUX7_Msk                    (0x3UL<<HRPWMC_HXB8_0_MUX7_Pos)                   /*!< 0x0000C000 */
#define HRPWMC_HXB8_0_MUX7                        HRPWMC_HXB8_0_MUX7_Msk                            /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB8_0_MUX7_0                      (0x1UL<<HRPWMC_HXB8_0_MUX7_Pos)                   /*!< 0x00004000 */
#define HRPWMC_HXB8_0_MUX7_1                      (0x2UL<<HRPWMC_HXB8_0_MUX7_Pos)                   /*!< 0x00008000 */
#define HRPWMC_HXB8_0_MUX8_Pos                    (16U)
#define HRPWMC_HXB8_0_MUX8_Msk                    (0x3UL<<HRPWMC_HXB8_0_MUX8_Pos)                   /*!< 0x00030000 */
#define HRPWMC_HXB8_0_MUX8                        HRPWMC_HXB8_0_MUX8_Msk                            /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB8_0_MUX8_0                      (0x1UL<<HRPWMC_HXB8_0_MUX8_Pos)                   /*!< 0x00010000 */
#define HRPWMC_HXB8_0_MUX8_1                      (0x2UL<<HRPWMC_HXB8_0_MUX8_Pos)                   /*!< 0x00020000 */
#define HRPWMC_HXB8_0_MUX9_Pos                    (18U)
#define HRPWMC_HXB8_0_MUX9_Msk                    (0x3UL<<HRPWMC_HXB8_0_MUX9_Pos)                   /*!< 0x000C0000 */
#define HRPWMC_HXB8_0_MUX9                        HRPWMC_HXB8_0_MUX9_Msk                            /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB8_0_MUX9_0                      (0x1UL<<HRPWMC_HXB8_0_MUX9_Pos)                   /*!< 0x00040000 */
#define HRPWMC_HXB8_0_MUX9_1                      (0x2UL<<HRPWMC_HXB8_0_MUX9_Pos)                   /*!< 0x00080000 */
#define HRPWMC_HXB8_0_MUX10_Pos                   (20U)
#define HRPWMC_HXB8_0_MUX10_Msk                   (0x3UL<<HRPWMC_HXB8_0_MUX10_Pos)                  /*!< 0x00300000 */
#define HRPWMC_HXB8_0_MUX10                       HRPWMC_HXB8_0_MUX10_Msk                           /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB8_0_MUX10_0                     (0x1UL<<HRPWMC_HXB8_0_MUX10_Pos)                  /*!< 0x00100000 */
#define HRPWMC_HXB8_0_MUX10_1                     (0x2UL<<HRPWMC_HXB8_0_MUX10_Pos)                  /*!< 0x00200000 */
#define HRPWMC_HXB8_0_MUX11_Pos                   (22U)
#define HRPWMC_HXB8_0_MUX11_Msk                   (0x3UL<<HRPWMC_HXB8_0_MUX11_Pos)                  /*!< 0x00C00000 */
#define HRPWMC_HXB8_0_MUX11                       HRPWMC_HXB8_0_MUX11_Msk                           /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB8_0_MUX11_0                     (0x1UL<<HRPWMC_HXB8_0_MUX11_Pos)                  /*!< 0x00400000 */
#define HRPWMC_HXB8_0_MUX11_1                     (0x2UL<<HRPWMC_HXB8_0_MUX11_Pos)                  /*!< 0x00800000 */
#define HRPWMC_HXB8_0_MUX12_Pos                   (24U)
#define HRPWMC_HXB8_0_MUX12_Msk                   (0x3UL<<HRPWMC_HXB8_0_MUX12_Pos)                  /*!< 0x03000000 */
#define HRPWMC_HXB8_0_MUX12                       HRPWMC_HXB8_0_MUX12_Msk                           /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB8_0_MUX12_0                     (0x1UL<<HRPWMC_HXB8_0_MUX12_Pos)                  /*!< 0x01000000 */
#define HRPWMC_HXB8_0_MUX12_1                     (0x2UL<<HRPWMC_HXB8_0_MUX12_Pos)                  /*!< 0x02000000 */
#define HRPWMC_HXB8_0_MUX13_Pos                   (26U)
#define HRPWMC_HXB8_0_MUX13_Msk                   (0x3UL<<HRPWMC_HXB8_0_MUX13_Pos)                  /*!< 0x0C000000 */
#define HRPWMC_HXB8_0_MUX13                       HRPWMC_HXB8_0_MUX13_Msk                           /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB8_0_MUX13_0                     (0x1UL<<HRPWMC_HXB8_0_MUX13_Pos)                  /*!< 0x04000000 */
#define HRPWMC_HXB8_0_MUX13_1                     (0x2UL<<HRPWMC_HXB8_0_MUX13_Pos)                  /*!< 0x08000000 */
#define HRPWMC_HXB8_0_MUX14_Pos                   (28U)
#define HRPWMC_HXB8_0_MUX14_Msk                   (0x3UL<<HRPWMC_HXB8_0_MUX14_Pos)                  /*!< 0x30000000 */
#define HRPWMC_HXB8_0_MUX14                       HRPWMC_HXB8_0_MUX14_Msk                           /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB8_0_MUX14_0                     (0x1UL<<HRPWMC_HXB8_0_MUX14_Pos)                  /*!< 0x10000000 */
#define HRPWMC_HXB8_0_MUX14_1                     (0x2UL<<HRPWMC_HXB8_0_MUX14_Pos)                  /*!< 0x20000000 */
#define HRPWMC_HXB8_0_MUX15_Pos                   (30U)
#define HRPWMC_HXB8_0_MUX15_Msk                   (0x3UL<<HRPWMC_HXB8_0_MUX15_Pos)                  /*!< 0xC0000000 */
#define HRPWMC_HXB8_0_MUX15                       HRPWMC_HXB8_0_MUX15_Msk                           /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB8_0_MUX15_0                     (0x1UL<<HRPWMC_HXB8_0_MUX15_Pos)                  /*!< 0x40000000 */
#define HRPWMC_HXB8_0_MUX15_1                     (0x2UL<<HRPWMC_HXB8_0_MUX15_Pos)                  /*!< 0x80000000 */

/********************************* Bit definition for HRPWMC_HXB8_1 register ****************************************/
#define HRPWMC_HXB8_1_MUX16_Pos                   (0U)
#define HRPWMC_HXB8_1_MUX16_Msk                   (0x3UL<<HRPWMC_HXB8_1_MUX16_Pos)                  /*!< 0x00000003 */
#define HRPWMC_HXB8_1_MUX16                       HRPWMC_HXB8_1_MUX16_Msk                           /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB8_1_MUX16_0                     (0x1UL<<HRPWMC_HXB8_1_MUX16_Pos)                  /*!< 0x00000001 */
#define HRPWMC_HXB8_1_MUX16_1                     (0x2UL<<HRPWMC_HXB8_1_MUX16_Pos)                  /*!< 0x00000002 */
#define HRPWMC_HXB8_1_MUX17_Pos                   (2U)
#define HRPWMC_HXB8_1_MUX17_Msk                   (0x3UL<<HRPWMC_HXB8_1_MUX17_Pos)                  /*!< 0x0000000C */
#define HRPWMC_HXB8_1_MUX17                       HRPWMC_HXB8_1_MUX17_Msk                           /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB8_1_MUX17_0                     (0x1UL<<HRPWMC_HXB8_1_MUX17_Pos)                  /*!< 0x00000004 */
#define HRPWMC_HXB8_1_MUX17_1                     (0x2UL<<HRPWMC_HXB8_1_MUX17_Pos)                  /*!< 0x00000008 */
#define HRPWMC_HXB8_1_MUX18_Pos                   (4U)
#define HRPWMC_HXB8_1_MUX18_Msk                   (0x3UL<<HRPWMC_HXB8_1_MUX18_Pos)                  /*!< 0x00000030 */
#define HRPWMC_HXB8_1_MUX18                       HRPWMC_HXB8_1_MUX18_Msk                           /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB8_1_MUX18_0                     (0x1UL<<HRPWMC_HXB8_1_MUX18_Pos)                  /*!< 0x00000010 */
#define HRPWMC_HXB8_1_MUX18_1                     (0x2UL<<HRPWMC_HXB8_1_MUX18_Pos)                  /*!< 0x00000020 */
#define HRPWMC_HXB8_1_MUX19_Pos                   (6U)
#define HRPWMC_HXB8_1_MUX19_Msk                   (0x3UL<<HRPWMC_HXB8_1_MUX19_Pos)                  /*!< 0x000000C0 */
#define HRPWMC_HXB8_1_MUX19                       HRPWMC_HXB8_1_MUX19_Msk                           /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB8_1_MUX19_0                     (0x1UL<<HRPWMC_HXB8_1_MUX19_Pos)                  /*!< 0x00000040 */
#define HRPWMC_HXB8_1_MUX19_1                     (0x2UL<<HRPWMC_HXB8_1_MUX19_Pos)                  /*!< 0x00000080 */
#define HRPWMC_HXB8_1_MUX20_Pos                   (8U)
#define HRPWMC_HXB8_1_MUX20_Msk                   (0x3UL<<HRPWMC_HXB8_1_MUX20_Pos)                  /*!< 0x00000300 */
#define HRPWMC_HXB8_1_MUX20                       HRPWMC_HXB8_1_MUX20_Msk                           /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB8_1_MUX20_0                     (0x1UL<<HRPWMC_HXB8_1_MUX20_Pos)                  /*!< 0x00000100 */
#define HRPWMC_HXB8_1_MUX20_1                     (0x2UL<<HRPWMC_HXB8_1_MUX20_Pos)                  /*!< 0x00000200 */
#define HRPWMC_HXB8_1_MUX21_Pos                   (10U)
#define HRPWMC_HXB8_1_MUX21_Msk                   (0x3UL<<HRPWMC_HXB8_1_MUX21_Pos)                  /*!< 0x00000C00 */
#define HRPWMC_HXB8_1_MUX21                       HRPWMC_HXB8_1_MUX21_Msk                           /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB8_1_MUX21_0                     (0x1UL<<HRPWMC_HXB8_1_MUX21_Pos)                  /*!< 0x00000400 */
#define HRPWMC_HXB8_1_MUX21_1                     (0x2UL<<HRPWMC_HXB8_1_MUX21_Pos)                  /*!< 0x00000800 */
#define HRPWMC_HXB8_1_MUX22_Pos                   (12U)
#define HRPWMC_HXB8_1_MUX22_Msk                   (0x3UL<<HRPWMC_HXB8_1_MUX22_Pos)                  /*!< 0x00003000 */
#define HRPWMC_HXB8_1_MUX22                       HRPWMC_HXB8_1_MUX22_Msk                           /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB8_1_MUX22_0                     (0x1UL<<HRPWMC_HXB8_1_MUX22_Pos)                  /*!< 0x00001000 */
#define HRPWMC_HXB8_1_MUX22_1                     (0x2UL<<HRPWMC_HXB8_1_MUX22_Pos)                  /*!< 0x00002000 */
#define HRPWMC_HXB8_1_MUX23_Pos                   (14U)
#define HRPWMC_HXB8_1_MUX23_Msk                   (0x3UL<<HRPWMC_HXB8_1_MUX23_Pos)                  /*!< 0x0000C000 */
#define HRPWMC_HXB8_1_MUX23                       HRPWMC_HXB8_1_MUX23_Msk                           /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB8_1_MUX23_0                     (0x1UL<<HRPWMC_HXB8_1_MUX23_Pos)                  /*!< 0x00004000 */
#define HRPWMC_HXB8_1_MUX23_1                     (0x2UL<<HRPWMC_HXB8_1_MUX23_Pos)                  /*!< 0x00008000 */
#define HRPWMC_HXB8_1_MUX24_Pos                   (16U)
#define HRPWMC_HXB8_1_MUX24_Msk                   (0x3UL<<HRPWMC_HXB8_1_MUX24_Pos)                  /*!< 0x00030000 */
#define HRPWMC_HXB8_1_MUX24                       HRPWMC_HXB8_1_MUX24_Msk                           /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB8_1_MUX24_0                     (0x1UL<<HRPWMC_HXB8_1_MUX24_Pos)                  /*!< 0x00010000 */
#define HRPWMC_HXB8_1_MUX24_1                     (0x2UL<<HRPWMC_HXB8_1_MUX24_Pos)                  /*!< 0x00020000 */
#define HRPWMC_HXB8_1_MUX25_Pos                   (18U)
#define HRPWMC_HXB8_1_MUX25_Msk                   (0x3UL<<HRPWMC_HXB8_1_MUX25_Pos)                  /*!< 0x000C0000 */
#define HRPWMC_HXB8_1_MUX25                       HRPWMC_HXB8_1_MUX25_Msk                           /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB8_1_MUX25_0                     (0x1UL<<HRPWMC_HXB8_1_MUX25_Pos)                  /*!< 0x00040000 */
#define HRPWMC_HXB8_1_MUX25_1                     (0x2UL<<HRPWMC_HXB8_1_MUX25_Pos)                  /*!< 0x00080000 */
#define HRPWMC_HXB8_1_MUX26_Pos                   (20U)
#define HRPWMC_HXB8_1_MUX26_Msk                   (0x3UL<<HRPWMC_HXB8_1_MUX26_Pos)                  /*!< 0x00300000 */
#define HRPWMC_HXB8_1_MUX26                       HRPWMC_HXB8_1_MUX26_Msk                           /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB8_1_MUX26_0                     (0x1UL<<HRPWMC_HXB8_1_MUX26_Pos)                  /*!< 0x00100000 */
#define HRPWMC_HXB8_1_MUX26_1                     (0x2UL<<HRPWMC_HXB8_1_MUX26_Pos)                  /*!< 0x00200000 */
#define HRPWMC_HXB8_1_MUX27_Pos                   (22U)
#define HRPWMC_HXB8_1_MUX27_Msk                   (0x3UL<<HRPWMC_HXB8_1_MUX27_Pos)                  /*!< 0x00C00000 */
#define HRPWMC_HXB8_1_MUX27                       HRPWMC_HXB8_1_MUX27_Msk                           /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB8_1_MUX27_0                     (0x1UL<<HRPWMC_HXB8_1_MUX27_Pos)                  /*!< 0x00400000 */
#define HRPWMC_HXB8_1_MUX27_1                     (0x2UL<<HRPWMC_HXB8_1_MUX27_Pos)                  /*!< 0x00800000 */
#define HRPWMC_HXB8_1_MUX28_Pos                   (24U)
#define HRPWMC_HXB8_1_MUX28_Msk                   (0x3UL<<HRPWMC_HXB8_1_MUX28_Pos)                  /*!< 0x03000000 */
#define HRPWMC_HXB8_1_MUX28                       HRPWMC_HXB8_1_MUX28_Msk                           /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB8_1_MUX28_0                     (0x1UL<<HRPWMC_HXB8_1_MUX28_Pos)                  /*!< 0x01000000 */
#define HRPWMC_HXB8_1_MUX28_1                     (0x2UL<<HRPWMC_HXB8_1_MUX28_Pos)                  /*!< 0x02000000 */
#define HRPWMC_HXB8_1_MUX29_Pos                   (26U)
#define HRPWMC_HXB8_1_MUX29_Msk                   (0x3UL<<HRPWMC_HXB8_1_MUX29_Pos)                  /*!< 0x0C000000 */
#define HRPWMC_HXB8_1_MUX29                       HRPWMC_HXB8_1_MUX29_Msk                           /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB8_1_MUX29_0                     (0x1UL<<HRPWMC_HXB8_1_MUX29_Pos)                  /*!< 0x04000000 */
#define HRPWMC_HXB8_1_MUX29_1                     (0x2UL<<HRPWMC_HXB8_1_MUX29_Pos)                  /*!< 0x08000000 */
#define HRPWMC_HXB8_1_MUX30_Pos                   (28U)
#define HRPWMC_HXB8_1_MUX30_Msk                   (0x3UL<<HRPWMC_HXB8_1_MUX30_Pos)                  /*!< 0x30000000 */
#define HRPWMC_HXB8_1_MUX30                       HRPWMC_HXB8_1_MUX30_Msk                           /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB8_1_MUX30_0                     (0x1UL<<HRPWMC_HXB8_1_MUX30_Pos)                  /*!< 0x10000000 */
#define HRPWMC_HXB8_1_MUX30_1                     (0x2UL<<HRPWMC_HXB8_1_MUX30_Pos)                  /*!< 0x20000000 */
#define HRPWMC_HXB8_1_MUX31_Pos                   (30U)
#define HRPWMC_HXB8_1_MUX31_Msk                   (0x3UL<<HRPWMC_HXB8_1_MUX31_Pos)                  /*!< 0xC0000000 */
#define HRPWMC_HXB8_1_MUX31                       HRPWMC_HXB8_1_MUX31_Msk                           /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB8_1_MUX31_0                     (0x1UL<<HRPWMC_HXB8_1_MUX31_Pos)                  /*!< 0x40000000 */
#define HRPWMC_HXB8_1_MUX31_1                     (0x2UL<<HRPWMC_HXB8_1_MUX31_Pos)                  /*!< 0x80000000 */

