breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for HRPWMC_HXB12_MUX register *************************************/
#define HRPWMC_HXB12_MUX_MUXEN_Pos                (0U)
#define HRPWMC_HXB12_MUX_MUXEN_Msk                (0xFFFFFFFFUL<<HRPWMC_HXB12_MUX_MUXEN_Pos)        /*!< 0xFFFFFFFF */
#define HRPWMC_HXB12_MUX_MUXEN                    HRPWMC_HXB12_MUX_MUXEN_Msk                        /*!< eallow, HRPWMXBAR_LOCK */

/********************************* Bit definition for HRPWMC_HXB_POL register ***************************************/
#define HRPWMC_HXB_POL_HXB4P_Pos                  (0U)
#define HRPWMC_HXB_POL_HXB4P_Msk                  (0x1UL<<HRPWMC_HXB_POL_HXB4P_Pos)                 /*!< 0x00000001 */
#define HRPWMC_HXB_POL_HXB4P                      HRPWMC_HXB_POL_HXB4P_Msk                          /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB_POL_HXB5P_Pos                  (1U)
#define HRPWMC_HXB_POL_HXB5P_Msk                  (0x1UL<<HRPWMC_HXB_POL_HXB5P_Pos)                 /*!< 0x00000002 */
#define HRPWMC_HXB_POL_HXB5P                      HRPWMC_HXB_POL_HXB5P_Msk                          /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB_POL_HXB7P_Pos                  (2U)
#define HRPWMC_HXB_POL_HXB7P_Msk                  (0x1UL<<HRPWMC_HXB_POL_HXB7P_Pos)                 /*!< 0x00000004 */
#define HRPWMC_HXB_POL_HXB7P                      HRPWMC_HXB_POL_HXB7P_Msk                          /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB_POL_HXB8P_Pos                  (3U)
#define HRPWMC_HXB_POL_HXB8P_Msk                  (0x1UL<<HRPWMC_HXB_POL_HXB8P_Pos)                 /*!< 0x00000008 */
#define HRPWMC_HXB_POL_HXB8P                      HRPWMC_HXB_POL_HXB8P_Msk                          /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB_POL_HXB9P_Pos                  (4U)
#define HRPWMC_HXB_POL_HXB9P_Msk                  (0x1UL<<HRPWMC_HXB_POL_HXB9P_Pos)                 /*!< 0x00000010 */
#define HRPWMC_HXB_POL_HXB9P                      HRPWMC_HXB_POL_HXB9P_Msk                          /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB_POL_HXB10P_Pos                 (5U)
#define HRPWMC_HXB_POL_HXB10P_Msk                 (0x1UL<<HRPWMC_HXB_POL_HXB10P_Pos)                /*!< 0x00000020 */
#define HRPWMC_HXB_POL_HXB10P                     HRPWMC_HXB_POL_HXB10P_Msk                         /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB_POL_HXB11P_Pos                 (6U)
#define HRPWMC_HXB_POL_HXB11P_Msk                 (0x1UL<<HRPWMC_HXB_POL_HXB11P_Pos)                /*!< 0x00000040 */
#define HRPWMC_HXB_POL_HXB11P                     HRPWMC_HXB_POL_HXB11P_Msk                         /*!< eallow, HRPWMXBAR_LOCK */
#define HRPWMC_HXB_POL_HXB12P_Pos                 (7U)
#define HRPWMC_HXB_POL_HXB12P_Msk                 (0x1UL<<HRPWMC_HXB_POL_HXB12P_Pos)                /*!< 0x00000080 */
#define HRPWMC_HXB_POL_HXB12P                     HRPWMC_HXB_POL_HXB12P_Msk                         /*!< eallow, HRPWMXBAR_LOCK */

/********************************* Bit definition for HRPWMC_HXB_LOCK register **************************************/
#define HRPWMC_HXB_LOCK_LOCK_Pos                  (0U)
#define HRPWMC_HXB_LOCK_LOCK_Msk                  (0x1UL<<HRPWMC_HXB_LOCK_LOCK_Pos)                 /*!< 0x00000001 */
#define HRPWMC_HXB_LOCK_LOCK                      HRPWMC_HXB_LOCK_LOCK_Msk                          /*!< eallow */
#define HRPWMC_HXB_LOCK_KEY_Pos                   (16U)
#define HRPWMC_HXB_LOCK_KEY_Msk                   (0xFFFFUL<<HRPWMC_HXB_LOCK_KEY_Pos)               /*!< 0xFFFF0000 */
#define HRPWMC_HXB_LOCK_KEY                       HRPWMC_HXB_LOCK_KEY_Msk                           /*!< eallow */

/********************************* Bit definition for HRPWMC_SYNCI_SEL1_4 register **********************************/
#define HRPWMC_SYNCI_SEL1_4_SEL1_Pos              (0U)
#define HRPWMC_SYNCI_SEL1_4_SEL1_Msk              (0x1FUL<<HRPWMC_SYNCI_SEL1_4_SEL1_Pos)            /*!< 0x0000001F */
#define HRPWMC_SYNCI_SEL1_4_SEL1                  HRPWMC_SYNCI_SEL1_4_SEL1_Msk                      /*!< eallow, SYNCSELECT_LOCK */
#define HRPWMC_SYNCI_SEL1_4_SEL1_0                (0x1UL<<HRPWMC_SYNCI_SEL1_4_SEL1_Pos)             /*!< 0x00000001 */
#define HRPWMC_SYNCI_SEL1_4_SEL1_1                (0x2UL<<HRPWMC_SYNCI_SEL1_4_SEL1_Pos)             /*!< 0x00000002 */
#define HRPWMC_SYNCI_SEL1_4_SEL1_2                (0x4UL<<HRPWMC_SYNCI_SEL1_4_SEL1_Pos)             /*!< 0x00000004 */
#define HRPWMC_SYNCI_SEL1_4_SEL1_3                (0x8UL<<HRPWMC_SYNCI_SEL1_4_SEL1_Pos)             /*!< 0x00000008 */
#define HRPWMC_SYNCI_SEL1_4_SEL1_4                (0x10UL<<HRPWMC_SYNCI_SEL1_4_SEL1_Pos)            /*!< 0x00000010 */
#define HRPWMC_SYNCI_SEL1_4_SEL2_Pos              (8U)
#define HRPWMC_SYNCI_SEL1_4_SEL2_Msk              (0x1FUL<<HRPWMC_SYNCI_SEL1_4_SEL2_Pos)            /*!< 0x00001F00 */
#define HRPWMC_SYNCI_SEL1_4_SEL2                  HRPWMC_SYNCI_SEL1_4_SEL2_Msk                      /*!< eallow, SYNCSELECT_LOCK */
#define HRPWMC_SYNCI_SEL1_4_SEL2_0                (0x1UL<<HRPWMC_SYNCI_SEL1_4_SEL2_Pos)             /*!< 0x00000100 */
#define HRPWMC_SYNCI_SEL1_4_SEL2_1                (0x2UL<<HRPWMC_SYNCI_SEL1_4_SEL2_Pos)             /*!< 0x00000200 */
#define HRPWMC_SYNCI_SEL1_4_SEL2_2                (0x4UL<<HRPWMC_SYNCI_SEL1_4_SEL2_Pos)             /*!< 0x00000400 */
#define HRPWMC_SYNCI_SEL1_4_SEL2_3                (0x8UL<<HRPWMC_SYNCI_SEL1_4_SEL2_Pos)             /*!< 0x00000800 */
#define HRPWMC_SYNCI_SEL1_4_SEL2_4                (0x10UL<<HRPWMC_SYNCI_SEL1_4_SEL2_Pos)            /*!< 0x00001000 */
#define HRPWMC_SYNCI_SEL1_4_SEL3_Pos              (16U)
#define HRPWMC_SYNCI_SEL1_4_SEL3_Msk              (0x1FUL<<HRPWMC_SYNCI_SEL1_4_SEL3_Pos)            /*!< 0x001F0000 */
#define HRPWMC_SYNCI_SEL1_4_SEL3                  HRPWMC_SYNCI_SEL1_4_SEL3_Msk                      /*!< eallow, SYNCSELECT_LOCK */
#define HRPWMC_SYNCI_SEL1_4_SEL3_0                (0x1UL<<HRPWMC_SYNCI_SEL1_4_SEL3_Pos)             /*!< 0x00010000 */
#define HRPWMC_SYNCI_SEL1_4_SEL3_1                (0x2UL<<HRPWMC_SYNCI_SEL1_4_SEL3_Pos)             /*!< 0x00020000 */
#define HRPWMC_SYNCI_SEL1_4_SEL3_2                (0x4UL<<HRPWMC_SYNCI_SEL1_4_SEL3_Pos)             /*!< 0x00040000 */
#define HRPWMC_SYNCI_SEL1_4_SEL3_3                (0x8UL<<HRPWMC_SYNCI_SEL1_4_SEL3_Pos)             /*!< 0x00080000 */
#define HRPWMC_SYNCI_SEL1_4_SEL3_4                (0x10UL<<HRPWMC_SYNCI_SEL1_4_SEL3_Pos)            /*!< 0x00100000 */
#define HRPWMC_SYNCI_SEL1_4_SEL4_Pos              (24U)
#define HRPWMC_SYNCI_SEL1_4_SEL4_Msk              (0x1FUL<<HRPWMC_SYNCI_SEL1_4_SEL4_Pos)            /*!< 0x1F000000 */
#define HRPWMC_SYNCI_SEL1_4_SEL4                  HRPWMC_SYNCI_SEL1_4_SEL4_Msk                      /*!< eallow, SYNCSELECT_LOCK */
#define HRPWMC_SYNCI_SEL1_4_SEL4_0                (0x1UL<<HRPWMC_SYNCI_SEL1_4_SEL4_Pos)             /*!< 0x01000000 */
#define HRPWMC_SYNCI_SEL1_4_SEL4_1                (0x2UL<<HRPWMC_SYNCI_SEL1_4_SEL4_Pos)             /*!< 0x02000000 */
#define HRPWMC_SYNCI_SEL1_4_SEL4_2                (0x4UL<<HRPWMC_SYNCI_SEL1_4_SEL4_Pos)             /*!< 0x04000000 */
#define HRPWMC_SYNCI_SEL1_4_SEL4_3                (0x8UL<<HRPWMC_SYNCI_SEL1_4_SEL4_Pos)             /*!< 0x08000000 */
#define HRPWMC_SYNCI_SEL1_4_SEL4_4                (0x10UL<<HRPWMC_SYNCI_SEL1_4_SEL4_Pos)            /*!< 0x10000000 */

/********************************* Bit definition for HRPWMC_SYNCI_SEL5_6 register **********************************/
#define HRPWMC_SYNCI_SEL5_6_SEL5_Pos              (0U)
#define HRPWMC_SYNCI_SEL5_6_SEL5_Msk              (0x1FUL<<HRPWMC_SYNCI_SEL5_6_SEL5_Pos)            /*!< 0x0000001F */
#define HRPWMC_SYNCI_SEL5_6_SEL5                  HRPWMC_SYNCI_SEL5_6_SEL5_Msk                      /*!< eallow, SYNCSELECT_LOCK */
#define HRPWMC_SYNCI_SEL5_6_SEL5_0                (0x1UL<<HRPWMC_SYNCI_SEL5_6_SEL5_Pos)             /*!< 0x00000001 */
#define HRPWMC_SYNCI_SEL5_6_SEL5_1                (0x2UL<<HRPWMC_SYNCI_SEL5_6_SEL5_Pos)             /*!< 0x00000002 */
#define HRPWMC_SYNCI_SEL5_6_SEL5_2                (0x4UL<<HRPWMC_SYNCI_SEL5_6_SEL5_Pos)             /*!< 0x00000004 */
#define HRPWMC_SYNCI_SEL5_6_SEL5_3                (0x8UL<<HRPWMC_SYNCI_SEL5_6_SEL5_Pos)             /*!< 0x00000008 */
#define HRPWMC_SYNCI_SEL5_6_SEL5_4                (0x10UL<<HRPWMC_SYNCI_SEL5_6_SEL5_Pos)            /*!< 0x00000010 */
#define HRPWMC_SYNCI_SEL5_6_SEL6_Pos              (8U)
#define HRPWMC_SYNCI_SEL5_6_SEL6_Msk              (0x1FUL<<HRPWMC_SYNCI_SEL5_6_SEL6_Pos)            /*!< 0x00001F00 */
#define HRPWMC_SYNCI_SEL5_6_SEL6                  HRPWMC_SYNCI_SEL5_6_SEL6_Msk                      /*!< eallow, SYNCSELECT_LOCK */
#define HRPWMC_SYNCI_SEL5_6_SEL6_0                (0x1UL<<HRPWMC_SYNCI_SEL5_6_SEL6_Pos)             /*!< 0x00000100 */
#define HRPWMC_SYNCI_SEL5_6_SEL6_1                (0x2UL<<HRPWMC_SYNCI_SEL5_6_SEL6_Pos)             /*!< 0x00000200 */
#define HRPWMC_SYNCI_SEL5_6_SEL6_2                (0x4UL<<HRPWMC_SYNCI_SEL5_6_SEL6_Pos)             /*!< 0x00000400 */
#define HRPWMC_SYNCI_SEL5_6_SEL6_3                (0x8UL<<HRPWMC_SYNCI_SEL5_6_SEL6_Pos)             /*!< 0x00000800 */
#define HRPWMC_SYNCI_SEL5_6_SEL6_4                (0x10UL<<HRPWMC_SYNCI_SEL5_6_SEL6_Pos)            /*!< 0x00001000 */

/********************************* Bit definition for HRPWMC_SYNCO_SEL1_4 register **********************************/
#define HRPWMC_SYNCO_SEL1_4_SEL1_Pos              (0U)
#define HRPWMC_SYNCO_SEL1_4_SEL1_Msk              (0x1FUL<<HRPWMC_SYNCO_SEL1_4_SEL1_Pos)            /*!< 0x0000001F */
#define HRPWMC_SYNCO_SEL1_4_SEL1                  HRPWMC_SYNCO_SEL1_4_SEL1_Msk                      /*!< eallow */
#define HRPWMC_SYNCO_SEL1_4_SEL1_0                (0x1UL<<HRPWMC_SYNCO_SEL1_4_SEL1_Pos)             /*!< 0x00000001 */
#define HRPWMC_SYNCO_SEL1_4_SEL1_1                (0x2UL<<HRPWMC_SYNCO_SEL1_4_SEL1_Pos)             /*!< 0x00000002 */
#define HRPWMC_SYNCO_SEL1_4_SEL1_2                (0x4UL<<HRPWMC_SYNCO_SEL1_4_SEL1_Pos)             /*!< 0x00000004 */
#define HRPWMC_SYNCO_SEL1_4_SEL1_3                (0x8UL<<HRPWMC_SYNCO_SEL1_4_SEL1_Pos)             /*!< 0x00000008 */
#define HRPWMC_SYNCO_SEL1_4_SEL1_4                (0x10UL<<HRPWMC_SYNCO_SEL1_4_SEL1_Pos)            /*!< 0x00000010 */
#define HRPWMC_SYNCO_SEL1_4_SEL2_Pos              (8U)
#define HRPWMC_SYNCO_SEL1_4_SEL2_Msk              (0x1FUL<<HRPWMC_SYNCO_SEL1_4_SEL2_Pos)            /*!< 0x00001F00 */
#define HRPWMC_SYNCO_SEL1_4_SEL2                  HRPWMC_SYNCO_SEL1_4_SEL2_Msk                      /*!< eallow */
#define HRPWMC_SYNCO_SEL1_4_SEL2_0                (0x1UL<<HRPWMC_SYNCO_SEL1_4_SEL2_Pos)             /*!< 0x00000100 */
#define HRPWMC_SYNCO_SEL1_4_SEL2_1                (0x2UL<<HRPWMC_SYNCO_SEL1_4_SEL2_Pos)             /*!< 0x00000200 */
#define HRPWMC_SYNCO_SEL1_4_SEL2_2                (0x4UL<<HRPWMC_SYNCO_SEL1_4_SEL2_Pos)             /*!< 0x00000400 */
#define HRPWMC_SYNCO_SEL1_4_SEL2_3                (0x8UL<<HRPWMC_SYNCO_SEL1_4_SEL2_Pos)             /*!< 0x00000800 */
#define HRPWMC_SYNCO_SEL1_4_SEL2_4                (0x10UL<<HRPWMC_SYNCO_SEL1_4_SEL2_Pos)            /*!< 0x00001000 */
#define HRPWMC_SYNCO_SEL1_4_SEL3_Pos              (16U)
#define HRPWMC_SYNCO_SEL1_4_SEL3_Msk              (0x1FUL<<HRPWMC_SYNCO_SEL1_4_SEL3_Pos)            /*!< 0x001F0000 */
#define HRPWMC_SYNCO_SEL1_4_SEL3                  HRPWMC_SYNCO_SEL1_4_SEL3_Msk                      /*!< eallow */
#define HRPWMC_SYNCO_SEL1_4_SEL3_0                (0x1UL<<HRPWMC_SYNCO_SEL1_4_SEL3_Pos)             /*!< 0x00010000 */
#define HRPWMC_SYNCO_SEL1_4_SEL3_1                (0x2UL<<HRPWMC_SYNCO_SEL1_4_SEL3_Pos)             /*!< 0x00020000 */
#define HRPWMC_SYNCO_SEL1_4_SEL3_2                (0x4UL<<HRPWMC_SYNCO_SEL1_4_SEL3_Pos)             /*!< 0x00040000 */
#define HRPWMC_SYNCO_SEL1_4_SEL3_3                (0x8UL<<HRPWMC_SYNCO_SEL1_4_SEL3_Pos)             /*!< 0x00080000 */
#define HRPWMC_SYNCO_SEL1_4_SEL3_4                (0x10UL<<HRPWMC_SYNCO_SEL1_4_SEL3_Pos)            /*!< 0x00100000 */
#define HRPWMC_SYNCO_SEL1_4_SEL4_Pos              (24U)
#define HRPWMC_SYNCO_SEL1_4_SEL4_Msk              (0x1FUL<<HRPWMC_SYNCO_SEL1_4_SEL4_Pos)            /*!< 0x1F000000 */
#define HRPWMC_SYNCO_SEL1_4_SEL4                  HRPWMC_SYNCO_SEL1_4_SEL4_Msk                      /*!< eallow */
#define HRPWMC_SYNCO_SEL1_4_SEL4_0                (0x1UL<<HRPWMC_SYNCO_SEL1_4_SEL4_Pos)             /*!< 0x01000000 */
#define HRPWMC_SYNCO_SEL1_4_SEL4_1                (0x2UL<<HRPWMC_SYNCO_SEL1_4_SEL4_Pos)             /*!< 0x02000000 */
#define HRPWMC_SYNCO_SEL1_4_SEL4_2                (0x4UL<<HRPWMC_SYNCO_SEL1_4_SEL4_Pos)             /*!< 0x04000000 */
#define HRPWMC_SYNCO_SEL1_4_SEL4_3                (0x8UL<<HRPWMC_SYNCO_SEL1_4_SEL4_Pos)             /*!< 0x08000000 */
#define HRPWMC_SYNCO_SEL1_4_SEL4_4                (0x10UL<<HRPWMC_SYNCO_SEL1_4_SEL4_Pos)            /*!< 0x10000000 */

/********************************* Bit definition for HRPWMC_SYNCO_SEL5_6 register **********************************/
#define HRPWMC_SYNCO_SEL5_6_SEL5_Pos              (0U)
#define HRPWMC_SYNCO_SEL5_6_SEL5_Msk              (0x1FUL<<HRPWMC_SYNCO_SEL5_6_SEL5_Pos)            /*!< 0x0000001F */
#define HRPWMC_SYNCO_SEL5_6_SEL5                  HRPWMC_SYNCO_SEL5_6_SEL5_Msk                      /*!< eallow */
#define HRPWMC_SYNCO_SEL5_6_SEL5_0                (0x1UL<<HRPWMC_SYNCO_SEL5_6_SEL5_Pos)             /*!< 0x00000001 */
#define HRPWMC_SYNCO_SEL5_6_SEL5_1                (0x2UL<<HRPWMC_SYNCO_SEL5_6_SEL5_Pos)             /*!< 0x00000002 */
#define HRPWMC_SYNCO_SEL5_6_SEL5_2                (0x4UL<<HRPWMC_SYNCO_SEL5_6_SEL5_Pos)             /*!< 0x00000004 */
#define HRPWMC_SYNCO_SEL5_6_SEL5_3                (0x8UL<<HRPWMC_SYNCO_SEL5_6_SEL5_Pos)             /*!< 0x00000008 */
#define HRPWMC_SYNCO_SEL5_6_SEL5_4                (0x10UL<<HRPWMC_SYNCO_SEL5_6_SEL5_Pos)            /*!< 0x00000010 */
#define HRPWMC_SYNCO_SEL5_6_SEL6_Pos              (8U)
#define HRPWMC_SYNCO_SEL5_6_SEL6_Msk              (0x1FUL<<HRPWMC_SYNCO_SEL5_6_SEL6_Pos)            /*!< 0x00001F00 */
#define HRPWMC_SYNCO_SEL5_6_SEL6                  HRPWMC_SYNCO_SEL5_6_SEL6_Msk                      /*!< eallow */
#define HRPWMC_SYNCO_SEL5_6_SEL6_0                (0x1UL<<HRPWMC_SYNCO_SEL5_6_SEL6_Pos)             /*!< 0x00000100 */
#define HRPWMC_SYNCO_SEL5_6_SEL6_1                (0x2UL<<HRPWMC_SYNCO_SEL5_6_SEL6_Pos)             /*!< 0x00000200 */
#define HRPWMC_SYNCO_SEL5_6_SEL6_2                (0x4UL<<HRPWMC_SYNCO_SEL5_6_SEL6_Pos)             /*!< 0x00000400 */
#define HRPWMC_SYNCO_SEL5_6_SEL6_3                (0x8UL<<HRPWMC_SYNCO_SEL5_6_SEL6_Pos)             /*!< 0x00000800 */
#define HRPWMC_SYNCO_SEL5_6_SEL6_4                (0x10UL<<HRPWMC_SYNCO_SEL5_6_SEL6_Pos)            /*!< 0x00001000 */

