breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for HRPWMC_ADCOUT register ****************************************/
#define HRPWMC_ADCOUT_SOC1A_EN_Pos                (0U)
#define HRPWMC_ADCOUT_SOC1A_EN_Msk                (0x1UL<<HRPWMC_ADCOUT_SOC1A_EN_Pos)               /*!< 0x00000001 */
#define HRPWMC_ADCOUT_SOC1A_EN                    HRPWMC_ADCOUT_SOC1A_EN_Msk                        /*!< eallow , ADCSOCOUTSELECT_LOCK */
#define HRPWMC_ADCOUT_SOC2A_EN_Pos                (1U)
#define HRPWMC_ADCOUT_SOC2A_EN_Msk                (0x1UL<<HRPWMC_ADCOUT_SOC2A_EN_Pos)               /*!< 0x00000002 */
#define HRPWMC_ADCOUT_SOC2A_EN                    HRPWMC_ADCOUT_SOC2A_EN_Msk                        /*!< eallow , ADCSOCOUTSELECT_LOCK */
#define HRPWMC_ADCOUT_SOC3A_EN_Pos                (2U)
#define HRPWMC_ADCOUT_SOC3A_EN_Msk                (0x1UL<<HRPWMC_ADCOUT_SOC3A_EN_Pos)               /*!< 0x00000004 */
#define HRPWMC_ADCOUT_SOC3A_EN                    HRPWMC_ADCOUT_SOC3A_EN_Msk                        /*!< eallow , ADCSOCOUTSELECT_LOCK */
#define HRPWMC_ADCOUT_SOC4A_EN_Pos                (3U)
#define HRPWMC_ADCOUT_SOC4A_EN_Msk                (0x1UL<<HRPWMC_ADCOUT_SOC4A_EN_Pos)               /*!< 0x00000008 */
#define HRPWMC_ADCOUT_SOC4A_EN                    HRPWMC_ADCOUT_SOC4A_EN_Msk                        /*!< eallow , ADCSOCOUTSELECT_LOCK */
#define HRPWMC_ADCOUT_SOC5A_EN_Pos                (4U)
#define HRPWMC_ADCOUT_SOC5A_EN_Msk                (0x1UL<<HRPWMC_ADCOUT_SOC5A_EN_Pos)               /*!< 0x00000010 */
#define HRPWMC_ADCOUT_SOC5A_EN                    HRPWMC_ADCOUT_SOC5A_EN_Msk                        /*!< eallow , ADCSOCOUTSELECT_LOCK */
#define HRPWMC_ADCOUT_SOC6A_EN_Pos                (5U)
#define HRPWMC_ADCOUT_SOC6A_EN_Msk                (0x1UL<<HRPWMC_ADCOUT_SOC6A_EN_Pos)               /*!< 0x00000020 */
#define HRPWMC_ADCOUT_SOC6A_EN                    HRPWMC_ADCOUT_SOC6A_EN_Msk                        /*!< eallow , ADCSOCOUTSELECT_LOCK */
#define HRPWMC_ADCOUT_SOC1B_EN_Pos                (6U)
#define HRPWMC_ADCOUT_SOC1B_EN_Msk                (0x1UL<<HRPWMC_ADCOUT_SOC1B_EN_Pos)               /*!< 0x00000040 */
#define HRPWMC_ADCOUT_SOC1B_EN                    HRPWMC_ADCOUT_SOC1B_EN_Msk                        /*!< eallow , ADCSOCOUTSELECT_LOCK */
#define HRPWMC_ADCOUT_SOC2B_EN_Pos                (7U)
#define HRPWMC_ADCOUT_SOC2B_EN_Msk                (0x1UL<<HRPWMC_ADCOUT_SOC2B_EN_Pos)               /*!< 0x00000080 */
#define HRPWMC_ADCOUT_SOC2B_EN                    HRPWMC_ADCOUT_SOC2B_EN_Msk                        /*!< eallow , ADCSOCOUTSELECT_LOCK */
#define HRPWMC_ADCOUT_SOC3B_EN_Pos                (8U)
#define HRPWMC_ADCOUT_SOC3B_EN_Msk                (0x1UL<<HRPWMC_ADCOUT_SOC3B_EN_Pos)               /*!< 0x00000100 */
#define HRPWMC_ADCOUT_SOC3B_EN                    HRPWMC_ADCOUT_SOC3B_EN_Msk                        /*!< eallow , ADCSOCOUTSELECT_LOCK */
#define HRPWMC_ADCOUT_SOC4B_EN_Pos                (9U)
#define HRPWMC_ADCOUT_SOC4B_EN_Msk                (0x1UL<<HRPWMC_ADCOUT_SOC4B_EN_Pos)               /*!< 0x00000200 */
#define HRPWMC_ADCOUT_SOC4B_EN                    HRPWMC_ADCOUT_SOC4B_EN_Msk                        /*!< eallow , ADCSOCOUTSELECT_LOCK */
#define HRPWMC_ADCOUT_SOC5B_EN_Pos                (10U)
#define HRPWMC_ADCOUT_SOC5B_EN_Msk                (0x1UL<<HRPWMC_ADCOUT_SOC5B_EN_Pos)               /*!< 0x00000400 */
#define HRPWMC_ADCOUT_SOC5B_EN                    HRPWMC_ADCOUT_SOC5B_EN_Msk                        /*!< eallow , ADCSOCOUTSELECT_LOCK */
#define HRPWMC_ADCOUT_SOC6B_EN_Pos                (11U)
#define HRPWMC_ADCOUT_SOC6B_EN_Msk                (0x1UL<<HRPWMC_ADCOUT_SOC6B_EN_Pos)               /*!< 0x00000800 */
#define HRPWMC_ADCOUT_SOC6B_EN                    HRPWMC_ADCOUT_SOC6B_EN_Msk                        /*!< eallow , ADCSOCOUTSELECT_LOCK */
#define HRPWMC_ADCOUT_SOCA_POL_Pos                (12U)
#define HRPWMC_ADCOUT_SOCA_POL_Msk                (0x1UL<<HRPWMC_ADCOUT_SOCA_POL_Pos)               /*!< 0x00001000 */
#define HRPWMC_ADCOUT_SOCA_POL                    HRPWMC_ADCOUT_SOCA_POL_Msk                        /*!< eallow , ADCSOCOUTSELECT_LOCK */
#define HRPWMC_ADCOUT_SOCB_POL_Pos                (13U)
#define HRPWMC_ADCOUT_SOCB_POL_Msk                (0x1UL<<HRPWMC_ADCOUT_SOCB_POL_Pos)               /*!< 0x00002000 */
#define HRPWMC_ADCOUT_SOCB_POL                    HRPWMC_ADCOUT_SOCB_POL_Msk                        /*!< eallow , ADCSOCOUTSELECT_LOCK */

/********************************* Bit definition for HRPWMC_SCOUT_CFG register *************************************/
#define HRPWMC_SCOUT_CFG_SCOUT_SEL_Pos            (0U)
#define HRPWMC_SCOUT_CFG_SCOUT_SEL_Msk            (0x7UL<<HRPWMC_SCOUT_CFG_SCOUT_SEL_Pos)           /*!< 0x00000007 */
#define HRPWMC_SCOUT_CFG_SCOUT_SEL                HRPWMC_SCOUT_CFG_SCOUT_SEL_Msk                    /*!< eallow  */
#define HRPWMC_SCOUT_CFG_SCOUT_SEL_0              (0x1UL<<HRPWMC_SCOUT_CFG_SCOUT_SEL_Pos)           /*!< 0x00000001 */
#define HRPWMC_SCOUT_CFG_SCOUT_SEL_1              (0x2UL<<HRPWMC_SCOUT_CFG_SCOUT_SEL_Pos)           /*!< 0x00000002 */
#define HRPWMC_SCOUT_CFG_SCOUT_SEL_2              (0x4UL<<HRPWMC_SCOUT_CFG_SCOUT_SEL_Pos)           /*!< 0x00000004 */
#define HRPWMC_SCOUT_CFG_SCOUT_EXP_BYPASS_Pos     (3U)
#define HRPWMC_SCOUT_CFG_SCOUT_EXP_BYPASS_Msk     (0x1UL<<HRPWMC_SCOUT_CFG_SCOUT_EXP_BYPASS_Pos)    /*!< 0x00000008 */
#define HRPWMC_SCOUT_CFG_SCOUT_EXP_BYPASS         HRPWMC_SCOUT_CFG_SCOUT_EXP_BYPASS_Msk             /*!< eallow  */

/********************************* Bit definition for HRPWMC_SYNCSOCLOCK register ***********************************/
#define HRPWMC_SYNCSOCLOCK_SYNC_Pos               (0U)
#define HRPWMC_SYNCSOCLOCK_SYNC_Msk               (0x1UL<<HRPWMC_SYNCSOCLOCK_SYNC_Pos)              /*!< 0x00000001 */
#define HRPWMC_SYNCSOCLOCK_SYNC                   HRPWMC_SYNCSOCLOCK_SYNC_Msk                       /*!< eallow  */
#define HRPWMC_SYNCSOCLOCK_ADCSOC_Pos             (1U)
#define HRPWMC_SYNCSOCLOCK_ADCSOC_Msk             (0x1UL<<HRPWMC_SYNCSOCLOCK_ADCSOC_Pos)            /*!< 0x00000002 */
#define HRPWMC_SYNCSOCLOCK_ADCSOC                 HRPWMC_SYNCSOCLOCK_ADCSOC_Msk                     /*!< eallow  */

/********************************* Bit definition for HRPWMC_EALLOW register ****************************************/
#define HRPWMC_EALLOW_EALLOW_Pos                  (0U)
#define HRPWMC_EALLOW_EALLOW_Msk                  (0x1UL<<HRPWMC_EALLOW_EALLOW_Pos)                 /*!< 0x00000001 */
#define HRPWMC_EALLOW_EALLOW                      HRPWMC_EALLOW_EALLOW_Msk                          
#define HRPWMC_EALLOW_EALLOW_KEY_Pos              (16U)
#define HRPWMC_EALLOW_EALLOW_KEY_Msk              (0xFFFFUL<<HRPWMC_EALLOW_EALLOW_KEY_Pos)          /*!< 0xFFFF0000 */
#define HRPWMC_EALLOW_EALLOW_KEY                  HRPWMC_EALLOW_EALLOW_KEY_Msk

/********************************* Bit definition for HRPWMC_CLKEN register *****************************************/
#define HRPWMC_CLKEN_HRPWM1_CLK_EN_Pos            (0U)
#define HRPWMC_CLKEN_HRPWM1_CLK_EN_Msk            (0x1UL<<HRPWMC_CLKEN_HRPWM1_CLK_EN_Pos)           /*!< 0x00000001 */
#define HRPWMC_CLKEN_HRPWM1_CLK_EN                HRPWMC_CLKEN_HRPWM1_CLK_EN_Msk                    /*!< eallow  */
#define HRPWMC_CLKEN_HRPWM2_CLK_EN_Pos            (1U)
#define HRPWMC_CLKEN_HRPWM2_CLK_EN_Msk            (0x1UL<<HRPWMC_CLKEN_HRPWM2_CLK_EN_Pos)           /*!< 0x00000002 */
#define HRPWMC_CLKEN_HRPWM2_CLK_EN                HRPWMC_CLKEN_HRPWM2_CLK_EN_Msk                    /*!< eallow  */
#define HRPWMC_CLKEN_HRPWM3_CLK_EN_Pos            (2U)
#define HRPWMC_CLKEN_HRPWM3_CLK_EN_Msk            (0x1UL<<HRPWMC_CLKEN_HRPWM3_CLK_EN_Pos)           /*!< 0x00000004 */
#define HRPWMC_CLKEN_HRPWM3_CLK_EN                HRPWMC_CLKEN_HRPWM3_CLK_EN_Msk                    /*!< eallow  */
#define HRPWMC_CLKEN_HRPWM4_CLK_EN_Pos            (3U)
#define HRPWMC_CLKEN_HRPWM4_CLK_EN_Msk            (0x1UL<<HRPWMC_CLKEN_HRPWM4_CLK_EN_Pos)           /*!< 0x00000008 */
#define HRPWMC_CLKEN_HRPWM4_CLK_EN                HRPWMC_CLKEN_HRPWM4_CLK_EN_Msk                    /*!< eallow  */
#define HRPWMC_CLKEN_HRPWM5_CLK_EN_Pos            (4U)
#define HRPWMC_CLKEN_HRPWM5_CLK_EN_Msk            (0x1UL<<HRPWMC_CLKEN_HRPWM5_CLK_EN_Pos)           /*!< 0x00000010 */
#define HRPWMC_CLKEN_HRPWM5_CLK_EN                HRPWMC_CLKEN_HRPWM5_CLK_EN_Msk                    /*!< eallow  */
#define HRPWMC_CLKEN_HRPWM6_CLK_EN_Pos            (5U)
#define HRPWMC_CLKEN_HRPWM6_CLK_EN_Msk            (0x1UL<<HRPWMC_CLKEN_HRPWM6_CLK_EN_Pos)           /*!< 0x00000020 */
#define HRPWMC_CLKEN_HRPWM6_CLK_EN                HRPWMC_CLKEN_HRPWM6_CLK_EN_Msk                    /*!< eallow  */

/********************************* Bit definition for HRPWMC_XBARFLG1 register **************************************/
#define HRPWMC_XBARFLG1_COMP1_OUT_FLG_Pos         (0U)
#define HRPWMC_XBARFLG1_COMP1_OUT_FLG_Msk         (0x1UL<<HRPWMC_XBARFLG1_COMP1_OUT_FLG_Pos)        /*!< 0x00000001 */
#define HRPWMC_XBARFLG1_COMP1_OUT_FLG             HRPWMC_XBARFLG1_COMP1_OUT_FLG_Msk                 
#define HRPWMC_XBARFLG1_COMP2_OUT_FLG_Pos         (1U)
#define HRPWMC_XBARFLG1_COMP2_OUT_FLG_Msk         (0x1UL<<HRPWMC_XBARFLG1_COMP2_OUT_FLG_Pos)        /*!< 0x00000002 */
#define HRPWMC_XBARFLG1_COMP2_OUT_FLG             HRPWMC_XBARFLG1_COMP2_OUT_FLG_Msk                 
#define HRPWMC_XBARFLG1_COMP3_OUT_FLG_Pos         (2U)
#define HRPWMC_XBARFLG1_COMP3_OUT_FLG_Msk         (0x1UL<<HRPWMC_XBARFLG1_COMP3_OUT_FLG_Pos)        /*!< 0x00000004 */
#define HRPWMC_XBARFLG1_COMP3_OUT_FLG             HRPWMC_XBARFLG1_COMP3_OUT_FLG_Msk                 
#define HRPWMC_XBARFLG1_COMP4_OUT_FLG_Pos         (3U)
#define HRPWMC_XBARFLG1_COMP4_OUT_FLG_Msk         (0x1UL<<HRPWMC_XBARFLG1_COMP4_OUT_FLG_Pos)        /*!< 0x00000008 */
#define HRPWMC_XBARFLG1_COMP4_OUT_FLG             HRPWMC_XBARFLG1_COMP4_OUT_FLG_Msk                 
#define HRPWMC_XBARFLG1_INPUT1_FLG_Pos            (4U)
#define HRPWMC_XBARFLG1_INPUT1_FLG_Msk            (0x1UL<<HRPWMC_XBARFLG1_INPUT1_FLG_Pos)           /*!< 0x00000010 */
#define HRPWMC_XBARFLG1_INPUT1_FLG                HRPWMC_XBARFLG1_INPUT1_FLG_Msk                    
#define HRPWMC_XBARFLG1_INPUT2_FLG_Pos            (5U)
#define HRPWMC_XBARFLG1_INPUT2_FLG_Msk            (0x1UL<<HRPWMC_XBARFLG1_INPUT2_FLG_Pos)           /*!< 0x00000020 */
#define HRPWMC_XBARFLG1_INPUT2_FLG                HRPWMC_XBARFLG1_INPUT2_FLG_Msk                    
#define HRPWMC_XBARFLG1_INPUT3_FLG_Pos            (6U)
#define HRPWMC_XBARFLG1_INPUT3_FLG_Msk            (0x1UL<<HRPWMC_XBARFLG1_INPUT3_FLG_Pos)           /*!< 0x00000040 */
#define HRPWMC_XBARFLG1_INPUT3_FLG                HRPWMC_XBARFLG1_INPUT3_FLG_Msk                    
#define HRPWMC_XBARFLG1_INPUT4_FLG_Pos            (7U)
#define HRPWMC_XBARFLG1_INPUT4_FLG_Msk            (0x1UL<<HRPWMC_XBARFLG1_INPUT4_FLG_Pos)           /*!< 0x00000080 */
#define HRPWMC_XBARFLG1_INPUT4_FLG                HRPWMC_XBARFLG1_INPUT4_FLG_Msk                    
#define HRPWMC_XBARFLG1_INPUT5_FLG_Pos            (8U)
#define HRPWMC_XBARFLG1_INPUT5_FLG_Msk            (0x1UL<<HRPWMC_XBARFLG1_INPUT5_FLG_Pos)           /*!< 0x00000100 */
#define HRPWMC_XBARFLG1_INPUT5_FLG                HRPWMC_XBARFLG1_INPUT5_FLG_Msk                    
#define HRPWMC_XBARFLG1_INPUT6_FLG_Pos            (9U)
#define HRPWMC_XBARFLG1_INPUT6_FLG_Msk            (0x1UL<<HRPWMC_XBARFLG1_INPUT6_FLG_Pos)           /*!< 0x00000200 */
#define HRPWMC_XBARFLG1_INPUT6_FLG                HRPWMC_XBARFLG1_INPUT6_FLG_Msk                    
#define HRPWMC_XBARFLG1_ADCSOCA_FLG_Pos           (10U)
#define HRPWMC_XBARFLG1_ADCSOCA_FLG_Msk           (0x1UL<<HRPWMC_XBARFLG1_ADCSOCA_FLG_Pos)          /*!< 0x00000400 */
#define HRPWMC_XBARFLG1_ADCSOCA_FLG               HRPWMC_XBARFLG1_ADCSOCA_FLG_Msk                   
#define HRPWMC_XBARFLG1_ADCSOCB_FLG_Pos           (11U)
#define HRPWMC_XBARFLG1_ADCSOCB_FLG_Msk           (0x1UL<<HRPWMC_XBARFLG1_ADCSOCB_FLG_Pos)          /*!< 0x00000800 */
#define HRPWMC_XBARFLG1_ADCSOCB_FLG               HRPWMC_XBARFLG1_ADCSOCB_FLG_Msk                   
#define HRPWMC_XBARFLG1_INPUT7_FLG_Pos            (12U)
#define HRPWMC_XBARFLG1_INPUT7_FLG_Msk            (0x1UL<<HRPWMC_XBARFLG1_INPUT7_FLG_Pos)           /*!< 0x00001000 */
#define HRPWMC_XBARFLG1_INPUT7_FLG                HRPWMC_XBARFLG1_INPUT7_FLG_Msk                    
#define HRPWMC_XBARFLG1_INPUT8_FLG_Pos            (13U)
#define HRPWMC_XBARFLG1_INPUT8_FLG_Msk            (0x1UL<<HRPWMC_XBARFLG1_INPUT8_FLG_Pos)           /*!< 0x00002000 */
#define HRPWMC_XBARFLG1_INPUT8_FLG                HRPWMC_XBARFLG1_INPUT8_FLG_Msk                    
#define HRPWMC_XBARFLG1_INPUT9_FLG_Pos            (14U)
#define HRPWMC_XBARFLG1_INPUT9_FLG_Msk            (0x1UL<<HRPWMC_XBARFLG1_INPUT9_FLG_Pos)           /*!< 0x00004000 */
#define HRPWMC_XBARFLG1_INPUT9_FLG                HRPWMC_XBARFLG1_INPUT9_FLG_Msk                    
#define HRPWMC_XBARFLG1_INPUT10_FLG_Pos           (15U)
#define HRPWMC_XBARFLG1_INPUT10_FLG_Msk           (0x1UL<<HRPWMC_XBARFLG1_INPUT10_FLG_Pos)          /*!< 0x00008000 */
#define HRPWMC_XBARFLG1_INPUT10_FLG               HRPWMC_XBARFLG1_INPUT10_FLG_Msk                   
#define HRPWMC_XBARFLG1_INPUT11_FLG_Pos           (16U)
#define HRPWMC_XBARFLG1_INPUT11_FLG_Msk           (0x1UL<<HRPWMC_XBARFLG1_INPUT11_FLG_Pos)          /*!< 0x00010000 */
#define HRPWMC_XBARFLG1_INPUT11_FLG               HRPWMC_XBARFLG1_INPUT11_FLG_Msk                   
#define HRPWMC_XBARFLG1_INPUT12_FLG_Pos           (17U)
#define HRPWMC_XBARFLG1_INPUT12_FLG_Msk           (0x1UL<<HRPWMC_XBARFLG1_INPUT12_FLG_Pos)          /*!< 0x00020000 */
#define HRPWMC_XBARFLG1_INPUT12_FLG               HRPWMC_XBARFLG1_INPUT12_FLG_Msk                   
#define HRPWMC_XBARFLG1_INPUT13_FLG_Pos           (18U)
#define HRPWMC_XBARFLG1_INPUT13_FLG_Msk           (0x1UL<<HRPWMC_XBARFLG1_INPUT13_FLG_Pos)          /*!< 0x00040000 */
#define HRPWMC_XBARFLG1_INPUT13_FLG               HRPWMC_XBARFLG1_INPUT13_FLG_Msk                   
#define HRPWMC_XBARFLG1_INPUT14_FLG_Pos           (19U)
#define HRPWMC_XBARFLG1_INPUT14_FLG_Msk           (0x1UL<<HRPWMC_XBARFLG1_INPUT14_FLG_Pos)          /*!< 0x00080000 */
#define HRPWMC_XBARFLG1_INPUT14_FLG               HRPWMC_XBARFLG1_INPUT14_FLG_Msk                   
#define HRPWMC_XBARFLG1_ADC1_AWD1_FLG_Pos         (20U)
#define HRPWMC_XBARFLG1_ADC1_AWD1_FLG_Msk         (0x1UL<<HRPWMC_XBARFLG1_ADC1_AWD1_FLG_Pos)        /*!< 0x00100000 */
#define HRPWMC_XBARFLG1_ADC1_AWD1_FLG             HRPWMC_XBARFLG1_ADC1_AWD1_FLG_Msk                 
#define HRPWMC_XBARFLG1_ADC1_AWD2_FLG_Pos         (21U)
#define HRPWMC_XBARFLG1_ADC1_AWD2_FLG_Msk         (0x1UL<<HRPWMC_XBARFLG1_ADC1_AWD2_FLG_Pos)        /*!< 0x00200000 */
#define HRPWMC_XBARFLG1_ADC1_AWD2_FLG             HRPWMC_XBARFLG1_ADC1_AWD2_FLG_Msk                 
#define HRPWMC_XBARFLG1_ADC1_AWD3_FLG_Pos         (22U)
#define HRPWMC_XBARFLG1_ADC1_AWD3_FLG_Msk         (0x1UL<<HRPWMC_XBARFLG1_ADC1_AWD3_FLG_Pos)        /*!< 0x00400000 */
#define HRPWMC_XBARFLG1_ADC1_AWD3_FLG             HRPWMC_XBARFLG1_ADC1_AWD3_FLG_Msk                 
#define HRPWMC_XBARFLG1_ADC2_AWD1_FLG_Pos         (23U)
#define HRPWMC_XBARFLG1_ADC2_AWD1_FLG_Msk         (0x1UL<<HRPWMC_XBARFLG1_ADC2_AWD1_FLG_Pos)        /*!< 0x00800000 */
#define HRPWMC_XBARFLG1_ADC2_AWD1_FLG             HRPWMC_XBARFLG1_ADC2_AWD1_FLG_Msk                 
#define HRPWMC_XBARFLG1_ADC2_AWD2_FLG_Pos         (24U)
#define HRPWMC_XBARFLG1_ADC2_AWD2_FLG_Msk         (0x1UL<<HRPWMC_XBARFLG1_ADC2_AWD2_FLG_Pos)        /*!< 0x01000000 */
#define HRPWMC_XBARFLG1_ADC2_AWD2_FLG             HRPWMC_XBARFLG1_ADC2_AWD2_FLG_Msk                 
#define HRPWMC_XBARFLG1_ADC2_AWD3_FLG_Pos         (25U)
#define HRPWMC_XBARFLG1_ADC2_AWD3_FLG_Msk         (0x1UL<<HRPWMC_XBARFLG1_ADC2_AWD3_FLG_Pos)        /*!< 0x02000000 */
#define HRPWMC_XBARFLG1_ADC2_AWD3_FLG             HRPWMC_XBARFLG1_ADC2_AWD3_FLG_Msk                 
#define HRPWMC_XBARFLG1_TIM1_OC1_FLG_Pos          (26U)
#define HRPWMC_XBARFLG1_TIM1_OC1_FLG_Msk          (0x1UL<<HRPWMC_XBARFLG1_TIM1_OC1_FLG_Pos)         /*!< 0x04000000 */
#define HRPWMC_XBARFLG1_TIM1_OC1_FLG              HRPWMC_XBARFLG1_TIM1_OC1_FLG_Msk                  
#define HRPWMC_XBARFLG1_TIM1_OC2_FLG_Pos          (27U)
#define HRPWMC_XBARFLG1_TIM1_OC2_FLG_Msk          (0x1UL<<HRPWMC_XBARFLG1_TIM1_OC2_FLG_Pos)         /*!< 0x08000000 */
#define HRPWMC_XBARFLG1_TIM1_OC2_FLG              HRPWMC_XBARFLG1_TIM1_OC2_FLG_Msk                  
#define HRPWMC_XBARFLG1_TIM1_OC3_FLG_Pos          (28U)
#define HRPWMC_XBARFLG1_TIM1_OC3_FLG_Msk          (0x1UL<<HRPWMC_XBARFLG1_TIM1_OC3_FLG_Pos)         /*!< 0x10000000 */
#define HRPWMC_XBARFLG1_TIM1_OC3_FLG              HRPWMC_XBARFLG1_TIM1_OC3_FLG_Msk                  
#define HRPWMC_XBARFLG1_TIM1_OC4_FLG_Pos          (29U)
#define HRPWMC_XBARFLG1_TIM1_OC4_FLG_Msk          (0x1UL<<HRPWMC_XBARFLG1_TIM1_OC4_FLG_Pos)         /*!< 0x20000000 */
#define HRPWMC_XBARFLG1_TIM1_OC4_FLG              HRPWMC_XBARFLG1_TIM1_OC4_FLG_Msk                  
#define HRPWMC_XBARFLG1_TIM1_OC5_FLG_Pos          (30U)
#define HRPWMC_XBARFLG1_TIM1_OC5_FLG_Msk          (0x1UL<<HRPWMC_XBARFLG1_TIM1_OC5_FLG_Pos)         /*!< 0x40000000 */
#define HRPWMC_XBARFLG1_TIM1_OC5_FLG              HRPWMC_XBARFLG1_TIM1_OC5_FLG_Msk                  
#define HRPWMC_XBARFLG1_TIM1_OC6_FLG_Pos          (31U)
#define HRPWMC_XBARFLG1_TIM1_OC6_FLG_Msk          (0x1UL<<HRPWMC_XBARFLG1_TIM1_OC6_FLG_Pos)         /*!< 0x80000000 */
#define HRPWMC_XBARFLG1_TIM1_OC6_FLG              HRPWMC_XBARFLG1_TIM1_OC6_FLG_Msk                  

