breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for HRPWMC_XBARFLG2 register **************************************/
#define HRPWMC_XBARFLG2_TIM2_OC1_FLG_Pos          (0U)
#define HRPWMC_XBARFLG2_TIM2_OC1_FLG_Msk          (0x1UL<<HRPWMC_XBARFLG2_TIM2_OC1_FLG_Pos)         /*!< 0x00000001 */
#define HRPWMC_XBARFLG2_TIM2_OC1_FLG              HRPWMC_XBARFLG2_TIM2_OC1_FLG_Msk                  
#define HRPWMC_XBARFLG2_TIM2_OC2_FLG_Pos          (1U)
#define HRPWMC_XBARFLG2_TIM2_OC2_FLG_Msk          (0x1UL<<HRPWMC_XBARFLG2_TIM2_OC2_FLG_Pos)         /*!< 0x00000002 */
#define HRPWMC_XBARFLG2_TIM2_OC2_FLG              HRPWMC_XBARFLG2_TIM2_OC2_FLG_Msk                  
#define HRPWMC_XBARFLG2_TIM2_OC3_FLG_Pos          (2U)
#define HRPWMC_XBARFLG2_TIM2_OC3_FLG_Msk          (0x1UL<<HRPWMC_XBARFLG2_TIM2_OC3_FLG_Pos)         /*!< 0x00000004 */
#define HRPWMC_XBARFLG2_TIM2_OC3_FLG              HRPWMC_XBARFLG2_TIM2_OC3_FLG_Msk                  
#define HRPWMC_XBARFLG2_TIM2_OC4_FLG_Pos          (3U)
#define HRPWMC_XBARFLG2_TIM2_OC4_FLG_Msk          (0x1UL<<HRPWMC_XBARFLG2_TIM2_OC4_FLG_Pos)         /*!< 0x00000008 */
#define HRPWMC_XBARFLG2_TIM2_OC4_FLG              HRPWMC_XBARFLG2_TIM2_OC4_FLG_Msk                  
#define HRPWMC_XBARFLG2_TIM3_OC1_FLG_Pos          (4U)
#define HRPWMC_XBARFLG2_TIM3_OC1_FLG_Msk          (0x1UL<<HRPWMC_XBARFLG2_TIM3_OC1_FLG_Pos)         /*!< 0x00000010 */
#define HRPWMC_XBARFLG2_TIM3_OC1_FLG              HRPWMC_XBARFLG2_TIM3_OC1_FLG_Msk                  
#define HRPWMC_XBARFLG2_TIM3_OC2_FLG_Pos          (5U)
#define HRPWMC_XBARFLG2_TIM3_OC2_FLG_Msk          (0x1UL<<HRPWMC_XBARFLG2_TIM3_OC2_FLG_Pos)         /*!< 0x00000020 */
#define HRPWMC_XBARFLG2_TIM3_OC2_FLG              HRPWMC_XBARFLG2_TIM3_OC2_FLG_Msk                  
#define HRPWMC_XBARFLG2_TIM3_OC3_FLG_Pos          (6U)
#define HRPWMC_XBARFLG2_TIM3_OC3_FLG_Msk          (0x1UL<<HRPWMC_XBARFLG2_TIM3_OC3_FLG_Pos)         /*!< 0x00000040 */
#define HRPWMC_XBARFLG2_TIM3_OC3_FLG              HRPWMC_XBARFLG2_TIM3_OC3_FLG_Msk                  
#define HRPWMC_XBARFLG2_TIM3_OC4_FLG_Pos          (7U)
#define HRPWMC_XBARFLG2_TIM3_OC4_FLG_Msk          (0x1UL<<HRPWMC_XBARFLG2_TIM3_OC4_FLG_Pos)         /*!< 0x00000080 */
#define HRPWMC_XBARFLG2_TIM3_OC4_FLG              HRPWMC_XBARFLG2_TIM3_OC4_FLG_Msk                  
#define HRPWMC_XBARFLG2_TIM8_OC1_FLG_Pos          (8U)
#define HRPWMC_XBARFLG2_TIM8_OC1_FLG_Msk          (0x1UL<<HRPWMC_XBARFLG2_TIM8_OC1_FLG_Pos)         /*!< 0x00000100 */
#define HRPWMC_XBARFLG2_TIM8_OC1_FLG              HRPWMC_XBARFLG2_TIM8_OC1_FLG_Msk                  
#define HRPWMC_XBARFLG2_TIM8_OC2_FLG_Pos          (9U)
#define HRPWMC_XBARFLG2_TIM8_OC2_FLG_Msk          (0x1UL<<HRPWMC_XBARFLG2_TIM8_OC2_FLG_Pos)         /*!< 0x00000200 */
#define HRPWMC_XBARFLG2_TIM8_OC2_FLG              HRPWMC_XBARFLG2_TIM8_OC2_FLG_Msk                  
#define HRPWMC_XBARFLG2_TIM8_OC3_FLG_Pos          (10U)
#define HRPWMC_XBARFLG2_TIM8_OC3_FLG_Msk          (0x1UL<<HRPWMC_XBARFLG2_TIM8_OC3_FLG_Pos)         /*!< 0x00000400 */
#define HRPWMC_XBARFLG2_TIM8_OC3_FLG              HRPWMC_XBARFLG2_TIM8_OC3_FLG_Msk                  
#define HRPWMC_XBARFLG2_TIM8_OC4_FLG_Pos          (11U)
#define HRPWMC_XBARFLG2_TIM8_OC4_FLG_Msk          (0x1UL<<HRPWMC_XBARFLG2_TIM8_OC4_FLG_Pos)         /*!< 0x00000800 */
#define HRPWMC_XBARFLG2_TIM8_OC4_FLG              HRPWMC_XBARFLG2_TIM8_OC4_FLG_Msk                  
#define HRPWMC_XBARFLG2_TIM8_OC5_FLG_Pos          (12U)
#define HRPWMC_XBARFLG2_TIM8_OC5_FLG_Msk          (0x1UL<<HRPWMC_XBARFLG2_TIM8_OC5_FLG_Pos)         /*!< 0x00001000 */
#define HRPWMC_XBARFLG2_TIM8_OC5_FLG              HRPWMC_XBARFLG2_TIM8_OC5_FLG_Msk                  
#define HRPWMC_XBARFLG2_TIM8_OC6_FLG_Pos          (13U)
#define HRPWMC_XBARFLG2_TIM8_OC6_FLG_Msk          (0x1UL<<HRPWMC_XBARFLG2_TIM8_OC6_FLG_Pos)         /*!< 0x00002000 */
#define HRPWMC_XBARFLG2_TIM8_OC6_FLG              HRPWMC_XBARFLG2_TIM8_OC6_FLG_Msk                  
#define HRPWMC_XBARFLG2_HRPWM_SCOUT_FLG_Pos       (14U)
#define HRPWMC_XBARFLG2_HRPWM_SCOUT_FLG_Msk       (0x1UL<<HRPWMC_XBARFLG2_HRPWM_SCOUT_FLG_Pos)      /*!< 0x00004000 */
#define HRPWMC_XBARFLG2_HRPWM_SCOUT_FLG           HRPWMC_XBARFLG2_HRPWM_SCOUT_FLG_Msk               
#define HRPWMC_XBARFLG2_CPUHALT_FLG_Pos           (15U)
#define HRPWMC_XBARFLG2_CPUHALT_FLG_Msk           (0x1UL<<HRPWMC_XBARFLG2_CPUHALT_FLG_Pos)          /*!< 0x00008000 */
#define HRPWMC_XBARFLG2_CPUHALT_FLG               HRPWMC_XBARFLG2_CPUHALT_FLG_Msk                   

/********************************* Bit definition for HRPWMC_XBARCLR1 register **************************************/
#define HRPWMC_XBARCLR1_COMP1_OUT_CLR_Pos         (0U)
#define HRPWMC_XBARCLR1_COMP1_OUT_CLR_Msk         (0x1UL<<HRPWMC_XBARCLR1_COMP1_OUT_CLR_Pos)        /*!< 0x00000001 */
#define HRPWMC_XBARCLR1_COMP1_OUT_CLR             HRPWMC_XBARCLR1_COMP1_OUT_CLR_Msk                 
#define HRPWMC_XBARCLR1_COMP2_OUT_CLR_Pos         (1U)
#define HRPWMC_XBARCLR1_COMP2_OUT_CLR_Msk         (0x1UL<<HRPWMC_XBARCLR1_COMP2_OUT_CLR_Pos)        /*!< 0x00000002 */
#define HRPWMC_XBARCLR1_COMP2_OUT_CLR             HRPWMC_XBARCLR1_COMP2_OUT_CLR_Msk                 
#define HRPWMC_XBARCLR1_COMP3_OUT_CLR_Pos         (2U)
#define HRPWMC_XBARCLR1_COMP3_OUT_CLR_Msk         (0x1UL<<HRPWMC_XBARCLR1_COMP3_OUT_CLR_Pos)        /*!< 0x00000004 */
#define HRPWMC_XBARCLR1_COMP3_OUT_CLR             HRPWMC_XBARCLR1_COMP3_OUT_CLR_Msk                 
#define HRPWMC_XBARCLR1_COMP4_OUT_CLR_Pos         (3U)
#define HRPWMC_XBARCLR1_COMP4_OUT_CLR_Msk         (0x1UL<<HRPWMC_XBARCLR1_COMP4_OUT_CLR_Pos)        /*!< 0x00000008 */
#define HRPWMC_XBARCLR1_COMP4_OUT_CLR             HRPWMC_XBARCLR1_COMP4_OUT_CLR_Msk                 
#define HRPWMC_XBARCLR1_INPUT1_CLR_Pos            (4U)
#define HRPWMC_XBARCLR1_INPUT1_CLR_Msk            (0x1UL<<HRPWMC_XBARCLR1_INPUT1_CLR_Pos)           /*!< 0x00000010 */
#define HRPWMC_XBARCLR1_INPUT1_CLR                HRPWMC_XBARCLR1_INPUT1_CLR_Msk                    
#define HRPWMC_XBARCLR1_INPUT2_CLR_Pos            (5U)
#define HRPWMC_XBARCLR1_INPUT2_CLR_Msk            (0x1UL<<HRPWMC_XBARCLR1_INPUT2_CLR_Pos)           /*!< 0x00000020 */
#define HRPWMC_XBARCLR1_INPUT2_CLR                HRPWMC_XBARCLR1_INPUT2_CLR_Msk                    
#define HRPWMC_XBARCLR1_INPUT3_CLR_Pos            (6U)
#define HRPWMC_XBARCLR1_INPUT3_CLR_Msk            (0x1UL<<HRPWMC_XBARCLR1_INPUT3_CLR_Pos)           /*!< 0x00000040 */
#define HRPWMC_XBARCLR1_INPUT3_CLR                HRPWMC_XBARCLR1_INPUT3_CLR_Msk                    
#define HRPWMC_XBARCLR1_INPUT4_CLR_Pos            (7U)
#define HRPWMC_XBARCLR1_INPUT4_CLR_Msk            (0x1UL<<HRPWMC_XBARCLR1_INPUT4_CLR_Pos)           /*!< 0x00000080 */
#define HRPWMC_XBARCLR1_INPUT4_CLR                HRPWMC_XBARCLR1_INPUT4_CLR_Msk                    
#define HRPWMC_XBARCLR1_INPUT5_CLR_Pos            (8U)
#define HRPWMC_XBARCLR1_INPUT5_CLR_Msk            (0x1UL<<HRPWMC_XBARCLR1_INPUT5_CLR_Pos)           /*!< 0x00000100 */
#define HRPWMC_XBARCLR1_INPUT5_CLR                HRPWMC_XBARCLR1_INPUT5_CLR_Msk                    
#define HRPWMC_XBARCLR1_INPUT6_CLR_Pos            (9U)
#define HRPWMC_XBARCLR1_INPUT6_CLR_Msk            (0x1UL<<HRPWMC_XBARCLR1_INPUT6_CLR_Pos)           /*!< 0x00000200 */
#define HRPWMC_XBARCLR1_INPUT6_CLR                HRPWMC_XBARCLR1_INPUT6_CLR_Msk                    
#define HRPWMC_XBARCLR1_ADCSOCA_CLR_Pos           (10U)
#define HRPWMC_XBARCLR1_ADCSOCA_CLR_Msk           (0x1UL<<HRPWMC_XBARCLR1_ADCSOCA_CLR_Pos)          /*!< 0x00000400 */
#define HRPWMC_XBARCLR1_ADCSOCA_CLR               HRPWMC_XBARCLR1_ADCSOCA_CLR_Msk                   
#define HRPWMC_XBARCLR1_ADCSOCB_CLR_Pos           (11U)
#define HRPWMC_XBARCLR1_ADCSOCB_CLR_Msk           (0x1UL<<HRPWMC_XBARCLR1_ADCSOCB_CLR_Pos)          /*!< 0x00000800 */
#define HRPWMC_XBARCLR1_ADCSOCB_CLR               HRPWMC_XBARCLR1_ADCSOCB_CLR_Msk                   
#define HRPWMC_XBARCLR1_INPUT7_CLR_Pos            (12U)
#define HRPWMC_XBARCLR1_INPUT7_CLR_Msk            (0x1UL<<HRPWMC_XBARCLR1_INPUT7_CLR_Pos)           /*!< 0x00001000 */
#define HRPWMC_XBARCLR1_INPUT7_CLR                HRPWMC_XBARCLR1_INPUT7_CLR_Msk                    
#define HRPWMC_XBARCLR1_INPUT8_CLR_Pos            (13U)
#define HRPWMC_XBARCLR1_INPUT8_CLR_Msk            (0x1UL<<HRPWMC_XBARCLR1_INPUT8_CLR_Pos)           /*!< 0x00002000 */
#define HRPWMC_XBARCLR1_INPUT8_CLR                HRPWMC_XBARCLR1_INPUT8_CLR_Msk                    
#define HRPWMC_XBARCLR1_INPUT9_CLR_Pos            (14U)
#define HRPWMC_XBARCLR1_INPUT9_CLR_Msk            (0x1UL<<HRPWMC_XBARCLR1_INPUT9_CLR_Pos)           /*!< 0x00004000 */
#define HRPWMC_XBARCLR1_INPUT9_CLR                HRPWMC_XBARCLR1_INPUT9_CLR_Msk                    
#define HRPWMC_XBARCLR1_INPUT10_CLR_Pos           (15U)
#define HRPWMC_XBARCLR1_INPUT10_CLR_Msk           (0x1UL<<HRPWMC_XBARCLR1_INPUT10_CLR_Pos)          /*!< 0x00008000 */
#define HRPWMC_XBARCLR1_INPUT10_CLR               HRPWMC_XBARCLR1_INPUT10_CLR_Msk                   
#define HRPWMC_XBARCLR1_INPUT11_CLR_Pos           (16U)
#define HRPWMC_XBARCLR1_INPUT11_CLR_Msk           (0x1UL<<HRPWMC_XBARCLR1_INPUT11_CLR_Pos)          /*!< 0x00010000 */
#define HRPWMC_XBARCLR1_INPUT11_CLR               HRPWMC_XBARCLR1_INPUT11_CLR_Msk                   
#define HRPWMC_XBARCLR1_INPUT12_CLR_Pos           (17U)
#define HRPWMC_XBARCLR1_INPUT12_CLR_Msk           (0x1UL<<HRPWMC_XBARCLR1_INPUT12_CLR_Pos)          /*!< 0x00020000 */
#define HRPWMC_XBARCLR1_INPUT12_CLR               HRPWMC_XBARCLR1_INPUT12_CLR_Msk                   
#define HRPWMC_XBARCLR1_INPUT13_CLR_Pos           (18U)
#define HRPWMC_XBARCLR1_INPUT13_CLR_Msk           (0x1UL<<HRPWMC_XBARCLR1_INPUT13_CLR_Pos)          /*!< 0x00040000 */
#define HRPWMC_XBARCLR1_INPUT13_CLR               HRPWMC_XBARCLR1_INPUT13_CLR_Msk                   
#define HRPWMC_XBARCLR1_INPUT14_CLR_Pos           (19U)
#define HRPWMC_XBARCLR1_INPUT14_CLR_Msk           (0x1UL<<HRPWMC_XBARCLR1_INPUT14_CLR_Pos)          /*!< 0x00080000 */
#define HRPWMC_XBARCLR1_INPUT14_CLR               HRPWMC_XBARCLR1_INPUT14_CLR_Msk                   
#define HRPWMC_XBARCLR1_ADC1_AWD1_CLR_Pos         (20U)
#define HRPWMC_XBARCLR1_ADC1_AWD1_CLR_Msk         (0x1UL<<HRPWMC_XBARCLR1_ADC1_AWD1_CLR_Pos)        /*!< 0x00100000 */
#define HRPWMC_XBARCLR1_ADC1_AWD1_CLR             HRPWMC_XBARCLR1_ADC1_AWD1_CLR_Msk                 
#define HRPWMC_XBARCLR1_ADC1_AWD2_CLR_Pos         (21U)
#define HRPWMC_XBARCLR1_ADC1_AWD2_CLR_Msk         (0x1UL<<HRPWMC_XBARCLR1_ADC1_AWD2_CLR_Pos)        /*!< 0x00200000 */
#define HRPWMC_XBARCLR1_ADC1_AWD2_CLR             HRPWMC_XBARCLR1_ADC1_AWD2_CLR_Msk                 
#define HRPWMC_XBARCLR1_ADC1_AWD3_CLR_Pos         (22U)
#define HRPWMC_XBARCLR1_ADC1_AWD3_CLR_Msk         (0x1UL<<HRPWMC_XBARCLR1_ADC1_AWD3_CLR_Pos)        /*!< 0x00400000 */
#define HRPWMC_XBARCLR1_ADC1_AWD3_CLR             HRPWMC_XBARCLR1_ADC1_AWD3_CLR_Msk                 
#define HRPWMC_XBARCLR1_ADC2_AWD1_CLR_Pos         (23U)
#define HRPWMC_XBARCLR1_ADC2_AWD1_CLR_Msk         (0x1UL<<HRPWMC_XBARCLR1_ADC2_AWD1_CLR_Pos)        /*!< 0x00800000 */
#define HRPWMC_XBARCLR1_ADC2_AWD1_CLR             HRPWMC_XBARCLR1_ADC2_AWD1_CLR_Msk                 
#define HRPWMC_XBARCLR1_ADC2_AWD2_CLR_Pos         (24U)
#define HRPWMC_XBARCLR1_ADC2_AWD2_CLR_Msk         (0x1UL<<HRPWMC_XBARCLR1_ADC2_AWD2_CLR_Pos)        /*!< 0x01000000 */
#define HRPWMC_XBARCLR1_ADC2_AWD2_CLR             HRPWMC_XBARCLR1_ADC2_AWD2_CLR_Msk                 
#define HRPWMC_XBARCLR1_ADC2_AWD3_CLR_Pos         (25U)
#define HRPWMC_XBARCLR1_ADC2_AWD3_CLR_Msk         (0x1UL<<HRPWMC_XBARCLR1_ADC2_AWD3_CLR_Pos)        /*!< 0x02000000 */
#define HRPWMC_XBARCLR1_ADC2_AWD3_CLR             HRPWMC_XBARCLR1_ADC2_AWD3_CLR_Msk                 
#define HRPWMC_XBARCLR1_TIM1_OC1_CLR_Pos          (26U)
#define HRPWMC_XBARCLR1_TIM1_OC1_CLR_Msk          (0x1UL<<HRPWMC_XBARCLR1_TIM1_OC1_CLR_Pos)         /*!< 0x04000000 */
#define HRPWMC_XBARCLR1_TIM1_OC1_CLR              HRPWMC_XBARCLR1_TIM1_OC1_CLR_Msk                  
#define HRPWMC_XBARCLR1_TIM1_OC2_CLR_Pos          (27U)
#define HRPWMC_XBARCLR1_TIM1_OC2_CLR_Msk          (0x1UL<<HRPWMC_XBARCLR1_TIM1_OC2_CLR_Pos)         /*!< 0x08000000 */
#define HRPWMC_XBARCLR1_TIM1_OC2_CLR              HRPWMC_XBARCLR1_TIM1_OC2_CLR_Msk                  
#define HRPWMC_XBARCLR1_TIM1_OC3_CLR_Pos          (28U)
#define HRPWMC_XBARCLR1_TIM1_OC3_CLR_Msk          (0x1UL<<HRPWMC_XBARCLR1_TIM1_OC3_CLR_Pos)         /*!< 0x10000000 */
#define HRPWMC_XBARCLR1_TIM1_OC3_CLR              HRPWMC_XBARCLR1_TIM1_OC3_CLR_Msk                  
#define HRPWMC_XBARCLR1_TIM1_OC4_CLR_Pos          (29U)
#define HRPWMC_XBARCLR1_TIM1_OC4_CLR_Msk          (0x1UL<<HRPWMC_XBARCLR1_TIM1_OC4_CLR_Pos)         /*!< 0x20000000 */
#define HRPWMC_XBARCLR1_TIM1_OC4_CLR              HRPWMC_XBARCLR1_TIM1_OC4_CLR_Msk                  
#define HRPWMC_XBARCLR1_TIM1_OC5_CLR_Pos          (30U)
#define HRPWMC_XBARCLR1_TIM1_OC5_CLR_Msk          (0x1UL<<HRPWMC_XBARCLR1_TIM1_OC5_CLR_Pos)         /*!< 0x40000000 */
#define HRPWMC_XBARCLR1_TIM1_OC5_CLR              HRPWMC_XBARCLR1_TIM1_OC5_CLR_Msk                  
#define HRPWMC_XBARCLR1_TIM1_OC6_CLR_Pos          (31U)
#define HRPWMC_XBARCLR1_TIM1_OC6_CLR_Msk          (0x1UL<<HRPWMC_XBARCLR1_TIM1_OC6_CLR_Pos)         /*!< 0x80000000 */
#define HRPWMC_XBARCLR1_TIM1_OC6_CLR              HRPWMC_XBARCLR1_TIM1_OC6_CLR_Msk                  

/********************************* Bit definition for HRPWMC_XBARCLR2 register **************************************/
#define HRPWMC_XBARCLR2_TIM2_OC1_CLR_Pos          (0U)
#define HRPWMC_XBARCLR2_TIM2_OC1_CLR_Msk          (0x1UL<<HRPWMC_XBARCLR2_TIM2_OC1_CLR_Pos)         /*!< 0x00000001 */
#define HRPWMC_XBARCLR2_TIM2_OC1_CLR              HRPWMC_XBARCLR2_TIM2_OC1_CLR_Msk                  
#define HRPWMC_XBARCLR2_TIM2_OC2_CLR_Pos          (1U)
#define HRPWMC_XBARCLR2_TIM2_OC2_CLR_Msk          (0x1UL<<HRPWMC_XBARCLR2_TIM2_OC2_CLR_Pos)         /*!< 0x00000002 */
#define HRPWMC_XBARCLR2_TIM2_OC2_CLR              HRPWMC_XBARCLR2_TIM2_OC2_CLR_Msk                  
#define HRPWMC_XBARCLR2_TIM2_OC3_CLR_Pos          (2U)
#define HRPWMC_XBARCLR2_TIM2_OC3_CLR_Msk          (0x1UL<<HRPWMC_XBARCLR2_TIM2_OC3_CLR_Pos)         /*!< 0x00000004 */
#define HRPWMC_XBARCLR2_TIM2_OC3_CLR              HRPWMC_XBARCLR2_TIM2_OC3_CLR_Msk                  
#define HRPWMC_XBARCLR2_TIM2_OC4_CLR_Pos          (3U)
#define HRPWMC_XBARCLR2_TIM2_OC4_CLR_Msk          (0x1UL<<HRPWMC_XBARCLR2_TIM2_OC4_CLR_Pos)         /*!< 0x00000008 */
#define HRPWMC_XBARCLR2_TIM2_OC4_CLR              HRPWMC_XBARCLR2_TIM2_OC4_CLR_Msk                  
#define HRPWMC_XBARCLR2_TIM3_OC1_CLR_Pos          (4U)
#define HRPWMC_XBARCLR2_TIM3_OC1_CLR_Msk          (0x1UL<<HRPWMC_XBARCLR2_TIM3_OC1_CLR_Pos)         /*!< 0x00000010 */
#define HRPWMC_XBARCLR2_TIM3_OC1_CLR              HRPWMC_XBARCLR2_TIM3_OC1_CLR_Msk                  
#define HRPWMC_XBARCLR2_TIM3_OC2_CLR_Pos          (5U)
#define HRPWMC_XBARCLR2_TIM3_OC2_CLR_Msk          (0x1UL<<HRPWMC_XBARCLR2_TIM3_OC2_CLR_Pos)         /*!< 0x00000020 */
#define HRPWMC_XBARCLR2_TIM3_OC2_CLR              HRPWMC_XBARCLR2_TIM3_OC2_CLR_Msk                  
#define HRPWMC_XBARCLR2_TIM3_OC3_CLR_Pos          (6U)
#define HRPWMC_XBARCLR2_TIM3_OC3_CLR_Msk          (0x1UL<<HRPWMC_XBARCLR2_TIM3_OC3_CLR_Pos)         /*!< 0x00000040 */
#define HRPWMC_XBARCLR2_TIM3_OC3_CLR              HRPWMC_XBARCLR2_TIM3_OC3_CLR_Msk                  
#define HRPWMC_XBARCLR2_TIM3_OC4_CLR_Pos          (7U)
#define HRPWMC_XBARCLR2_TIM3_OC4_CLR_Msk          (0x1UL<<HRPWMC_XBARCLR2_TIM3_OC4_CLR_Pos)         /*!< 0x00000080 */
#define HRPWMC_XBARCLR2_TIM3_OC4_CLR              HRPWMC_XBARCLR2_TIM3_OC4_CLR_Msk                  
#define HRPWMC_XBARCLR2_TIM8_OC1_CLR_Pos          (8U)
#define HRPWMC_XBARCLR2_TIM8_OC1_CLR_Msk          (0x1UL<<HRPWMC_XBARCLR2_TIM8_OC1_CLR_Pos)         /*!< 0x00000100 */
#define HRPWMC_XBARCLR2_TIM8_OC1_CLR              HRPWMC_XBARCLR2_TIM8_OC1_CLR_Msk                  
#define HRPWMC_XBARCLR2_TIM8_OC2_CLR_Pos          (9U)
#define HRPWMC_XBARCLR2_TIM8_OC2_CLR_Msk          (0x1UL<<HRPWMC_XBARCLR2_TIM8_OC2_CLR_Pos)         /*!< 0x00000200 */
#define HRPWMC_XBARCLR2_TIM8_OC2_CLR              HRPWMC_XBARCLR2_TIM8_OC2_CLR_Msk                  
#define HRPWMC_XBARCLR2_TIM8_OC3_CLR_Pos          (10U)
#define HRPWMC_XBARCLR2_TIM8_OC3_CLR_Msk          (0x1UL<<HRPWMC_XBARCLR2_TIM8_OC3_CLR_Pos)         /*!< 0x00000400 */
#define HRPWMC_XBARCLR2_TIM8_OC3_CLR              HRPWMC_XBARCLR2_TIM8_OC3_CLR_Msk                  
#define HRPWMC_XBARCLR2_TIM8_OC4_CLR_Pos          (11U)
#define HRPWMC_XBARCLR2_TIM8_OC4_CLR_Msk          (0x1UL<<HRPWMC_XBARCLR2_TIM8_OC4_CLR_Pos)         /*!< 0x00000800 */
#define HRPWMC_XBARCLR2_TIM8_OC4_CLR              HRPWMC_XBARCLR2_TIM8_OC4_CLR_Msk                  
#define HRPWMC_XBARCLR2_TIM8_OC5_CLR_Pos          (12U)
#define HRPWMC_XBARCLR2_TIM8_OC5_CLR_Msk          (0x1UL<<HRPWMC_XBARCLR2_TIM8_OC5_CLR_Pos)         /*!< 0x00001000 */
#define HRPWMC_XBARCLR2_TIM8_OC5_CLR              HRPWMC_XBARCLR2_TIM8_OC5_CLR_Msk                  
#define HRPWMC_XBARCLR2_TIM8_OC6_CLR_Pos          (13U)
#define HRPWMC_XBARCLR2_TIM8_OC6_CLR_Msk          (0x1UL<<HRPWMC_XBARCLR2_TIM8_OC6_CLR_Pos)         /*!< 0x00002000 */
#define HRPWMC_XBARCLR2_TIM8_OC6_CLR              HRPWMC_XBARCLR2_TIM8_OC6_CLR_Msk                  
#define HRPWMC_XBARCLR2_HRPWM_SCOUT_CLR_Pos       (14U)
#define HRPWMC_XBARCLR2_HRPWM_SCOUT_CLR_Msk       (0x1UL<<HRPWMC_XBARCLR2_HRPWM_SCOUT_CLR_Pos)      /*!< 0x00004000 */
#define HRPWMC_XBARCLR2_HRPWM_SCOUT_CLR           HRPWMC_XBARCLR2_HRPWM_SCOUT_CLR_Msk               
#define HRPWMC_XBARCLR2_CPUHALT_CLR_Pos           (15U)
#define HRPWMC_XBARCLR2_CPUHALT_CLR_Msk           (0x1UL<<HRPWMC_XBARCLR2_CPUHALT_CLR_Pos)          /*!< 0x00008000 */
#define HRPWMC_XBARCLR2_CPUHALT_CLR               HRPWMC_XBARCLR2_CPUHALT_CLR_Msk                   

/********************************* Bit definition for HRPWMC_FPGA_SFO_DBG register **********************************/
#define HRPWMC_FPGA_SFO_DBG_SFO_DEBUG_Pos         (0U)
#define HRPWMC_FPGA_SFO_DBG_SFO_DEBUG_Msk         (0x7UL<<HRPWMC_FPGA_SFO_DBG_SFO_DEBUG_Pos)        /*!< 0x00000007 */
#define HRPWMC_FPGA_SFO_DBG_SFO_DEBUG             HRPWMC_FPGA_SFO_DBG_SFO_DEBUG_Msk
#define HRPWMC_FPGA_SFO_DBG_SFO_DEBUG_0           (0x1UL<<HRPWMC_FPGA_SFO_DBG_SFO_DEBUG_Pos)        /*!< 0x00000001 */
#define HRPWMC_FPGA_SFO_DBG_SFO_DEBUG_1           (0x2UL<<HRPWMC_FPGA_SFO_DBG_SFO_DEBUG_Pos)        /*!< 0x00000002 */
#define HRPWMC_FPGA_SFO_DBG_SFO_DEBUG_2           (0x4UL<<HRPWMC_FPGA_SFO_DBG_SFO_DEBUG_Pos)        /*!< 0x00000004 */

