breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************************************************************************************************/
/********************************* HRPWM ****************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for HRPWM_TBCTL register ******************************************/
#define HRPWM_TBCTL_CTRMODE_Pos                   (0U)
#define HRPWM_TBCTL_CTRMODE_Msk                   (0x3UL<<HRPWM_TBCTL_CTRMODE_Pos)                  /*!< 0x00000003 */
#define HRPWM_TBCTL_CTRMODE                       HRPWM_TBCTL_CTRMODE_Msk
#define HRPWM_TBCTL_CTRMODE_0                     (0x1UL<<HRPWM_TBCTL_CTRMODE_Pos)                  /*!< 0x00000001 */
#define HRPWM_TBCTL_CTRMODE_1                     (0x2UL<<HRPWM_TBCTL_CTRMODE_Pos)                  /*!< 0x00000002 */
#define HRPWM_TBCTL_PHSEN_Pos                     (2U)
#define HRPWM_TBCTL_PHSEN_Msk                     (0x1UL<<HRPWM_TBCTL_PHSEN_Pos)                    /*!< 0x00000004 */
#define HRPWM_TBCTL_PHSEN                         HRPWM_TBCTL_PHSEN_Msk                             
#define HRPWM_TBCTL_PRDLD_Pos                     (3U)
#define HRPWM_TBCTL_PRDLD_Msk                     (0x1UL<<HRPWM_TBCTL_PRDLD_Pos)                    /*!< 0x00000008 */
#define HRPWM_TBCTL_PRDLD                         HRPWM_TBCTL_PRDLD_Msk                             
#define HRPWM_TBCTL_SYNCOSEL_Pos                  (4U)
#define HRPWM_TBCTL_SYNCOSEL_Msk                  (0x3UL<<HRPWM_TBCTL_SYNCOSEL_Pos)                 /*!< 0x00000030 */
#define HRPWM_TBCTL_SYNCOSEL                      HRPWM_TBCTL_SYNCOSEL_Msk
#define HRPWM_TBCTL_SYNCOSEL_0                    (0x1UL<<HRPWM_TBCTL_SYNCOSEL_Pos)                 /*!< 0x00000010 */
#define HRPWM_TBCTL_SYNCOSEL_1                    (0x2UL<<HRPWM_TBCTL_SYNCOSEL_Pos)                 /*!< 0x00000020 */
#define HRPWM_TBCTL_SWFSYNC_Pos                   (6U)
#define HRPWM_TBCTL_SWFSYNC_Msk                   (0x1UL<<HRPWM_TBCTL_SWFSYNC_Pos)                  /*!< 0x00000040 */
#define HRPWM_TBCTL_SWFSYNC                       HRPWM_TBCTL_SWFSYNC_Msk                           
#define HRPWM_TBCTL_HSPCLKDIV_Pos                 (7U)
#define HRPWM_TBCTL_HSPCLKDIV_Msk                 (0x7UL<<HRPWM_TBCTL_HSPCLKDIV_Pos)                /*!< 0x00000380 */
#define HRPWM_TBCTL_HSPCLKDIV                     HRPWM_TBCTL_HSPCLKDIV_Msk
#define HRPWM_TBCTL_HSPCLKDIV_0                   (0x1UL<<HRPWM_TBCTL_HSPCLKDIV_Pos)                /*!< 0x00000080 */
#define HRPWM_TBCTL_HSPCLKDIV_1                   (0x2UL<<HRPWM_TBCTL_HSPCLKDIV_Pos)                /*!< 0x00000100 */
#define HRPWM_TBCTL_HSPCLKDIV_2                   (0x4UL<<HRPWM_TBCTL_HSPCLKDIV_Pos)                /*!< 0x00000200 */
#define HRPWM_TBCTL_CLKDIV_Pos                    (10U)
#define HRPWM_TBCTL_CLKDIV_Msk                    (0x7UL<<HRPWM_TBCTL_CLKDIV_Pos)                   /*!< 0x00001C00 */
#define HRPWM_TBCTL_CLKDIV                        HRPWM_TBCTL_CLKDIV_Msk
#define HRPWM_TBCTL_CLKDIV_0                      (0x1UL<<HRPWM_TBCTL_CLKDIV_Pos)                   /*!< 0x00000400 */
#define HRPWM_TBCTL_CLKDIV_1                      (0x2UL<<HRPWM_TBCTL_CLKDIV_Pos)                   /*!< 0x00000800 */
#define HRPWM_TBCTL_CLKDIV_2                      (0x4UL<<HRPWM_TBCTL_CLKDIV_Pos)                   /*!< 0x00001000 */
#define HRPWM_TBCTL_PHSDIR_Pos                    (13U)
#define HRPWM_TBCTL_PHSDIR_Msk                    (0x1UL<<HRPWM_TBCTL_PHSDIR_Pos)                   /*!< 0x00002000 */
#define HRPWM_TBCTL_PHSDIR                        HRPWM_TBCTL_PHSDIR_Msk                            
#define HRPWM_TBCTL_FREE_SOFT_Pos                 (14U)
#define HRPWM_TBCTL_FREE_SOFT_Msk                 (0x3UL<<HRPWM_TBCTL_FREE_SOFT_Pos)                /*!< 0x0000C000 */
#define HRPWM_TBCTL_FREE_SOFT                     HRPWM_TBCTL_FREE_SOFT_Msk
#define HRPWM_TBCTL_FREE_SOFT_0                   (0x1UL<<HRPWM_TBCTL_FREE_SOFT_Pos)                /*!< 0x00004000 */
#define HRPWM_TBCTL_FREE_SOFT_1                   (0x2UL<<HRPWM_TBCTL_FREE_SOFT_Pos)                /*!< 0x00008000 */

/********************************* Bit definition for HRPWM_TBCTL2 register *****************************************/
#define HRPWM_TBCTL2_OSHTSYNCMODE_Pos             (6U)
#define HRPWM_TBCTL2_OSHTSYNCMODE_Msk             (0x1UL<<HRPWM_TBCTL2_OSHTSYNCMODE_Pos)            /*!< 0x00000040 */
#define HRPWM_TBCTL2_OSHTSYNCMODE                 HRPWM_TBCTL2_OSHTSYNCMODE_Msk                     
#define HRPWM_TBCTL2_OSHTSYNC_Pos                 (7U)
#define HRPWM_TBCTL2_OSHTSYNC_Msk                 (0x1UL<<HRPWM_TBCTL2_OSHTSYNC_Pos)                /*!< 0x00000080 */
#define HRPWM_TBCTL2_OSHTSYNC                     HRPWM_TBCTL2_OSHTSYNC_Msk                         
#define HRPWM_TBCTL2_SYNCOSELX_Pos                (12U)
#define HRPWM_TBCTL2_SYNCOSELX_Msk                (0x3UL<<HRPWM_TBCTL2_SYNCOSELX_Pos)               /*!< 0x00003000 */
#define HRPWM_TBCTL2_SYNCOSELX                    HRPWM_TBCTL2_SYNCOSELX_Msk
#define HRPWM_TBCTL2_SYNCOSELX_0                  (0x1UL<<HRPWM_TBCTL2_SYNCOSELX_Pos)               /*!< 0x00001000 */
#define HRPWM_TBCTL2_SYNCOSELX_1                  (0x2UL<<HRPWM_TBCTL2_SYNCOSELX_Pos)               /*!< 0x00002000 */
#define HRPWM_TBCTL2_PRDLDSYNC_Pos                (14U)
#define HRPWM_TBCTL2_PRDLDSYNC_Msk                (0x3UL<<HRPWM_TBCTL2_PRDLDSYNC_Pos)               /*!< 0x0000C000 */
#define HRPWM_TBCTL2_PRDLDSYNC                    HRPWM_TBCTL2_PRDLDSYNC_Msk
#define HRPWM_TBCTL2_PRDLDSYNC_0                  (0x1UL<<HRPWM_TBCTL2_PRDLDSYNC_Pos)               /*!< 0x00004000 */
#define HRPWM_TBCTL2_PRDLDSYNC_1                  (0x2UL<<HRPWM_TBCTL2_PRDLDSYNC_Pos)               /*!< 0x00008000 */

/********************************* Bit definition for HRPWM_TBCTR register ******************************************/
#define HRPWM_TBCTR_TBCTR_Pos                     (0U)
#define HRPWM_TBCTR_TBCTR_Msk                     (0xFFFFUL<<HRPWM_TBCTR_TBCTR_Pos)                 /*!< 0x0000FFFF */
#define HRPWM_TBCTR_TBCTR                         HRPWM_TBCTR_TBCTR_Msk

/********************************* Bit definition for HRPWM_TBSTS register ******************************************/
#define HRPWM_TBSTS_CTRDIR_Pos                    (0U)
#define HRPWM_TBSTS_CTRDIR_Msk                    (0x1UL<<HRPWM_TBSTS_CTRDIR_Pos)                   /*!< 0x00000001 */
#define HRPWM_TBSTS_CTRDIR                        HRPWM_TBSTS_CTRDIR_Msk                            
#define HRPWM_TBSTS_SYNCI_Pos                     (1U)
#define HRPWM_TBSTS_SYNCI_Msk                     (0x1UL<<HRPWM_TBSTS_SYNCI_Pos)                    /*!< 0x00000002 */
#define HRPWM_TBSTS_SYNCI                         HRPWM_TBSTS_SYNCI_Msk                             
#define HRPWM_TBSTS_CTRMAX_Pos                    (2U)
#define HRPWM_TBSTS_CTRMAX_Msk                    (0x1UL<<HRPWM_TBSTS_CTRMAX_Pos)                   /*!< 0x00000004 */
#define HRPWM_TBSTS_CTRMAX                        HRPWM_TBSTS_CTRMAX_Msk                            

/********************************* Bit definition for HRPWM_CMPCTL register *****************************************/
#define HRPWM_CMPCTL_LOADAMODE_Pos                (0U)
#define HRPWM_CMPCTL_LOADAMODE_Msk                (0x3UL<<HRPWM_CMPCTL_LOADAMODE_Pos)               /*!< 0x00000003 */
#define HRPWM_CMPCTL_LOADAMODE                    HRPWM_CMPCTL_LOADAMODE_Msk
#define HRPWM_CMPCTL_LOADAMODE_0                  (0x1UL<<HRPWM_CMPCTL_LOADAMODE_Pos)               /*!< 0x00000001 */
#define HRPWM_CMPCTL_LOADAMODE_1                  (0x2UL<<HRPWM_CMPCTL_LOADAMODE_Pos)               /*!< 0x00000002 */
#define HRPWM_CMPCTL_LOADBMODE_Pos                (2U)
#define HRPWM_CMPCTL_LOADBMODE_Msk                (0x3UL<<HRPWM_CMPCTL_LOADBMODE_Pos)               /*!< 0x0000000C */
#define HRPWM_CMPCTL_LOADBMODE                    HRPWM_CMPCTL_LOADBMODE_Msk
#define HRPWM_CMPCTL_LOADBMODE_0                  (0x1UL<<HRPWM_CMPCTL_LOADBMODE_Pos)               /*!< 0x00000004 */
#define HRPWM_CMPCTL_LOADBMODE_1                  (0x2UL<<HRPWM_CMPCTL_LOADBMODE_Pos)               /*!< 0x00000008 */
#define HRPWM_CMPCTL_SHDWAMODE_Pos                (4U)
#define HRPWM_CMPCTL_SHDWAMODE_Msk                (0x1UL<<HRPWM_CMPCTL_SHDWAMODE_Pos)               /*!< 0x00000010 */
#define HRPWM_CMPCTL_SHDWAMODE                    HRPWM_CMPCTL_SHDWAMODE_Msk                        
#define HRPWM_CMPCTL_SHDWBMODE_Pos                (6U)
#define HRPWM_CMPCTL_SHDWBMODE_Msk                (0x1UL<<HRPWM_CMPCTL_SHDWBMODE_Pos)               /*!< 0x00000040 */
#define HRPWM_CMPCTL_SHDWBMODE                    HRPWM_CMPCTL_SHDWBMODE_Msk                        
#define HRPWM_CMPCTL_SHDWAFULL_Pos                (8U)
#define HRPWM_CMPCTL_SHDWAFULL_Msk                (0x1UL<<HRPWM_CMPCTL_SHDWAFULL_Pos)               /*!< 0x00000100 */
#define HRPWM_CMPCTL_SHDWAFULL                    HRPWM_CMPCTL_SHDWAFULL_Msk                        
#define HRPWM_CMPCTL_SHDWBFULL_Pos                (9U)
#define HRPWM_CMPCTL_SHDWBFULL_Msk                (0x1UL<<HRPWM_CMPCTL_SHDWBFULL_Pos)               /*!< 0x00000200 */
#define HRPWM_CMPCTL_SHDWBFULL                    HRPWM_CMPCTL_SHDWBFULL_Msk                        
#define HRPWM_CMPCTL_LOADASYNC_Pos                (10U)
#define HRPWM_CMPCTL_LOADASYNC_Msk                (0x3UL<<HRPWM_CMPCTL_LOADASYNC_Pos)               /*!< 0x00000C00 */
#define HRPWM_CMPCTL_LOADASYNC                    HRPWM_CMPCTL_LOADASYNC_Msk
#define HRPWM_CMPCTL_LOADASYNC_0                  (0x1UL<<HRPWM_CMPCTL_LOADASYNC_Pos)               /*!< 0x00000400 */
#define HRPWM_CMPCTL_LOADASYNC_1                  (0x2UL<<HRPWM_CMPCTL_LOADASYNC_Pos)               /*!< 0x00000800 */
#define HRPWM_CMPCTL_LOADBSYNC_Pos                (12U)
#define HRPWM_CMPCTL_LOADBSYNC_Msk                (0x3UL<<HRPWM_CMPCTL_LOADBSYNC_Pos)               /*!< 0x00003000 */
#define HRPWM_CMPCTL_LOADBSYNC                    HRPWM_CMPCTL_LOADBSYNC_Msk
#define HRPWM_CMPCTL_LOADBSYNC_0                  (0x1UL<<HRPWM_CMPCTL_LOADBSYNC_Pos)               /*!< 0x00001000 */
#define HRPWM_CMPCTL_LOADBSYNC_1                  (0x2UL<<HRPWM_CMPCTL_LOADBSYNC_Pos)               /*!< 0x00002000 */

/********************************* Bit definition for HRPWM_CMPCTL2 register ****************************************/
#define HRPWM_CMPCTL2_LOADCMODE_Pos               (0U)
#define HRPWM_CMPCTL2_LOADCMODE_Msk               (0x3UL<<HRPWM_CMPCTL2_LOADCMODE_Pos)              /*!< 0x00000003 */
#define HRPWM_CMPCTL2_LOADCMODE                   HRPWM_CMPCTL2_LOADCMODE_Msk
#define HRPWM_CMPCTL2_LOADCMODE_0                 (0x1UL<<HRPWM_CMPCTL2_LOADCMODE_Pos)              /*!< 0x00000001 */
#define HRPWM_CMPCTL2_LOADCMODE_1                 (0x2UL<<HRPWM_CMPCTL2_LOADCMODE_Pos)              /*!< 0x00000002 */
#define HRPWM_CMPCTL2_LOADDMODE_Pos               (2U)
#define HRPWM_CMPCTL2_LOADDMODE_Msk               (0x3UL<<HRPWM_CMPCTL2_LOADDMODE_Pos)              /*!< 0x0000000C */
#define HRPWM_CMPCTL2_LOADDMODE                   HRPWM_CMPCTL2_LOADDMODE_Msk
#define HRPWM_CMPCTL2_LOADDMODE_0                 (0x1UL<<HRPWM_CMPCTL2_LOADDMODE_Pos)              /*!< 0x00000004 */
#define HRPWM_CMPCTL2_LOADDMODE_1                 (0x2UL<<HRPWM_CMPCTL2_LOADDMODE_Pos)              /*!< 0x00000008 */
#define HRPWM_CMPCTL2_SHDWCMODE_Pos               (4U)
#define HRPWM_CMPCTL2_SHDWCMODE_Msk               (0x1UL<<HRPWM_CMPCTL2_SHDWCMODE_Pos)              /*!< 0x00000010 */
#define HRPWM_CMPCTL2_SHDWCMODE                   HRPWM_CMPCTL2_SHDWCMODE_Msk                       
#define HRPWM_CMPCTL2_SHDWDMODE_Pos               (6U)
#define HRPWM_CMPCTL2_SHDWDMODE_Msk               (0x1UL<<HRPWM_CMPCTL2_SHDWDMODE_Pos)              /*!< 0x00000040 */
#define HRPWM_CMPCTL2_SHDWDMODE                   HRPWM_CMPCTL2_SHDWDMODE_Msk                       
#define HRPWM_CMPCTL2_LOADCSYNC_Pos               (10U)
#define HRPWM_CMPCTL2_LOADCSYNC_Msk               (0x3UL<<HRPWM_CMPCTL2_LOADCSYNC_Pos)              /*!< 0x00000C00 */
#define HRPWM_CMPCTL2_LOADCSYNC                   HRPWM_CMPCTL2_LOADCSYNC_Msk
#define HRPWM_CMPCTL2_LOADCSYNC_0                 (0x1UL<<HRPWM_CMPCTL2_LOADCSYNC_Pos)              /*!< 0x00000400 */
#define HRPWM_CMPCTL2_LOADCSYNC_1                 (0x2UL<<HRPWM_CMPCTL2_LOADCSYNC_Pos)              /*!< 0x00000800 */
#define HRPWM_CMPCTL2_LOADDSYNC_Pos               (12U)
#define HRPWM_CMPCTL2_LOADDSYNC_Msk               (0x3UL<<HRPWM_CMPCTL2_LOADDSYNC_Pos)              /*!< 0x00003000 */
#define HRPWM_CMPCTL2_LOADDSYNC                   HRPWM_CMPCTL2_LOADDSYNC_Msk
#define HRPWM_CMPCTL2_LOADDSYNC_0                 (0x1UL<<HRPWM_CMPCTL2_LOADDSYNC_Pos)              /*!< 0x00001000 */
#define HRPWM_CMPCTL2_LOADDSYNC_1                 (0x2UL<<HRPWM_CMPCTL2_LOADDSYNC_Pos)              /*!< 0x00002000 */

/********************************* Bit definition for HRPWM_DBCTL register ******************************************/
#define HRPWM_DBCTL_OUT_MODE_Pos                  (0U)
#define HRPWM_DBCTL_OUT_MODE_Msk                  (0x3UL<<HRPWM_DBCTL_OUT_MODE_Pos)                 /*!< 0x00000003 */
#define HRPWM_DBCTL_OUT_MODE                      HRPWM_DBCTL_OUT_MODE_Msk
#define HRPWM_DBCTL_OUT_MODE_0                    (0x1UL<<HRPWM_DBCTL_OUT_MODE_Pos)                 /*!< 0x00000001 */
#define HRPWM_DBCTL_OUT_MODE_1                    (0x2UL<<HRPWM_DBCTL_OUT_MODE_Pos)                 /*!< 0x00000002 */
#define HRPWM_DBCTL_POLSEL_Pos                    (2U)
#define HRPWM_DBCTL_POLSEL_Msk                    (0x3UL<<HRPWM_DBCTL_POLSEL_Pos)                   /*!< 0x0000000C */
#define HRPWM_DBCTL_POLSEL                        HRPWM_DBCTL_POLSEL_Msk
#define HRPWM_DBCTL_POLSEL_0                      (0x1UL<<HRPWM_DBCTL_POLSEL_Pos)                   /*!< 0x00000004 */
#define HRPWM_DBCTL_POLSEL_1                      (0x2UL<<HRPWM_DBCTL_POLSEL_Pos)                   /*!< 0x00000008 */
#define HRPWM_DBCTL_IN_MODE_Pos                   (4U)
#define HRPWM_DBCTL_IN_MODE_Msk                   (0x3UL<<HRPWM_DBCTL_IN_MODE_Pos)                  /*!< 0x00000030 */
#define HRPWM_DBCTL_IN_MODE                       HRPWM_DBCTL_IN_MODE_Msk
#define HRPWM_DBCTL_IN_MODE_0                     (0x1UL<<HRPWM_DBCTL_IN_MODE_Pos)                  /*!< 0x00000010 */
#define HRPWM_DBCTL_IN_MODE_1                     (0x2UL<<HRPWM_DBCTL_IN_MODE_Pos)                  /*!< 0x00000020 */
#define HRPWM_DBCTL_LOADREDMODE_Pos               (6U)
#define HRPWM_DBCTL_LOADREDMODE_Msk               (0x3UL<<HRPWM_DBCTL_LOADREDMODE_Pos)              /*!< 0x000000C0 */
#define HRPWM_DBCTL_LOADREDMODE                   HRPWM_DBCTL_LOADREDMODE_Msk
#define HRPWM_DBCTL_LOADREDMODE_0                 (0x1UL<<HRPWM_DBCTL_LOADREDMODE_Pos)              /*!< 0x00000040 */
#define HRPWM_DBCTL_LOADREDMODE_1                 (0x2UL<<HRPWM_DBCTL_LOADREDMODE_Pos)              /*!< 0x00000080 */
#define HRPWM_DBCTL_LOADFEDMODE_Pos               (8U)
#define HRPWM_DBCTL_LOADFEDMODE_Msk               (0x3UL<<HRPWM_DBCTL_LOADFEDMODE_Pos)              /*!< 0x00000300 */
#define HRPWM_DBCTL_LOADFEDMODE                   HRPWM_DBCTL_LOADFEDMODE_Msk
#define HRPWM_DBCTL_LOADFEDMODE_0                 (0x1UL<<HRPWM_DBCTL_LOADFEDMODE_Pos)              /*!< 0x00000100 */
#define HRPWM_DBCTL_LOADFEDMODE_1                 (0x2UL<<HRPWM_DBCTL_LOADFEDMODE_Pos)              /*!< 0x00000200 */
#define HRPWM_DBCTL_SHDWDBRED_MODE_Pos            (10U)
#define HRPWM_DBCTL_SHDWDBRED_MODE_Msk            (0x1UL<<HRPWM_DBCTL_SHDWDBRED_MODE_Pos)           /*!< 0x00000400 */
#define HRPWM_DBCTL_SHDWDBRED_MODE                HRPWM_DBCTL_SHDWDBRED_MODE_Msk                    
#define HRPWM_DBCTL_SHDWDBFED_MODE_Pos            (11U)
#define HRPWM_DBCTL_SHDWDBFED_MODE_Msk            (0x1UL<<HRPWM_DBCTL_SHDWDBFED_MODE_Pos)           /*!< 0x00000800 */
#define HRPWM_DBCTL_SHDWDBFED_MODE                HRPWM_DBCTL_SHDWDBFED_MODE_Msk                    
#define HRPWM_DBCTL_OUTSWAP_Pos                   (12U)
#define HRPWM_DBCTL_OUTSWAP_Msk                   (0x3UL<<HRPWM_DBCTL_OUTSWAP_Pos)                  /*!< 0x00003000 */
#define HRPWM_DBCTL_OUTSWAP                       HRPWM_DBCTL_OUTSWAP_Msk
#define HRPWM_DBCTL_OUTSWAP_0                     (0x1UL<<HRPWM_DBCTL_OUTSWAP_Pos)                  /*!< 0x00001000 */
#define HRPWM_DBCTL_OUTSWAP_1                     (0x2UL<<HRPWM_DBCTL_OUTSWAP_Pos)                  /*!< 0x00002000 */
#define HRPWM_DBCTL_DEDB_MODE_Pos                 (14U)
#define HRPWM_DBCTL_DEDB_MODE_Msk                 (0x1UL<<HRPWM_DBCTL_DEDB_MODE_Pos)                /*!< 0x00004000 */
#define HRPWM_DBCTL_DEDB_MODE                     HRPWM_DBCTL_DEDB_MODE_Msk                         
#define HRPWM_DBCTL_HALFCYCLE_Pos                 (15U)
#define HRPWM_DBCTL_HALFCYCLE_Msk                 (0x1UL<<HRPWM_DBCTL_HALFCYCLE_Pos)                /*!< 0x00008000 */
#define HRPWM_DBCTL_HALFCYCLE                     HRPWM_DBCTL_HALFCYCLE_Msk                         

/********************************* Bit definition for HRPWM_DBCTL2 register *****************************************/
#define HRPWM_DBCTL2_LOADDBCTLMODE_Pos            (0U)
#define HRPWM_DBCTL2_LOADDBCTLMODE_Msk            (0x3UL<<HRPWM_DBCTL2_LOADDBCTLMODE_Pos)           /*!< 0x00000003 */
#define HRPWM_DBCTL2_LOADDBCTLMODE                HRPWM_DBCTL2_LOADDBCTLMODE_Msk
#define HRPWM_DBCTL2_LOADDBCTLMODE_0              (0x1UL<<HRPWM_DBCTL2_LOADDBCTLMODE_Pos)           /*!< 0x00000001 */
#define HRPWM_DBCTL2_LOADDBCTLMODE_1              (0x2UL<<HRPWM_DBCTL2_LOADDBCTLMODE_Pos)           /*!< 0x00000002 */
#define HRPWM_DBCTL2_SHDWDBCTLMODE_Pos            (2U)
#define HRPWM_DBCTL2_SHDWDBCTLMODE_Msk            (0x1UL<<HRPWM_DBCTL2_SHDWDBCTLMODE_Pos)           /*!< 0x00000004 */
#define HRPWM_DBCTL2_SHDWDBCTLMODE                HRPWM_DBCTL2_SHDWDBCTLMODE_Msk                    

/********************************* Bit definition for HRPWM_AQCTL register ******************************************/
#define HRPWM_AQCTL_LDAQAMODE_Pos                 (0U)
#define HRPWM_AQCTL_LDAQAMODE_Msk                 (0x3UL<<HRPWM_AQCTL_LDAQAMODE_Pos)                /*!< 0x00000003 */
#define HRPWM_AQCTL_LDAQAMODE                     HRPWM_AQCTL_LDAQAMODE_Msk
#define HRPWM_AQCTL_LDAQAMODE_0                   (0x1UL<<HRPWM_AQCTL_LDAQAMODE_Pos)                /*!< 0x00000001 */
#define HRPWM_AQCTL_LDAQAMODE_1                   (0x2UL<<HRPWM_AQCTL_LDAQAMODE_Pos)                /*!< 0x00000002 */
#define HRPWM_AQCTL_LDAQBMODE_Pos                 (2U)
#define HRPWM_AQCTL_LDAQBMODE_Msk                 (0x3UL<<HRPWM_AQCTL_LDAQBMODE_Pos)                /*!< 0x0000000C */
#define HRPWM_AQCTL_LDAQBMODE                     HRPWM_AQCTL_LDAQBMODE_Msk
#define HRPWM_AQCTL_LDAQBMODE_0                   (0x1UL<<HRPWM_AQCTL_LDAQBMODE_Pos)                /*!< 0x00000004 */
#define HRPWM_AQCTL_LDAQBMODE_1                   (0x2UL<<HRPWM_AQCTL_LDAQBMODE_Pos)                /*!< 0x00000008 */
#define HRPWM_AQCTL_SHDWAQAMODE_Pos               (4U)
#define HRPWM_AQCTL_SHDWAQAMODE_Msk               (0x1UL<<HRPWM_AQCTL_SHDWAQAMODE_Pos)              /*!< 0x00000010 */
#define HRPWM_AQCTL_SHDWAQAMODE                   HRPWM_AQCTL_SHDWAQAMODE_Msk                       
#define HRPWM_AQCTL_SHDWAQBMODE_Pos               (6U)
#define HRPWM_AQCTL_SHDWAQBMODE_Msk               (0x1UL<<HRPWM_AQCTL_SHDWAQBMODE_Pos)              /*!< 0x00000040 */
#define HRPWM_AQCTL_SHDWAQBMODE                   HRPWM_AQCTL_SHDWAQBMODE_Msk                       
#define HRPWM_AQCTL_LDAQASYNC_Pos                 (8U)
#define HRPWM_AQCTL_LDAQASYNC_Msk                 (0x3UL<<HRPWM_AQCTL_LDAQASYNC_Pos)                /*!< 0x00000300 */
#define HRPWM_AQCTL_LDAQASYNC                     HRPWM_AQCTL_LDAQASYNC_Msk
#define HRPWM_AQCTL_LDAQASYNC_0                   (0x1UL<<HRPWM_AQCTL_LDAQASYNC_Pos)                /*!< 0x00000100 */
#define HRPWM_AQCTL_LDAQASYNC_1                   (0x2UL<<HRPWM_AQCTL_LDAQASYNC_Pos)                /*!< 0x00000200 */
#define HRPWM_AQCTL_LDAQBSYNC_Pos                 (10U)
#define HRPWM_AQCTL_LDAQBSYNC_Msk                 (0x3UL<<HRPWM_AQCTL_LDAQBSYNC_Pos)                /*!< 0x00000C00 */
#define HRPWM_AQCTL_LDAQBSYNC                     HRPWM_AQCTL_LDAQBSYNC_Msk
#define HRPWM_AQCTL_LDAQBSYNC_0                   (0x1UL<<HRPWM_AQCTL_LDAQBSYNC_Pos)                /*!< 0x00000400 */
#define HRPWM_AQCTL_LDAQBSYNC_1                   (0x2UL<<HRPWM_AQCTL_LDAQBSYNC_Pos)                /*!< 0x00000800 */

/********************************* Bit definition for HRPWM_AQTSRCSEL register **************************************/
#define HRPWM_AQTSRCSEL_T1SEL_Pos                 (0U)
#define HRPWM_AQTSRCSEL_T1SEL_Msk                 (0xFUL<<HRPWM_AQTSRCSEL_T1SEL_Pos)                /*!< 0x0000000F */
#define HRPWM_AQTSRCSEL_T1SEL                     HRPWM_AQTSRCSEL_T1SEL_Msk
#define HRPWM_AQTSRCSEL_T1SEL_0                   (0x1UL<<HRPWM_AQTSRCSEL_T1SEL_Pos)                /*!< 0x00000001 */
#define HRPWM_AQTSRCSEL_T1SEL_1                   (0x2UL<<HRPWM_AQTSRCSEL_T1SEL_Pos)                /*!< 0x00000002 */
#define HRPWM_AQTSRCSEL_T1SEL_2                   (0x4UL<<HRPWM_AQTSRCSEL_T1SEL_Pos)                /*!< 0x00000004 */
#define HRPWM_AQTSRCSEL_T1SEL_3                   (0x8UL<<HRPWM_AQTSRCSEL_T1SEL_Pos)                /*!< 0x00000008 */
#define HRPWM_AQTSRCSEL_T2SEL_Pos                 (4U)
#define HRPWM_AQTSRCSEL_T2SEL_Msk                 (0xFUL<<HRPWM_AQTSRCSEL_T2SEL_Pos)                /*!< 0x000000F0 */
#define HRPWM_AQTSRCSEL_T2SEL                     HRPWM_AQTSRCSEL_T2SEL_Msk
#define HRPWM_AQTSRCSEL_T2SEL_0                   (0x1UL<<HRPWM_AQTSRCSEL_T2SEL_Pos)                /*!< 0x00000010 */
#define HRPWM_AQTSRCSEL_T2SEL_1                   (0x2UL<<HRPWM_AQTSRCSEL_T2SEL_Pos)                /*!< 0x00000020 */
#define HRPWM_AQTSRCSEL_T2SEL_2                   (0x4UL<<HRPWM_AQTSRCSEL_T2SEL_Pos)                /*!< 0x00000040 */
#define HRPWM_AQTSRCSEL_T2SEL_3                   (0x8UL<<HRPWM_AQTSRCSEL_T2SEL_Pos)                /*!< 0x00000080 */

