breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for HRPWM_PCCTL register ******************************************/
#define HRPWM_PCCTL_CHPEN_Pos                     (0U)
#define HRPWM_PCCTL_CHPEN_Msk                     (0x1UL<<HRPWM_PCCTL_CHPEN_Pos)                    /*!< 0x00000001 */
#define HRPWM_PCCTL_CHPEN                         HRPWM_PCCTL_CHPEN_Msk                             
#define HRPWM_PCCTL_OSHTWTH_Pos                   (1U)
#define HRPWM_PCCTL_OSHTWTH_Msk                   (0xFUL<<HRPWM_PCCTL_OSHTWTH_Pos)                  /*!< 0x0000001E */
#define HRPWM_PCCTL_OSHTWTH                       HRPWM_PCCTL_OSHTWTH_Msk
#define HRPWM_PCCTL_OSHTWTH_0                     (0x1UL<<HRPWM_PCCTL_OSHTWTH_Pos)                  /*!< 0x00000002 */
#define HRPWM_PCCTL_OSHTWTH_1                     (0x2UL<<HRPWM_PCCTL_OSHTWTH_Pos)                  /*!< 0x00000004 */
#define HRPWM_PCCTL_OSHTWTH_2                     (0x4UL<<HRPWM_PCCTL_OSHTWTH_Pos)                  /*!< 0x00000008 */
#define HRPWM_PCCTL_OSHTWTH_3                     (0x8UL<<HRPWM_PCCTL_OSHTWTH_Pos)                  /*!< 0x00000010 */
#define HRPWM_PCCTL_CHPFREQ_Pos                   (5U)
#define HRPWM_PCCTL_CHPFREQ_Msk                   (0x7UL<<HRPWM_PCCTL_CHPFREQ_Pos)                  /*!< 0x000000E0 */
#define HRPWM_PCCTL_CHPFREQ                       HRPWM_PCCTL_CHPFREQ_Msk
#define HRPWM_PCCTL_CHPFREQ_0                     (0x1UL<<HRPWM_PCCTL_CHPFREQ_Pos)                  /*!< 0x00000020 */
#define HRPWM_PCCTL_CHPFREQ_1                     (0x2UL<<HRPWM_PCCTL_CHPFREQ_Pos)                  /*!< 0x00000040 */
#define HRPWM_PCCTL_CHPFREQ_2                     (0x4UL<<HRPWM_PCCTL_CHPFREQ_Pos)                  /*!< 0x00000080 */
#define HRPWM_PCCTL_CHPDUTY_Pos                   (8U)
#define HRPWM_PCCTL_CHPDUTY_Msk                   (0x7UL<<HRPWM_PCCTL_CHPDUTY_Pos)                  /*!< 0x00000700 */
#define HRPWM_PCCTL_CHPDUTY                       HRPWM_PCCTL_CHPDUTY_Msk
#define HRPWM_PCCTL_CHPDUTY_0                     (0x1UL<<HRPWM_PCCTL_CHPDUTY_Pos)                  /*!< 0x00000100 */
#define HRPWM_PCCTL_CHPDUTY_1                     (0x2UL<<HRPWM_PCCTL_CHPDUTY_Pos)                  /*!< 0x00000200 */
#define HRPWM_PCCTL_CHPDUTY_2                     (0x4UL<<HRPWM_PCCTL_CHPDUTY_Pos)                  /*!< 0x00000400 */

/********************************* Bit definition for HRPWM_VCAPCTL register ****************************************/
#define HRPWM_VCAPCTL_VCAPE_Pos                   (0U)
#define HRPWM_VCAPCTL_VCAPE_Msk                   (0x1UL<<HRPWM_VCAPCTL_VCAPE_Pos)                  /*!< 0x00000001 */
#define HRPWM_VCAPCTL_VCAPE                       HRPWM_VCAPCTL_VCAPE_Msk                           
#define HRPWM_VCAPCTL_VCAPSTART_Pos               (1U)
#define HRPWM_VCAPCTL_VCAPSTART_Msk               (0x1UL<<HRPWM_VCAPCTL_VCAPSTART_Pos)              /*!< 0x00000002 */
#define HRPWM_VCAPCTL_VCAPSTART                   HRPWM_VCAPCTL_VCAPSTART_Msk                       
#define HRPWM_VCAPCTL_TRIGSEL_Pos                 (2U)
#define HRPWM_VCAPCTL_TRIGSEL_Msk                 (0x7UL<<HRPWM_VCAPCTL_TRIGSEL_Pos)                /*!< 0x0000001C */
#define HRPWM_VCAPCTL_TRIGSEL                     HRPWM_VCAPCTL_TRIGSEL_Msk
#define HRPWM_VCAPCTL_TRIGSEL_0                   (0x1UL<<HRPWM_VCAPCTL_TRIGSEL_Pos)                /*!< 0x00000004 */
#define HRPWM_VCAPCTL_TRIGSEL_1                   (0x2UL<<HRPWM_VCAPCTL_TRIGSEL_Pos)                /*!< 0x00000008 */
#define HRPWM_VCAPCTL_TRIGSEL_2                   (0x4UL<<HRPWM_VCAPCTL_TRIGSEL_Pos)                /*!< 0x00000010 */
#define HRPWM_VCAPCTL_VDELAYDIV_Pos               (7U)
#define HRPWM_VCAPCTL_VDELAYDIV_Msk               (0x7UL<<HRPWM_VCAPCTL_VDELAYDIV_Pos)              /*!< 0x00000380 */
#define HRPWM_VCAPCTL_VDELAYDIV                   HRPWM_VCAPCTL_VDELAYDIV_Msk
#define HRPWM_VCAPCTL_VDELAYDIV_0                 (0x1UL<<HRPWM_VCAPCTL_VDELAYDIV_Pos)              /*!< 0x00000080 */
#define HRPWM_VCAPCTL_VDELAYDIV_1                 (0x2UL<<HRPWM_VCAPCTL_VDELAYDIV_Pos)              /*!< 0x00000100 */
#define HRPWM_VCAPCTL_VDELAYDIV_2                 (0x4UL<<HRPWM_VCAPCTL_VDELAYDIV_Pos)              /*!< 0x00000200 */
#define HRPWM_VCAPCTL_EDGEFILTDLYSEL_Pos          (10U)
#define HRPWM_VCAPCTL_EDGEFILTDLYSEL_Msk          (0x1UL<<HRPWM_VCAPCTL_EDGEFILTDLYSEL_Pos)         /*!< 0x00000400 */
#define HRPWM_VCAPCTL_EDGEFILTDLYSEL              HRPWM_VCAPCTL_EDGEFILTDLYSEL_Msk                  

/********************************* Bit definition for HRPWM_VCNTCFG register ****************************************/
#define HRPWM_VCNTCFG_STARTEDGE_Pos               (0U)
#define HRPWM_VCNTCFG_STARTEDGE_Msk               (0xFUL<<HRPWM_VCNTCFG_STARTEDGE_Pos)              /*!< 0x0000000F */
#define HRPWM_VCNTCFG_STARTEDGE                   HRPWM_VCNTCFG_STARTEDGE_Msk
#define HRPWM_VCNTCFG_STARTEDGE_0                 (0x1UL<<HRPWM_VCNTCFG_STARTEDGE_Pos)              /*!< 0x00000001 */
#define HRPWM_VCNTCFG_STARTEDGE_1                 (0x2UL<<HRPWM_VCNTCFG_STARTEDGE_Pos)              /*!< 0x00000002 */
#define HRPWM_VCNTCFG_STARTEDGE_2                 (0x4UL<<HRPWM_VCNTCFG_STARTEDGE_Pos)              /*!< 0x00000004 */
#define HRPWM_VCNTCFG_STARTEDGE_3                 (0x8UL<<HRPWM_VCNTCFG_STARTEDGE_Pos)              /*!< 0x00000008 */
#define HRPWM_VCNTCFG_STARTEDGESTS_Pos            (7U)
#define HRPWM_VCNTCFG_STARTEDGESTS_Msk            (0x1UL<<HRPWM_VCNTCFG_STARTEDGESTS_Pos)           /*!< 0x00000080 */
#define HRPWM_VCNTCFG_STARTEDGESTS                HRPWM_VCNTCFG_STARTEDGESTS_Msk                    
#define HRPWM_VCNTCFG_STOPEDGE_Pos                (8U)
#define HRPWM_VCNTCFG_STOPEDGE_Msk                (0xFUL<<HRPWM_VCNTCFG_STOPEDGE_Pos)               /*!< 0x00000F00 */
#define HRPWM_VCNTCFG_STOPEDGE                    HRPWM_VCNTCFG_STOPEDGE_Msk
#define HRPWM_VCNTCFG_STOPEDGE_0                  (0x1UL<<HRPWM_VCNTCFG_STOPEDGE_Pos)               /*!< 0x00000100 */
#define HRPWM_VCNTCFG_STOPEDGE_1                  (0x2UL<<HRPWM_VCNTCFG_STOPEDGE_Pos)               /*!< 0x00000200 */
#define HRPWM_VCNTCFG_STOPEDGE_2                  (0x4UL<<HRPWM_VCNTCFG_STOPEDGE_Pos)               /*!< 0x00000400 */
#define HRPWM_VCNTCFG_STOPEDGE_3                  (0x8UL<<HRPWM_VCNTCFG_STOPEDGE_Pos)               /*!< 0x00000800 */
#define HRPWM_VCNTCFG_STOPEDGESTS_Pos             (15U)
#define HRPWM_VCNTCFG_STOPEDGESTS_Msk             (0x1UL<<HRPWM_VCNTCFG_STOPEDGESTS_Pos)            /*!< 0x00008000 */
#define HRPWM_VCNTCFG_STOPEDGESTS                 HRPWM_VCNTCFG_STOPEDGESTS_Msk                     

/********************************* Bit definition for HRPWM_HRCNFG register *****************************************/
#define HRPWM_HRCNFG_EDGMODE_Pos                  (0U)
#define HRPWM_HRCNFG_EDGMODE_Msk                  (0x3UL<<HRPWM_HRCNFG_EDGMODE_Pos)                 /*!< 0x00000003 */
#define HRPWM_HRCNFG_EDGMODE                      HRPWM_HRCNFG_EDGMODE_Msk
#define HRPWM_HRCNFG_EDGMODE_0                    (0x1UL<<HRPWM_HRCNFG_EDGMODE_Pos)                 /*!< 0x00000001 */
#define HRPWM_HRCNFG_EDGMODE_1                    (0x2UL<<HRPWM_HRCNFG_EDGMODE_Pos)                 /*!< 0x00000002 */
#define HRPWM_HRCNFG_CTLMODE_Pos                  (2U)
#define HRPWM_HRCNFG_CTLMODE_Msk                  (0x1UL<<HRPWM_HRCNFG_CTLMODE_Pos)                 /*!< 0x00000004 */
#define HRPWM_HRCNFG_CTLMODE                      HRPWM_HRCNFG_CTLMODE_Msk                          
#define HRPWM_HRCNFG_HRLOAD_Pos                   (3U)
#define HRPWM_HRCNFG_HRLOAD_Msk                   (0x3UL<<HRPWM_HRCNFG_HRLOAD_Pos)                  /*!< 0x00000018 */
#define HRPWM_HRCNFG_HRLOAD                       HRPWM_HRCNFG_HRLOAD_Msk
#define HRPWM_HRCNFG_HRLOAD_0                     (0x1UL<<HRPWM_HRCNFG_HRLOAD_Pos)                  /*!< 0x00000008 */
#define HRPWM_HRCNFG_HRLOAD_1                     (0x2UL<<HRPWM_HRCNFG_HRLOAD_Pos)                  /*!< 0x00000010 */
#define HRPWM_HRCNFG_SELOUTB_Pos                  (5U)
#define HRPWM_HRCNFG_SELOUTB_Msk                  (0x1UL<<HRPWM_HRCNFG_SELOUTB_Pos)                 /*!< 0x00000020 */
#define HRPWM_HRCNFG_SELOUTB                      HRPWM_HRCNFG_SELOUTB_Msk                          
#define HRPWM_HRCNFG_AUTOCONV_Pos                 (6U)
#define HRPWM_HRCNFG_AUTOCONV_Msk                 (0x1UL<<HRPWM_HRCNFG_AUTOCONV_Pos)                /*!< 0x00000040 */
#define HRPWM_HRCNFG_AUTOCONV                     HRPWM_HRCNFG_AUTOCONV_Msk                         
#define HRPWM_HRCNFG_SWAPAB_Pos                   (7U)
#define HRPWM_HRCNFG_SWAPAB_Msk                   (0x1UL<<HRPWM_HRCNFG_SWAPAB_Pos)                  /*!< 0x00000080 */
#define HRPWM_HRCNFG_SWAPAB                       HRPWM_HRCNFG_SWAPAB_Msk                           
#define HRPWM_HRCNFG_EDGMODEB_Pos                 (8U)
#define HRPWM_HRCNFG_EDGMODEB_Msk                 (0x3UL<<HRPWM_HRCNFG_EDGMODEB_Pos)                /*!< 0x00000300 */
#define HRPWM_HRCNFG_EDGMODEB                     HRPWM_HRCNFG_EDGMODEB_Msk
#define HRPWM_HRCNFG_EDGMODEB_0                   (0x1UL<<HRPWM_HRCNFG_EDGMODEB_Pos)                /*!< 0x00000100 */
#define HRPWM_HRCNFG_EDGMODEB_1                   (0x2UL<<HRPWM_HRCNFG_EDGMODEB_Pos)                /*!< 0x00000200 */
#define HRPWM_HRCNFG_CTLMODEB_Pos                 (10U)
#define HRPWM_HRCNFG_CTLMODEB_Msk                 (0x1UL<<HRPWM_HRCNFG_CTLMODEB_Pos)                /*!< 0x00000400 */
#define HRPWM_HRCNFG_CTLMODEB                     HRPWM_HRCNFG_CTLMODEB_Msk                         
#define HRPWM_HRCNFG_HRLOADB_Pos                  (11U)
#define HRPWM_HRCNFG_HRLOADB_Msk                  (0x3UL<<HRPWM_HRCNFG_HRLOADB_Pos)                 /*!< 0x00001800 */
#define HRPWM_HRCNFG_HRLOADB                      HRPWM_HRCNFG_HRLOADB_Msk
#define HRPWM_HRCNFG_HRLOADB_0                    (0x1UL<<HRPWM_HRCNFG_HRLOADB_Pos)                 /*!< 0x00000800 */
#define HRPWM_HRCNFG_HRLOADB_1                    (0x2UL<<HRPWM_HRCNFG_HRLOADB_Pos)                 /*!< 0x00001000 */

/********************************* Bit definition for HRPWM_HRPWR register ******************************************/
#define HRPWM_HRPWR_CALPWRON_Pos                  (15U)
#define HRPWM_HRPWR_CALPWRON_Msk                  (0x1UL<<HRPWM_HRPWR_CALPWRON_Pos)                 /*!< 0x00008000 */
#define HRPWM_HRPWR_CALPWRON                      HRPWM_HRPWR_CALPWRON_Msk                          

/********************************* Bit definition for HRPWM_HRMSTEP register ****************************************/
#define HRPWM_HRMSTEP_HRMSTEP_Pos                 (0U)
#define HRPWM_HRMSTEP_HRMSTEP_Msk                 (0xFFUL<<HRPWM_HRMSTEP_HRMSTEP_Pos)               /*!< 0x000000FF */
#define HRPWM_HRMSTEP_HRMSTEP                     HRPWM_HRMSTEP_HRMSTEP_Msk

