breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for HRPWM_HRCNFG2 register ****************************************/
#define HRPWM_HRCNFG2_EDGMODEDB_Pos               (0U)
#define HRPWM_HRCNFG2_EDGMODEDB_Msk               (0x3UL<<HRPWM_HRCNFG2_EDGMODEDB_Pos)              /*!< 0x00000003 */
#define HRPWM_HRCNFG2_EDGMODEDB                   HRPWM_HRCNFG2_EDGMODEDB_Msk
#define HRPWM_HRCNFG2_EDGMODEDB_0                 (0x1UL<<HRPWM_HRCNFG2_EDGMODEDB_Pos)              /*!< 0x00000001 */
#define HRPWM_HRCNFG2_EDGMODEDB_1                 (0x2UL<<HRPWM_HRCNFG2_EDGMODEDB_Pos)              /*!< 0x00000002 */
#define HRPWM_HRCNFG2_CTLMODEDBRED_Pos            (2U)
#define HRPWM_HRCNFG2_CTLMODEDBRED_Msk            (0x3UL<<HRPWM_HRCNFG2_CTLMODEDBRED_Pos)           /*!< 0x0000000C */
#define HRPWM_HRCNFG2_CTLMODEDBRED                HRPWM_HRCNFG2_CTLMODEDBRED_Msk
#define HRPWM_HRCNFG2_CTLMODEDBRED_0              (0x1UL<<HRPWM_HRCNFG2_CTLMODEDBRED_Pos)           /*!< 0x00000004 */
#define HRPWM_HRCNFG2_CTLMODEDBRED_1              (0x2UL<<HRPWM_HRCNFG2_CTLMODEDBRED_Pos)           /*!< 0x00000008 */
#define HRPWM_HRCNFG2_CTLMODEDBFED_Pos            (4U)
#define HRPWM_HRCNFG2_CTLMODEDBFED_Msk            (0x3UL<<HRPWM_HRCNFG2_CTLMODEDBFED_Pos)           /*!< 0x00000030 */
#define HRPWM_HRCNFG2_CTLMODEDBFED                HRPWM_HRCNFG2_CTLMODEDBFED_Msk
#define HRPWM_HRCNFG2_CTLMODEDBFED_0              (0x1UL<<HRPWM_HRCNFG2_CTLMODEDBFED_Pos)           /*!< 0x00000010 */
#define HRPWM_HRCNFG2_CTLMODEDBFED_1              (0x2UL<<HRPWM_HRCNFG2_CTLMODEDBFED_Pos)           /*!< 0x00000020 */

/********************************* Bit definition for HRPWM_HRPCTL register *****************************************/
#define HRPWM_HRPCTL_HRPE_Pos                     (0U)
#define HRPWM_HRPCTL_HRPE_Msk                     (0x1UL<<HRPWM_HRPCTL_HRPE_Pos)                    /*!< 0x00000001 */
#define HRPWM_HRPCTL_HRPE                         HRPWM_HRPCTL_HRPE_Msk                             
#define HRPWM_HRPCTL_PWMSYNCSEL_Pos               (1U)
#define HRPWM_HRPCTL_PWMSYNCSEL_Msk               (0x1UL<<HRPWM_HRPCTL_PWMSYNCSEL_Pos)              /*!< 0x00000002 */
#define HRPWM_HRPCTL_PWMSYNCSEL                   HRPWM_HRPCTL_PWMSYNCSEL_Msk                       
#define HRPWM_HRPCTL_TBPHSHRLOADE_Pos             (2U)
#define HRPWM_HRPCTL_TBPHSHRLOADE_Msk             (0x1UL<<HRPWM_HRPCTL_TBPHSHRLOADE_Pos)            /*!< 0x00000004 */
#define HRPWM_HRPCTL_TBPHSHRLOADE                 HRPWM_HRPCTL_TBPHSHRLOADE_Msk                     
#define HRPWM_HRPCTL_PWMSYNCSELX_Pos              (4U)
#define HRPWM_HRPCTL_PWMSYNCSELX_Msk              (0x7UL<<HRPWM_HRPCTL_PWMSYNCSELX_Pos)             /*!< 0x00000070 */
#define HRPWM_HRPCTL_PWMSYNCSELX                  HRPWM_HRPCTL_PWMSYNCSELX_Msk
#define HRPWM_HRPCTL_PWMSYNCSELX_0                (0x1UL<<HRPWM_HRPCTL_PWMSYNCSELX_Pos)             /*!< 0x00000010 */
#define HRPWM_HRPCTL_PWMSYNCSELX_1                (0x2UL<<HRPWM_HRPCTL_PWMSYNCSELX_Pos)             /*!< 0x00000020 */
#define HRPWM_HRPCTL_PWMSYNCSELX_2                (0x4UL<<HRPWM_HRPCTL_PWMSYNCSELX_Pos)             /*!< 0x00000040 */

/********************************* Bit definition for HRPWM_TRREM register ******************************************/
#define HRPWM_TRREM_TREEM_Pos                     (0U)
#define HRPWM_TRREM_TREEM_Msk                     (0x7FFUL<<HRPWM_TRREM_TREEM_Pos)                  /*!< 0x000007FF */
#define HRPWM_TRREM_TREEM                         HRPWM_TRREM_TREEM_Msk

/********************************* Bit definition for HRPWM_GLDCTL register *****************************************/
#define HRPWM_GLDCTL_GLD_Pos                      (0U)
#define HRPWM_GLDCTL_GLD_Msk                      (0x1UL<<HRPWM_GLDCTL_GLD_Pos)                     /*!< 0x00000001 */
#define HRPWM_GLDCTL_GLD                          HRPWM_GLDCTL_GLD_Msk                              
#define HRPWM_GLDCTL_GLDMODE_Pos                  (1U)
#define HRPWM_GLDCTL_GLDMODE_Msk                  (0xFUL<<HRPWM_GLDCTL_GLDMODE_Pos)                 /*!< 0x0000001E */
#define HRPWM_GLDCTL_GLDMODE                      HRPWM_GLDCTL_GLDMODE_Msk
#define HRPWM_GLDCTL_GLDMODE_0                    (0x1UL<<HRPWM_GLDCTL_GLDMODE_Pos)                 /*!< 0x00000002 */
#define HRPWM_GLDCTL_GLDMODE_1                    (0x2UL<<HRPWM_GLDCTL_GLDMODE_Pos)                 /*!< 0x00000004 */
#define HRPWM_GLDCTL_GLDMODE_2                    (0x4UL<<HRPWM_GLDCTL_GLDMODE_Pos)                 /*!< 0x00000008 */
#define HRPWM_GLDCTL_GLDMODE_3                    (0x8UL<<HRPWM_GLDCTL_GLDMODE_Pos)                 /*!< 0x00000010 */
#define HRPWM_GLDCTL_OSHTMODE_Pos                 (5U)
#define HRPWM_GLDCTL_OSHTMODE_Msk                 (0x1UL<<HRPWM_GLDCTL_OSHTMODE_Pos)                /*!< 0x00000020 */
#define HRPWM_GLDCTL_OSHTMODE                     HRPWM_GLDCTL_OSHTMODE_Msk                         
#define HRPWM_GLDCTL_GLDPRD_Pos                   (7U)
#define HRPWM_GLDCTL_GLDPRD_Msk                   (0x7UL<<HRPWM_GLDCTL_GLDPRD_Pos)                  /*!< 0x00000380 */
#define HRPWM_GLDCTL_GLDPRD                       HRPWM_GLDCTL_GLDPRD_Msk
#define HRPWM_GLDCTL_GLDPRD_0                     (0x1UL<<HRPWM_GLDCTL_GLDPRD_Pos)                  /*!< 0x00000080 */
#define HRPWM_GLDCTL_GLDPRD_1                     (0x2UL<<HRPWM_GLDCTL_GLDPRD_Pos)                  /*!< 0x00000100 */
#define HRPWM_GLDCTL_GLDPRD_2                     (0x4UL<<HRPWM_GLDCTL_GLDPRD_Pos)                  /*!< 0x00000200 */
#define HRPWM_GLDCTL_GLDCNT_Pos                   (10U)
#define HRPWM_GLDCTL_GLDCNT_Msk                   (0x7UL<<HRPWM_GLDCTL_GLDCNT_Pos)                  /*!< 0x00001C00 */
#define HRPWM_GLDCTL_GLDCNT                       HRPWM_GLDCTL_GLDCNT_Msk
#define HRPWM_GLDCTL_GLDCNT_0                     (0x1UL<<HRPWM_GLDCTL_GLDCNT_Pos)                  /*!< 0x00000400 */
#define HRPWM_GLDCTL_GLDCNT_1                     (0x2UL<<HRPWM_GLDCTL_GLDCNT_Pos)                  /*!< 0x00000800 */
#define HRPWM_GLDCTL_GLDCNT_2                     (0x4UL<<HRPWM_GLDCTL_GLDCNT_Pos)                  /*!< 0x00001000 */

