breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for HRPWM_GLDCFG register *****************************************/
#define HRPWM_GLDCFG_TBPRD_TBPRDRHR_Pos           (0U)
#define HRPWM_GLDCFG_TBPRD_TBPRDRHR_Msk           (0x1UL<<HRPWM_GLDCFG_TBPRD_TBPRDRHR_Pos)          /*!< 0x00000001 */
#define HRPWM_GLDCFG_TBPRD_TBPRDRHR               HRPWM_GLDCFG_TBPRD_TBPRDRHR_Msk                   
#define HRPWM_GLDCFG_CMPA_CMPAHR_Pos              (1U)
#define HRPWM_GLDCFG_CMPA_CMPAHR_Msk              (0x1UL<<HRPWM_GLDCFG_CMPA_CMPAHR_Pos)             /*!< 0x00000002 */
#define HRPWM_GLDCFG_CMPA_CMPAHR                  HRPWM_GLDCFG_CMPA_CMPAHR_Msk                      
#define HRPWM_GLDCFG_CMPB_CMPBHR_Pos              (2U)
#define HRPWM_GLDCFG_CMPB_CMPBHR_Msk              (0x1UL<<HRPWM_GLDCFG_CMPB_CMPBHR_Pos)             /*!< 0x00000004 */
#define HRPWM_GLDCFG_CMPB_CMPBHR                  HRPWM_GLDCFG_CMPB_CMPBHR_Msk                      
#define HRPWM_GLDCFG_CMPC_Pos                     (3U)
#define HRPWM_GLDCFG_CMPC_Msk                     (0x1UL<<HRPWM_GLDCFG_CMPC_Pos)                    /*!< 0x00000008 */
#define HRPWM_GLDCFG_CMPC                         HRPWM_GLDCFG_CMPC_Msk                             
#define HRPWM_GLDCFG_CMPD_Pos                     (4U)
#define HRPWM_GLDCFG_CMPD_Msk                     (0x1UL<<HRPWM_GLDCFG_CMPD_Pos)                    /*!< 0x00000010 */
#define HRPWM_GLDCFG_CMPD                         HRPWM_GLDCFG_CMPD_Msk                             
#define HRPWM_GLDCFG_DBRED_DBREDHR_Pos            (5U)
#define HRPWM_GLDCFG_DBRED_DBREDHR_Msk            (0x1UL<<HRPWM_GLDCFG_DBRED_DBREDHR_Pos)           /*!< 0x00000020 */
#define HRPWM_GLDCFG_DBRED_DBREDHR                HRPWM_GLDCFG_DBRED_DBREDHR_Msk                    
#define HRPWM_GLDCFG_DBFED_DBFEDHR_Pos            (6U)
#define HRPWM_GLDCFG_DBFED_DBFEDHR_Msk            (0x1UL<<HRPWM_GLDCFG_DBFED_DBFEDHR_Pos)           /*!< 0x00000040 */
#define HRPWM_GLDCFG_DBFED_DBFEDHR                HRPWM_GLDCFG_DBFED_DBFEDHR_Msk                    
#define HRPWM_GLDCFG_DBCTL_Pos                    (7U)
#define HRPWM_GLDCFG_DBCTL_Msk                    (0x1UL<<HRPWM_GLDCFG_DBCTL_Pos)                   /*!< 0x00000080 */
#define HRPWM_GLDCFG_DBCTL                        HRPWM_GLDCFG_DBCTL_Msk                            
#define HRPWM_GLDCFG_AQCTLA_AQCTLA2_Pos           (8U)
#define HRPWM_GLDCFG_AQCTLA_AQCTLA2_Msk           (0x1UL<<HRPWM_GLDCFG_AQCTLA_AQCTLA2_Pos)          /*!< 0x00000100 */
#define HRPWM_GLDCFG_AQCTLA_AQCTLA2               HRPWM_GLDCFG_AQCTLA_AQCTLA2_Msk                   
#define HRPWM_GLDCFG_AQCTLB_AQCTLB2_Pos           (9U)
#define HRPWM_GLDCFG_AQCTLB_AQCTLB2_Msk           (0x1UL<<HRPWM_GLDCFG_AQCTLB_AQCTLB2_Pos)          /*!< 0x00000200 */
#define HRPWM_GLDCFG_AQCTLB_AQCTLB2               HRPWM_GLDCFG_AQCTLB_AQCTLB2_Msk                   
#define HRPWM_GLDCFG_AQCSPRC_Pos                  (10U)
#define HRPWM_GLDCFG_AQCSPRC_Msk                  (0x1UL<<HRPWM_GLDCFG_AQCSPRC_Pos)                 /*!< 0x00000400 */
#define HRPWM_GLDCFG_AQCSPRC                      HRPWM_GLDCFG_AQCSPRC_Msk                          

/********************************* Bit definition for HRPWM_PWMXLINK register ***************************************/
#define HRPWM_PWMXLINK_TBPRDLINK_Pos              (0U)
#define HRPWM_PWMXLINK_TBPRDLINK_Msk              (0xFUL<<HRPWM_PWMXLINK_TBPRDLINK_Pos)             /*!< 0x0000000F */
#define HRPWM_PWMXLINK_TBPRDLINK                  HRPWM_PWMXLINK_TBPRDLINK_Msk
#define HRPWM_PWMXLINK_TBPRDLINK_0                (0x1UL<<HRPWM_PWMXLINK_TBPRDLINK_Pos)             /*!< 0x00000001 */
#define HRPWM_PWMXLINK_TBPRDLINK_1                (0x2UL<<HRPWM_PWMXLINK_TBPRDLINK_Pos)             /*!< 0x00000002 */
#define HRPWM_PWMXLINK_TBPRDLINK_2                (0x4UL<<HRPWM_PWMXLINK_TBPRDLINK_Pos)             /*!< 0x00000004 */
#define HRPWM_PWMXLINK_TBPRDLINK_3                (0x8UL<<HRPWM_PWMXLINK_TBPRDLINK_Pos)             /*!< 0x00000008 */
#define HRPWM_PWMXLINK_CMPALINK_Pos               (4U)
#define HRPWM_PWMXLINK_CMPALINK_Msk               (0xFUL<<HRPWM_PWMXLINK_CMPALINK_Pos)              /*!< 0x000000F0 */
#define HRPWM_PWMXLINK_CMPALINK                   HRPWM_PWMXLINK_CMPALINK_Msk
#define HRPWM_PWMXLINK_CMPALINK_0                 (0x1UL<<HRPWM_PWMXLINK_CMPALINK_Pos)              /*!< 0x00000010 */
#define HRPWM_PWMXLINK_CMPALINK_1                 (0x2UL<<HRPWM_PWMXLINK_CMPALINK_Pos)              /*!< 0x00000020 */
#define HRPWM_PWMXLINK_CMPALINK_2                 (0x4UL<<HRPWM_PWMXLINK_CMPALINK_Pos)              /*!< 0x00000040 */
#define HRPWM_PWMXLINK_CMPALINK_3                 (0x8UL<<HRPWM_PWMXLINK_CMPALINK_Pos)              /*!< 0x00000080 */
#define HRPWM_PWMXLINK_CMPBLINK_Pos               (8U)
#define HRPWM_PWMXLINK_CMPBLINK_Msk               (0xFUL<<HRPWM_PWMXLINK_CMPBLINK_Pos)              /*!< 0x00000F00 */
#define HRPWM_PWMXLINK_CMPBLINK                   HRPWM_PWMXLINK_CMPBLINK_Msk
#define HRPWM_PWMXLINK_CMPBLINK_0                 (0x1UL<<HRPWM_PWMXLINK_CMPBLINK_Pos)              /*!< 0x00000100 */
#define HRPWM_PWMXLINK_CMPBLINK_1                 (0x2UL<<HRPWM_PWMXLINK_CMPBLINK_Pos)              /*!< 0x00000200 */
#define HRPWM_PWMXLINK_CMPBLINK_2                 (0x4UL<<HRPWM_PWMXLINK_CMPBLINK_Pos)              /*!< 0x00000400 */
#define HRPWM_PWMXLINK_CMPBLINK_3                 (0x8UL<<HRPWM_PWMXLINK_CMPBLINK_Pos)              /*!< 0x00000800 */
#define HRPWM_PWMXLINK_CMPCLINK_Pos               (12U)
#define HRPWM_PWMXLINK_CMPCLINK_Msk               (0xFUL<<HRPWM_PWMXLINK_CMPCLINK_Pos)              /*!< 0x0000F000 */
#define HRPWM_PWMXLINK_CMPCLINK                   HRPWM_PWMXLINK_CMPCLINK_Msk
#define HRPWM_PWMXLINK_CMPCLINK_0                 (0x1UL<<HRPWM_PWMXLINK_CMPCLINK_Pos)              /*!< 0x00001000 */
#define HRPWM_PWMXLINK_CMPCLINK_1                 (0x2UL<<HRPWM_PWMXLINK_CMPCLINK_Pos)              /*!< 0x00002000 */
#define HRPWM_PWMXLINK_CMPCLINK_2                 (0x4UL<<HRPWM_PWMXLINK_CMPCLINK_Pos)              /*!< 0x00004000 */
#define HRPWM_PWMXLINK_CMPCLINK_3                 (0x8UL<<HRPWM_PWMXLINK_CMPCLINK_Pos)              /*!< 0x00008000 */
#define HRPWM_PWMXLINK_CMPDLINK_Pos               (16U)
#define HRPWM_PWMXLINK_CMPDLINK_Msk               (0xFUL<<HRPWM_PWMXLINK_CMPDLINK_Pos)              /*!< 0x000F0000 */
#define HRPWM_PWMXLINK_CMPDLINK                   HRPWM_PWMXLINK_CMPDLINK_Msk
#define HRPWM_PWMXLINK_CMPDLINK_0                 (0x1UL<<HRPWM_PWMXLINK_CMPDLINK_Pos)              /*!< 0x00010000 */
#define HRPWM_PWMXLINK_CMPDLINK_1                 (0x2UL<<HRPWM_PWMXLINK_CMPDLINK_Pos)              /*!< 0x00020000 */
#define HRPWM_PWMXLINK_CMPDLINK_2                 (0x4UL<<HRPWM_PWMXLINK_CMPDLINK_Pos)              /*!< 0x00040000 */
#define HRPWM_PWMXLINK_CMPDLINK_3                 (0x8UL<<HRPWM_PWMXLINK_CMPDLINK_Pos)              /*!< 0x00080000 */
#define HRPWM_PWMXLINK_GLDCTL2LINK_Pos            (28U)
#define HRPWM_PWMXLINK_GLDCTL2LINK_Msk            (0xFUL<<HRPWM_PWMXLINK_GLDCTL2LINK_Pos)           /*!< 0xF0000000 */
#define HRPWM_PWMXLINK_GLDCTL2LINK                HRPWM_PWMXLINK_GLDCTL2LINK_Msk
#define HRPWM_PWMXLINK_GLDCTL2LINK_0              (0x1UL<<HRPWM_PWMXLINK_GLDCTL2LINK_Pos)           /*!< 0x10000000 */
#define HRPWM_PWMXLINK_GLDCTL2LINK_1              (0x2UL<<HRPWM_PWMXLINK_GLDCTL2LINK_Pos)           /*!< 0x20000000 */
#define HRPWM_PWMXLINK_GLDCTL2LINK_2              (0x4UL<<HRPWM_PWMXLINK_GLDCTL2LINK_Pos)           /*!< 0x40000000 */
#define HRPWM_PWMXLINK_GLDCTL2LINK_3              (0x8UL<<HRPWM_PWMXLINK_GLDCTL2LINK_Pos)           /*!< 0x80000000 */

/********************************* Bit definition for HRPWM_AQCTLA register *****************************************/
#define HRPWM_AQCTLA_ZRO_Pos                      (0U)
#define HRPWM_AQCTLA_ZRO_Msk                      (0x3UL<<HRPWM_AQCTLA_ZRO_Pos)                     /*!< 0x00000003 */
#define HRPWM_AQCTLA_ZRO                          HRPWM_AQCTLA_ZRO_Msk
#define HRPWM_AQCTLA_ZRO_0                        (0x1UL<<HRPWM_AQCTLA_ZRO_Pos)                     /*!< 0x00000001 */
#define HRPWM_AQCTLA_ZRO_1                        (0x2UL<<HRPWM_AQCTLA_ZRO_Pos)                     /*!< 0x00000002 */
#define HRPWM_AQCTLA_PRD_Pos                      (2U)
#define HRPWM_AQCTLA_PRD_Msk                      (0x3UL<<HRPWM_AQCTLA_PRD_Pos)                     /*!< 0x0000000C */
#define HRPWM_AQCTLA_PRD                          HRPWM_AQCTLA_PRD_Msk
#define HRPWM_AQCTLA_PRD_0                        (0x1UL<<HRPWM_AQCTLA_PRD_Pos)                     /*!< 0x00000004 */
#define HRPWM_AQCTLA_PRD_1                        (0x2UL<<HRPWM_AQCTLA_PRD_Pos)                     /*!< 0x00000008 */
#define HRPWM_AQCTLA_CAU_Pos                      (4U)
#define HRPWM_AQCTLA_CAU_Msk                      (0x3UL<<HRPWM_AQCTLA_CAU_Pos)                     /*!< 0x00000030 */
#define HRPWM_AQCTLA_CAU                          HRPWM_AQCTLA_CAU_Msk
#define HRPWM_AQCTLA_CAU_0                        (0x1UL<<HRPWM_AQCTLA_CAU_Pos)                     /*!< 0x00000010 */
#define HRPWM_AQCTLA_CAU_1                        (0x2UL<<HRPWM_AQCTLA_CAU_Pos)                     /*!< 0x00000020 */
#define HRPWM_AQCTLA_CAD_Pos                      (6U)
#define HRPWM_AQCTLA_CAD_Msk                      (0x3UL<<HRPWM_AQCTLA_CAD_Pos)                     /*!< 0x000000C0 */
#define HRPWM_AQCTLA_CAD                          HRPWM_AQCTLA_CAD_Msk
#define HRPWM_AQCTLA_CAD_0                        (0x1UL<<HRPWM_AQCTLA_CAD_Pos)                     /*!< 0x00000040 */
#define HRPWM_AQCTLA_CAD_1                        (0x2UL<<HRPWM_AQCTLA_CAD_Pos)                     /*!< 0x00000080 */
#define HRPWM_AQCTLA_CBU_Pos                      (8U)
#define HRPWM_AQCTLA_CBU_Msk                      (0x3UL<<HRPWM_AQCTLA_CBU_Pos)                     /*!< 0x00000300 */
#define HRPWM_AQCTLA_CBU                          HRPWM_AQCTLA_CBU_Msk
#define HRPWM_AQCTLA_CBU_0                        (0x1UL<<HRPWM_AQCTLA_CBU_Pos)                     /*!< 0x00000100 */
#define HRPWM_AQCTLA_CBU_1                        (0x2UL<<HRPWM_AQCTLA_CBU_Pos)                     /*!< 0x00000200 */
#define HRPWM_AQCTLA_CBD_Pos                      (10U)
#define HRPWM_AQCTLA_CBD_Msk                      (0x3UL<<HRPWM_AQCTLA_CBD_Pos)                     /*!< 0x00000C00 */
#define HRPWM_AQCTLA_CBD                          HRPWM_AQCTLA_CBD_Msk
#define HRPWM_AQCTLA_CBD_0                        (0x1UL<<HRPWM_AQCTLA_CBD_Pos)                     /*!< 0x00000400 */
#define HRPWM_AQCTLA_CBD_1                        (0x2UL<<HRPWM_AQCTLA_CBD_Pos)                     /*!< 0x00000800 */

/********************************* Bit definition for HRPWM_AQCTLA2 register ****************************************/
#define HRPWM_AQCTLA2_T1U_Pos                     (0U)
#define HRPWM_AQCTLA2_T1U_Msk                     (0x3UL<<HRPWM_AQCTLA2_T1U_Pos)                    /*!< 0x00000003 */
#define HRPWM_AQCTLA2_T1U                         HRPWM_AQCTLA2_T1U_Msk
#define HRPWM_AQCTLA2_T1U_0                       (0x1UL<<HRPWM_AQCTLA2_T1U_Pos)                    /*!< 0x00000001 */
#define HRPWM_AQCTLA2_T1U_1                       (0x2UL<<HRPWM_AQCTLA2_T1U_Pos)                    /*!< 0x00000002 */
#define HRPWM_AQCTLA2_T1D_Pos                     (2U)
#define HRPWM_AQCTLA2_T1D_Msk                     (0x3UL<<HRPWM_AQCTLA2_T1D_Pos)                    /*!< 0x0000000C */
#define HRPWM_AQCTLA2_T1D                         HRPWM_AQCTLA2_T1D_Msk
#define HRPWM_AQCTLA2_T1D_0                       (0x1UL<<HRPWM_AQCTLA2_T1D_Pos)                    /*!< 0x00000004 */
#define HRPWM_AQCTLA2_T1D_1                       (0x2UL<<HRPWM_AQCTLA2_T1D_Pos)                    /*!< 0x00000008 */
#define HRPWM_AQCTLA2_T2U_Pos                     (4U)
#define HRPWM_AQCTLA2_T2U_Msk                     (0x3UL<<HRPWM_AQCTLA2_T2U_Pos)                    /*!< 0x00000030 */
#define HRPWM_AQCTLA2_T2U                         HRPWM_AQCTLA2_T2U_Msk
#define HRPWM_AQCTLA2_T2U_0                       (0x1UL<<HRPWM_AQCTLA2_T2U_Pos)                    /*!< 0x00000010 */
#define HRPWM_AQCTLA2_T2U_1                       (0x2UL<<HRPWM_AQCTLA2_T2U_Pos)                    /*!< 0x00000020 */
#define HRPWM_AQCTLA2_T2D_Pos                     (6U)
#define HRPWM_AQCTLA2_T2D_Msk                     (0x3UL<<HRPWM_AQCTLA2_T2D_Pos)                    /*!< 0x000000C0 */
#define HRPWM_AQCTLA2_T2D                         HRPWM_AQCTLA2_T2D_Msk
#define HRPWM_AQCTLA2_T2D_0                       (0x1UL<<HRPWM_AQCTLA2_T2D_Pos)                    /*!< 0x00000040 */
#define HRPWM_AQCTLA2_T2D_1                       (0x2UL<<HRPWM_AQCTLA2_T2D_Pos)                    /*!< 0x00000080 */

