breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for HRPWM_AQCTLB register *****************************************/
#define HRPWM_AQCTLB_ZRO_Pos                      (0U)
#define HRPWM_AQCTLB_ZRO_Msk                      (0x3UL<<HRPWM_AQCTLB_ZRO_Pos)                     /*!< 0x00000003 */
#define HRPWM_AQCTLB_ZRO                          HRPWM_AQCTLB_ZRO_Msk
#define HRPWM_AQCTLB_ZRO_0                        (0x1UL<<HRPWM_AQCTLB_ZRO_Pos)                     /*!< 0x00000001 */
#define HRPWM_AQCTLB_ZRO_1                        (0x2UL<<HRPWM_AQCTLB_ZRO_Pos)                     /*!< 0x00000002 */
#define HRPWM_AQCTLB_PRD_Pos                      (2U)
#define HRPWM_AQCTLB_PRD_Msk                      (0x3UL<<HRPWM_AQCTLB_PRD_Pos)                     /*!< 0x0000000C */
#define HRPWM_AQCTLB_PRD                          HRPWM_AQCTLB_PRD_Msk
#define HRPWM_AQCTLB_PRD_0                        (0x1UL<<HRPWM_AQCTLB_PRD_Pos)                     /*!< 0x00000004 */
#define HRPWM_AQCTLB_PRD_1                        (0x2UL<<HRPWM_AQCTLB_PRD_Pos)                     /*!< 0x00000008 */
#define HRPWM_AQCTLB_CAU_Pos                      (4U)
#define HRPWM_AQCTLB_CAU_Msk                      (0x3UL<<HRPWM_AQCTLB_CAU_Pos)                     /*!< 0x00000030 */
#define HRPWM_AQCTLB_CAU                          HRPWM_AQCTLB_CAU_Msk
#define HRPWM_AQCTLB_CAU_0                        (0x1UL<<HRPWM_AQCTLB_CAU_Pos)                     /*!< 0x00000010 */
#define HRPWM_AQCTLB_CAU_1                        (0x2UL<<HRPWM_AQCTLB_CAU_Pos)                     /*!< 0x00000020 */
#define HRPWM_AQCTLB_CAD_Pos                      (6U)
#define HRPWM_AQCTLB_CAD_Msk                      (0x3UL<<HRPWM_AQCTLB_CAD_Pos)                     /*!< 0x000000C0 */
#define HRPWM_AQCTLB_CAD                          HRPWM_AQCTLB_CAD_Msk
#define HRPWM_AQCTLB_CAD_0                        (0x1UL<<HRPWM_AQCTLB_CAD_Pos)                     /*!< 0x00000040 */
#define HRPWM_AQCTLB_CAD_1                        (0x2UL<<HRPWM_AQCTLB_CAD_Pos)                     /*!< 0x00000080 */
#define HRPWM_AQCTLB_CBU_Pos                      (8U)
#define HRPWM_AQCTLB_CBU_Msk                      (0x3UL<<HRPWM_AQCTLB_CBU_Pos)                     /*!< 0x00000300 */
#define HRPWM_AQCTLB_CBU                          HRPWM_AQCTLB_CBU_Msk
#define HRPWM_AQCTLB_CBU_0                        (0x1UL<<HRPWM_AQCTLB_CBU_Pos)                     /*!< 0x00000100 */
#define HRPWM_AQCTLB_CBU_1                        (0x2UL<<HRPWM_AQCTLB_CBU_Pos)                     /*!< 0x00000200 */
#define HRPWM_AQCTLB_CBD_Pos                      (10U)
#define HRPWM_AQCTLB_CBD_Msk                      (0x3UL<<HRPWM_AQCTLB_CBD_Pos)                     /*!< 0x00000C00 */
#define HRPWM_AQCTLB_CBD                          HRPWM_AQCTLB_CBD_Msk
#define HRPWM_AQCTLB_CBD_0                        (0x1UL<<HRPWM_AQCTLB_CBD_Pos)                     /*!< 0x00000400 */
#define HRPWM_AQCTLB_CBD_1                        (0x2UL<<HRPWM_AQCTLB_CBD_Pos)                     /*!< 0x00000800 */

/********************************* Bit definition for HRPWM_AQCTLB2 register ****************************************/
#define HRPWM_AQCTLB2_T1U_Pos                     (0U)
#define HRPWM_AQCTLB2_T1U_Msk                     (0x3UL<<HRPWM_AQCTLB2_T1U_Pos)                    /*!< 0x00000003 */
#define HRPWM_AQCTLB2_T1U                         HRPWM_AQCTLB2_T1U_Msk
#define HRPWM_AQCTLB2_T1U_0                       (0x1UL<<HRPWM_AQCTLB2_T1U_Pos)                    /*!< 0x00000001 */
#define HRPWM_AQCTLB2_T1U_1                       (0x2UL<<HRPWM_AQCTLB2_T1U_Pos)                    /*!< 0x00000002 */
#define HRPWM_AQCTLB2_T1D_Pos                     (2U)
#define HRPWM_AQCTLB2_T1D_Msk                     (0x3UL<<HRPWM_AQCTLB2_T1D_Pos)                    /*!< 0x0000000C */
#define HRPWM_AQCTLB2_T1D                         HRPWM_AQCTLB2_T1D_Msk
#define HRPWM_AQCTLB2_T1D_0                       (0x1UL<<HRPWM_AQCTLB2_T1D_Pos)                    /*!< 0x00000004 */
#define HRPWM_AQCTLB2_T1D_1                       (0x2UL<<HRPWM_AQCTLB2_T1D_Pos)                    /*!< 0x00000008 */
#define HRPWM_AQCTLB2_T2U_Pos                     (4U)
#define HRPWM_AQCTLB2_T2U_Msk                     (0x3UL<<HRPWM_AQCTLB2_T2U_Pos)                    /*!< 0x00000030 */
#define HRPWM_AQCTLB2_T2U                         HRPWM_AQCTLB2_T2U_Msk
#define HRPWM_AQCTLB2_T2U_0                       (0x1UL<<HRPWM_AQCTLB2_T2U_Pos)                    /*!< 0x00000010 */
#define HRPWM_AQCTLB2_T2U_1                       (0x2UL<<HRPWM_AQCTLB2_T2U_Pos)                    /*!< 0x00000020 */
#define HRPWM_AQCTLB2_T2D_Pos                     (6U)
#define HRPWM_AQCTLB2_T2D_Msk                     (0x3UL<<HRPWM_AQCTLB2_T2D_Pos)                    /*!< 0x000000C0 */
#define HRPWM_AQCTLB2_T2D                         HRPWM_AQCTLB2_T2D_Msk
#define HRPWM_AQCTLB2_T2D_0                       (0x1UL<<HRPWM_AQCTLB2_T2D_Pos)                    /*!< 0x00000040 */
#define HRPWM_AQCTLB2_T2D_1                       (0x2UL<<HRPWM_AQCTLB2_T2D_Pos)                    /*!< 0x00000080 */

/********************************* Bit definition for HRPWM_AQSFRC register *****************************************/
#define HRPWM_AQSFRC_ACTSFA_Pos                   (0U)
#define HRPWM_AQSFRC_ACTSFA_Msk                   (0x3UL<<HRPWM_AQSFRC_ACTSFA_Pos)                  /*!< 0x00000003 */
#define HRPWM_AQSFRC_ACTSFA                       HRPWM_AQSFRC_ACTSFA_Msk
#define HRPWM_AQSFRC_ACTSFA_0                     (0x1UL<<HRPWM_AQSFRC_ACTSFA_Pos)                  /*!< 0x00000001 */
#define HRPWM_AQSFRC_ACTSFA_1                     (0x2UL<<HRPWM_AQSFRC_ACTSFA_Pos)                  /*!< 0x00000002 */
#define HRPWM_AQSFRC_OTSFA_Pos                    (2U)
#define HRPWM_AQSFRC_OTSFA_Msk                    (0x1UL<<HRPWM_AQSFRC_OTSFA_Pos)                   /*!< 0x00000004 */
#define HRPWM_AQSFRC_OTSFA                        HRPWM_AQSFRC_OTSFA_Msk                            
#define HRPWM_AQSFRC_ACTSFB_Pos                   (3U)
#define HRPWM_AQSFRC_ACTSFB_Msk                   (0x3UL<<HRPWM_AQSFRC_ACTSFB_Pos)                  /*!< 0x00000018 */
#define HRPWM_AQSFRC_ACTSFB                       HRPWM_AQSFRC_ACTSFB_Msk
#define HRPWM_AQSFRC_ACTSFB_0                     (0x1UL<<HRPWM_AQSFRC_ACTSFB_Pos)                  /*!< 0x00000008 */
#define HRPWM_AQSFRC_ACTSFB_1                     (0x2UL<<HRPWM_AQSFRC_ACTSFB_Pos)                  /*!< 0x00000010 */
#define HRPWM_AQSFRC_OTSFB_Pos                    (5U)
#define HRPWM_AQSFRC_OTSFB_Msk                    (0x1UL<<HRPWM_AQSFRC_OTSFB_Pos)                   /*!< 0x00000020 */
#define HRPWM_AQSFRC_OTSFB                        HRPWM_AQSFRC_OTSFB_Msk                            
#define HRPWM_AQSFRC_RLDCSF_Pos                   (6U)
#define HRPWM_AQSFRC_RLDCSF_Msk                   (0x3UL<<HRPWM_AQSFRC_RLDCSF_Pos)                  /*!< 0x000000C0 */
#define HRPWM_AQSFRC_RLDCSF                       HRPWM_AQSFRC_RLDCSF_Msk
#define HRPWM_AQSFRC_RLDCSF_0                     (0x1UL<<HRPWM_AQSFRC_RLDCSF_Pos)                  /*!< 0x00000040 */
#define HRPWM_AQSFRC_RLDCSF_1                     (0x2UL<<HRPWM_AQSFRC_RLDCSF_Pos)                  /*!< 0x00000080 */

/********************************* Bit definition for HRPWM_AQCSPFRC register ***************************************/
#define HRPWM_AQCSPFRC_CSFA_Pos                   (0U)
#define HRPWM_AQCSPFRC_CSFA_Msk                   (0x3UL<<HRPWM_AQCSPFRC_CSFA_Pos)                  /*!< 0x00000003 */
#define HRPWM_AQCSPFRC_CSFA                       HRPWM_AQCSPFRC_CSFA_Msk
#define HRPWM_AQCSPFRC_CSFA_0                     (0x1UL<<HRPWM_AQCSPFRC_CSFA_Pos)                  /*!< 0x00000001 */
#define HRPWM_AQCSPFRC_CSFA_1                     (0x2UL<<HRPWM_AQCSPFRC_CSFA_Pos)                  /*!< 0x00000002 */
#define HRPWM_AQCSPFRC_CSFB_Pos                   (2U)
#define HRPWM_AQCSPFRC_CSFB_Msk                   (0x3UL<<HRPWM_AQCSPFRC_CSFB_Pos)                  /*!< 0x0000000C */
#define HRPWM_AQCSPFRC_CSFB                       HRPWM_AQCSPFRC_CSFB_Msk
#define HRPWM_AQCSPFRC_CSFB_0                     (0x1UL<<HRPWM_AQCSPFRC_CSFB_Pos)                  /*!< 0x00000004 */
#define HRPWM_AQCSPFRC_CSFB_1                     (0x2UL<<HRPWM_AQCSPFRC_CSFB_Pos)                  /*!< 0x00000008 */

/********************************* Bit definition for HRPWM_DBREDHR register ****************************************/
#define HRPWM_DBREDHR_DBREDHR_Pos                 (9U)
#define HRPWM_DBREDHR_DBREDHR_Msk                 (0x7FUL<<HRPWM_DBREDHR_DBREDHR_Pos)               /*!< 0x0000FE00 */
#define HRPWM_DBREDHR_DBREDHR                     HRPWM_DBREDHR_DBREDHR_Msk

/********************************* Bit definition for HRPWM_DBRED register ******************************************/
#define HRPWM_DBRED_DBRED_Pos                     (0U)
#define HRPWM_DBRED_DBRED_Msk                     (0x3FFFUL<<HRPWM_DBRED_DBRED_Pos)                 /*!< 0x00003FFF */
#define HRPWM_DBRED_DBRED                         HRPWM_DBRED_DBRED_Msk

/********************************* Bit definition for HRPWM_DBFEDHR register ****************************************/
#define HRPWM_DBFEDHR_DBFEDHR_Pos                 (9U)
#define HRPWM_DBFEDHR_DBFEDHR_Msk                 (0x7FUL<<HRPWM_DBFEDHR_DBFEDHR_Pos)               /*!< 0x0000FE00 */
#define HRPWM_DBFEDHR_DBFEDHR                     HRPWM_DBFEDHR_DBFEDHR_Msk

/********************************* Bit definition for HRPWM_DBFED register ******************************************/
#define HRPWM_DBFED_DBFED_Pos                     (0U)
#define HRPWM_DBFED_DBFED_Msk                     (0x3FFFUL<<HRPWM_DBFED_DBFED_Pos)                 /*!< 0x00003FFF */
#define HRPWM_DBFED_DBFED                         HRPWM_DBFED_DBFED_Msk

