breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for HRPWM_TBPHS register ******************************************/
#define HRPWM_TBPHS_TBPHSHR_Pos                   (0U)
#define HRPWM_TBPHS_TBPHSHR_Msk                   (0xFFFFUL<<HRPWM_TBPHS_TBPHSHR_Pos)               /*!< 0x0000FFFF */
#define HRPWM_TBPHS_TBPHSHR                       HRPWM_TBPHS_TBPHSHR_Msk
#define HRPWM_TBPHS_TBPHS_Pos                     (16U)
#define HRPWM_TBPHS_TBPHS_Msk                     (0xFFFFUL<<HRPWM_TBPHS_TBPHS_Pos)                 /*!< 0xFFFF0000 */
#define HRPWM_TBPHS_TBPHS                         HRPWM_TBPHS_TBPHS_Msk

/********************************* Bit definition for HRPWM_TBPRDHR register ****************************************/
#define HRPWM_TBPRDHR_TBPRDHR_Pos                 (0U)
#define HRPWM_TBPRDHR_TBPRDHR_Msk                 (0xFFFFUL<<HRPWM_TBPRDHR_TBPRDHR_Pos)             /*!< 0x0000FFFF */
#define HRPWM_TBPRDHR_TBPRDHR                     HRPWM_TBPRDHR_TBPRDHR_Msk

/********************************* Bit definition for HRPWM_TBPRD register ******************************************/
#define HRPWM_TBPRD_TBPRD_Pos                     (0U)
#define HRPWM_TBPRD_TBPRD_Msk                     (0xFFFFUL<<HRPWM_TBPRD_TBPRD_Pos)                 /*!< 0x0000FFFF */
#define HRPWM_TBPRD_TBPRD                         HRPWM_TBPRD_TBPRD_Msk

/********************************* Bit definition for HRPWM_CMPA register *******************************************/
#define HRPWM_CMPA_CMPAHR_Pos                     (0U)
#define HRPWM_CMPA_CMPAHR_Msk                     (0xFFFFUL<<HRPWM_CMPA_CMPAHR_Pos)                 /*!< 0x0000FFFF */
#define HRPWM_CMPA_CMPAHR                         HRPWM_CMPA_CMPAHR_Msk
#define HRPWM_CMPA_CMPA_Pos                       (16U)
#define HRPWM_CMPA_CMPA_Msk                       (0xFFFFUL<<HRPWM_CMPA_CMPA_Pos)                   /*!< 0xFFFF0000 */
#define HRPWM_CMPA_CMPA                           HRPWM_CMPA_CMPA_Msk

/********************************* Bit definition for HRPWM_CMPB register *******************************************/
#define HRPWM_CMPB_CMPBHR_Pos                     (0U)
#define HRPWM_CMPB_CMPBHR_Msk                     (0xFFFFUL<<HRPWM_CMPB_CMPBHR_Pos)                 /*!< 0x0000FFFF */
#define HRPWM_CMPB_CMPBHR                         HRPWM_CMPB_CMPBHR_Msk
#define HRPWM_CMPB_CMPB_Pos                       (16U)
#define HRPWM_CMPB_CMPB_Msk                       (0xFFFFUL<<HRPWM_CMPB_CMPB_Pos)                   /*!< 0xFFFF0000 */
#define HRPWM_CMPB_CMPB                           HRPWM_CMPB_CMPB_Msk

/********************************* Bit definition for HRPWM_CMPC register *******************************************/
#define HRPWM_CMPC_CMPC_Pos                       (0U)
#define HRPWM_CMPC_CMPC_Msk                       (0xFFFFUL<<HRPWM_CMPC_CMPC_Pos)                   /*!< 0x0000FFFF */
#define HRPWM_CMPC_CMPC                           HRPWM_CMPC_CMPC_Msk

/********************************* Bit definition for HRPWM_CMPD register *******************************************/
#define HRPWM_CMPD_CMPD_Pos                       (0U)
#define HRPWM_CMPD_CMPD_Msk                       (0xFFFFUL<<HRPWM_CMPD_CMPD_Pos)                   /*!< 0x0000FFFF */
#define HRPWM_CMPD_CMPD                           HRPWM_CMPD_CMPD_Msk

/********************************* Bit definition for HRPWM_GLDCTL2 register ****************************************/
#define HRPWM_GLDCTL2_OSHTLD_Pos                  (0U)
#define HRPWM_GLDCTL2_OSHTLD_Msk                  (0x1UL<<HRPWM_GLDCTL2_OSHTLD_Pos)                 /*!< 0x00000001 */
#define HRPWM_GLDCTL2_OSHTLD                      HRPWM_GLDCTL2_OSHTLD_Msk                          
#define HRPWM_GLDCTL2_GFRCLD_Pos                  (1U)
#define HRPWM_GLDCTL2_GFRCLD_Msk                  (0x1UL<<HRPWM_GLDCTL2_GFRCLD_Pos)                 /*!< 0x00000002 */
#define HRPWM_GLDCTL2_GFRCLD                      HRPWM_GLDCTL2_GFRCLD_Msk                          

/********************************* Bit definition for HRPWM_SWVDELVAL register **************************************/
#define HRPWM_SWVDELVAL_SWVDELVAL_Pos             (0U)
#define HRPWM_SWVDELVAL_SWVDELVAL_Msk             (0xFFFFUL<<HRPWM_SWVDELVAL_SWVDELVAL_Pos)         /*!< 0x0000FFFF */
#define HRPWM_SWVDELVAL_SWVDELVAL                 HRPWM_SWVDELVAL_SWVDELVAL_Msk

/********************************* Bit definition for HRPWM_TZSEL register ******************************************/
#define HRPWM_TZSEL_CBC1_Pos                      (0U)
#define HRPWM_TZSEL_CBC1_Msk                      (0x1UL<<HRPWM_TZSEL_CBC1_Pos)                     /*!< 0x00000001 */
#define HRPWM_TZSEL_CBC1                          HRPWM_TZSEL_CBC1_Msk                              
#define HRPWM_TZSEL_CBC2_Pos                      (1U)
#define HRPWM_TZSEL_CBC2_Msk                      (0x1UL<<HRPWM_TZSEL_CBC2_Pos)                     /*!< 0x00000002 */
#define HRPWM_TZSEL_CBC2                          HRPWM_TZSEL_CBC2_Msk                              
#define HRPWM_TZSEL_CBC3_Pos                      (2U)
#define HRPWM_TZSEL_CBC3_Msk                      (0x1UL<<HRPWM_TZSEL_CBC3_Pos)                     /*!< 0x00000004 */
#define HRPWM_TZSEL_CBC3                          HRPWM_TZSEL_CBC3_Msk                              
#define HRPWM_TZSEL_CBC4_Pos                      (3U)
#define HRPWM_TZSEL_CBC4_Msk                      (0x1UL<<HRPWM_TZSEL_CBC4_Pos)                     /*!< 0x00000008 */
#define HRPWM_TZSEL_CBC4                          HRPWM_TZSEL_CBC4_Msk                              
#define HRPWM_TZSEL_CBC5_Pos                      (4U)
#define HRPWM_TZSEL_CBC5_Msk                      (0x1UL<<HRPWM_TZSEL_CBC5_Pos)                     /*!< 0x00000010 */
#define HRPWM_TZSEL_CBC5                          HRPWM_TZSEL_CBC5_Msk                              
#define HRPWM_TZSEL_CBC6_Pos                      (5U)
#define HRPWM_TZSEL_CBC6_Msk                      (0x1UL<<HRPWM_TZSEL_CBC6_Pos)                     /*!< 0x00000020 */
#define HRPWM_TZSEL_CBC6                          HRPWM_TZSEL_CBC6_Msk                              
#define HRPWM_TZSEL_DCAEVT2_Pos                   (6U)
#define HRPWM_TZSEL_DCAEVT2_Msk                   (0x1UL<<HRPWM_TZSEL_DCAEVT2_Pos)                  /*!< 0x00000040 */
#define HRPWM_TZSEL_DCAEVT2                       HRPWM_TZSEL_DCAEVT2_Msk                           
#define HRPWM_TZSEL_DCBEVT2_Pos                   (7U)
#define HRPWM_TZSEL_DCBEVT2_Msk                   (0x1UL<<HRPWM_TZSEL_DCBEVT2_Pos)                  /*!< 0x00000080 */
#define HRPWM_TZSEL_DCBEVT2                       HRPWM_TZSEL_DCBEVT2_Msk                           
#define HRPWM_TZSEL_OSHT1_Pos                     (8U)
#define HRPWM_TZSEL_OSHT1_Msk                     (0x1UL<<HRPWM_TZSEL_OSHT1_Pos)                    /*!< 0x00000100 */
#define HRPWM_TZSEL_OSHT1                         HRPWM_TZSEL_OSHT1_Msk                             
#define HRPWM_TZSEL_OSHT2_Pos                     (9U)
#define HRPWM_TZSEL_OSHT2_Msk                     (0x1UL<<HRPWM_TZSEL_OSHT2_Pos)                    /*!< 0x00000200 */
#define HRPWM_TZSEL_OSHT2                         HRPWM_TZSEL_OSHT2_Msk                             
#define HRPWM_TZSEL_OSHT3_Pos                     (10U)
#define HRPWM_TZSEL_OSHT3_Msk                     (0x1UL<<HRPWM_TZSEL_OSHT3_Pos)                    /*!< 0x00000400 */
#define HRPWM_TZSEL_OSHT3                         HRPWM_TZSEL_OSHT3_Msk                             
#define HRPWM_TZSEL_OSHT4_Pos                     (11U)
#define HRPWM_TZSEL_OSHT4_Msk                     (0x1UL<<HRPWM_TZSEL_OSHT4_Pos)                    /*!< 0x00000800 */
#define HRPWM_TZSEL_OSHT4                         HRPWM_TZSEL_OSHT4_Msk                             
#define HRPWM_TZSEL_OSHT5_Pos                     (12U)
#define HRPWM_TZSEL_OSHT5_Msk                     (0x1UL<<HRPWM_TZSEL_OSHT5_Pos)                    /*!< 0x00001000 */
#define HRPWM_TZSEL_OSHT5                         HRPWM_TZSEL_OSHT5_Msk                             
#define HRPWM_TZSEL_OSHT6_Pos                     (13U)
#define HRPWM_TZSEL_OSHT6_Msk                     (0x1UL<<HRPWM_TZSEL_OSHT6_Pos)                    /*!< 0x00002000 */
#define HRPWM_TZSEL_OSHT6                         HRPWM_TZSEL_OSHT6_Msk                             
#define HRPWM_TZSEL_DCAEVT1_Pos                   (14U)
#define HRPWM_TZSEL_DCAEVT1_Msk                   (0x1UL<<HRPWM_TZSEL_DCAEVT1_Pos)                  /*!< 0x00004000 */
#define HRPWM_TZSEL_DCAEVT1                       HRPWM_TZSEL_DCAEVT1_Msk                           
#define HRPWM_TZSEL_DCBEVT1_Pos                   (15U)
#define HRPWM_TZSEL_DCBEVT1_Msk                   (0x1UL<<HRPWM_TZSEL_DCBEVT1_Pos)                  /*!< 0x00008000 */
#define HRPWM_TZSEL_DCBEVT1                       HRPWM_TZSEL_DCBEVT1_Msk                           

/********************************* Bit definition for HRPWM_TZDCSEL register ****************************************/
#define HRPWM_TZDCSEL_DCAEVT1_Pos                 (0U)
#define HRPWM_TZDCSEL_DCAEVT1_Msk                 (0x7UL<<HRPWM_TZDCSEL_DCAEVT1_Pos)                /*!< 0x00000007 */
#define HRPWM_TZDCSEL_DCAEVT1                     HRPWM_TZDCSEL_DCAEVT1_Msk
#define HRPWM_TZDCSEL_DCAEVT1_0                   (0x1UL<<HRPWM_TZDCSEL_DCAEVT1_Pos)                /*!< 0x00000001 */
#define HRPWM_TZDCSEL_DCAEVT1_1                   (0x2UL<<HRPWM_TZDCSEL_DCAEVT1_Pos)                /*!< 0x00000002 */
#define HRPWM_TZDCSEL_DCAEVT1_2                   (0x4UL<<HRPWM_TZDCSEL_DCAEVT1_Pos)                /*!< 0x00000004 */
#define HRPWM_TZDCSEL_DCAEVT2_Pos                 (3U)
#define HRPWM_TZDCSEL_DCAEVT2_Msk                 (0x7UL<<HRPWM_TZDCSEL_DCAEVT2_Pos)                /*!< 0x00000038 */
#define HRPWM_TZDCSEL_DCAEVT2                     HRPWM_TZDCSEL_DCAEVT2_Msk
#define HRPWM_TZDCSEL_DCAEVT2_0                   (0x1UL<<HRPWM_TZDCSEL_DCAEVT2_Pos)                /*!< 0x00000008 */
#define HRPWM_TZDCSEL_DCAEVT2_1                   (0x2UL<<HRPWM_TZDCSEL_DCAEVT2_Pos)                /*!< 0x00000010 */
#define HRPWM_TZDCSEL_DCAEVT2_2                   (0x4UL<<HRPWM_TZDCSEL_DCAEVT2_Pos)                /*!< 0x00000020 */
#define HRPWM_TZDCSEL_DCBEVT1_Pos                 (6U)
#define HRPWM_TZDCSEL_DCBEVT1_Msk                 (0x7UL<<HRPWM_TZDCSEL_DCBEVT1_Pos)                /*!< 0x000001C0 */
#define HRPWM_TZDCSEL_DCBEVT1                     HRPWM_TZDCSEL_DCBEVT1_Msk
#define HRPWM_TZDCSEL_DCBEVT1_0                   (0x1UL<<HRPWM_TZDCSEL_DCBEVT1_Pos)                /*!< 0x00000040 */
#define HRPWM_TZDCSEL_DCBEVT1_1                   (0x2UL<<HRPWM_TZDCSEL_DCBEVT1_Pos)                /*!< 0x00000080 */
#define HRPWM_TZDCSEL_DCBEVT1_2                   (0x4UL<<HRPWM_TZDCSEL_DCBEVT1_Pos)                /*!< 0x00000100 */
#define HRPWM_TZDCSEL_DCBEVT2_Pos                 (9U)
#define HRPWM_TZDCSEL_DCBEVT2_Msk                 (0x7UL<<HRPWM_TZDCSEL_DCBEVT2_Pos)                /*!< 0x00000E00 */
#define HRPWM_TZDCSEL_DCBEVT2                     HRPWM_TZDCSEL_DCBEVT2_Msk
#define HRPWM_TZDCSEL_DCBEVT2_0                   (0x1UL<<HRPWM_TZDCSEL_DCBEVT2_Pos)                /*!< 0x00000200 */
#define HRPWM_TZDCSEL_DCBEVT2_1                   (0x2UL<<HRPWM_TZDCSEL_DCBEVT2_Pos)                /*!< 0x00000400 */
#define HRPWM_TZDCSEL_DCBEVT2_2                   (0x4UL<<HRPWM_TZDCSEL_DCBEVT2_Pos)                /*!< 0x00000800 */

/********************************* Bit definition for HRPWM_TZCTL register ******************************************/
#define HRPWM_TZCTL_TZA_Pos                       (0U)
#define HRPWM_TZCTL_TZA_Msk                       (0x3UL<<HRPWM_TZCTL_TZA_Pos)                      /*!< 0x00000003 */
#define HRPWM_TZCTL_TZA                           HRPWM_TZCTL_TZA_Msk
#define HRPWM_TZCTL_TZA_0                         (0x1UL<<HRPWM_TZCTL_TZA_Pos)                      /*!< 0x00000001 */
#define HRPWM_TZCTL_TZA_1                         (0x2UL<<HRPWM_TZCTL_TZA_Pos)                      /*!< 0x00000002 */
#define HRPWM_TZCTL_TZB_Pos                       (2U)
#define HRPWM_TZCTL_TZB_Msk                       (0x3UL<<HRPWM_TZCTL_TZB_Pos)                      /*!< 0x0000000C */
#define HRPWM_TZCTL_TZB                           HRPWM_TZCTL_TZB_Msk
#define HRPWM_TZCTL_TZB_0                         (0x1UL<<HRPWM_TZCTL_TZB_Pos)                      /*!< 0x00000004 */
#define HRPWM_TZCTL_TZB_1                         (0x2UL<<HRPWM_TZCTL_TZB_Pos)                      /*!< 0x00000008 */
#define HRPWM_TZCTL_DCAEVT1_Pos                   (4U)
#define HRPWM_TZCTL_DCAEVT1_Msk                   (0x3UL<<HRPWM_TZCTL_DCAEVT1_Pos)                  /*!< 0x00000030 */
#define HRPWM_TZCTL_DCAEVT1                       HRPWM_TZCTL_DCAEVT1_Msk
#define HRPWM_TZCTL_DCAEVT1_0                     (0x1UL<<HRPWM_TZCTL_DCAEVT1_Pos)                  /*!< 0x00000010 */
#define HRPWM_TZCTL_DCAEVT1_1                     (0x2UL<<HRPWM_TZCTL_DCAEVT1_Pos)                  /*!< 0x00000020 */
#define HRPWM_TZCTL_DCAEVT2_Pos                   (6U)
#define HRPWM_TZCTL_DCAEVT2_Msk                   (0x3UL<<HRPWM_TZCTL_DCAEVT2_Pos)                  /*!< 0x000000C0 */
#define HRPWM_TZCTL_DCAEVT2                       HRPWM_TZCTL_DCAEVT2_Msk
#define HRPWM_TZCTL_DCAEVT2_0                     (0x1UL<<HRPWM_TZCTL_DCAEVT2_Pos)                  /*!< 0x00000040 */
#define HRPWM_TZCTL_DCAEVT2_1                     (0x2UL<<HRPWM_TZCTL_DCAEVT2_Pos)                  /*!< 0x00000080 */
#define HRPWM_TZCTL_DCBEVT1_Pos                   (8U)
#define HRPWM_TZCTL_DCBEVT1_Msk                   (0x3UL<<HRPWM_TZCTL_DCBEVT1_Pos)                  /*!< 0x00000300 */
#define HRPWM_TZCTL_DCBEVT1                       HRPWM_TZCTL_DCBEVT1_Msk
#define HRPWM_TZCTL_DCBEVT1_0                     (0x1UL<<HRPWM_TZCTL_DCBEVT1_Pos)                  /*!< 0x00000100 */
#define HRPWM_TZCTL_DCBEVT1_1                     (0x2UL<<HRPWM_TZCTL_DCBEVT1_Pos)                  /*!< 0x00000200 */
#define HRPWM_TZCTL_DCBEVT2_Pos                   (10U)
#define HRPWM_TZCTL_DCBEVT2_Msk                   (0x3UL<<HRPWM_TZCTL_DCBEVT2_Pos)                  /*!< 0x00000C00 */
#define HRPWM_TZCTL_DCBEVT2                       HRPWM_TZCTL_DCBEVT2_Msk
#define HRPWM_TZCTL_DCBEVT2_0                     (0x1UL<<HRPWM_TZCTL_DCBEVT2_Pos)                  /*!< 0x00000400 */
#define HRPWM_TZCTL_DCBEVT2_1                     (0x2UL<<HRPWM_TZCTL_DCBEVT2_Pos)                  /*!< 0x00000800 */

/********************************* Bit definition for HRPWM_TZCTL2 register *****************************************/
#define HRPWM_TZCTL2_TZAU_Pos                     (0U)
#define HRPWM_TZCTL2_TZAU_Msk                     (0x7UL<<HRPWM_TZCTL2_TZAU_Pos)                    /*!< 0x00000007 */
#define HRPWM_TZCTL2_TZAU                         HRPWM_TZCTL2_TZAU_Msk
#define HRPWM_TZCTL2_TZAU_0                       (0x1UL<<HRPWM_TZCTL2_TZAU_Pos)                    /*!< 0x00000001 */
#define HRPWM_TZCTL2_TZAU_1                       (0x2UL<<HRPWM_TZCTL2_TZAU_Pos)                    /*!< 0x00000002 */
#define HRPWM_TZCTL2_TZAU_2                       (0x4UL<<HRPWM_TZCTL2_TZAU_Pos)                    /*!< 0x00000004 */
#define HRPWM_TZCTL2_TZAD_Pos                     (3U)
#define HRPWM_TZCTL2_TZAD_Msk                     (0x7UL<<HRPWM_TZCTL2_TZAD_Pos)                    /*!< 0x00000038 */
#define HRPWM_TZCTL2_TZAD                         HRPWM_TZCTL2_TZAD_Msk
#define HRPWM_TZCTL2_TZAD_0                       (0x1UL<<HRPWM_TZCTL2_TZAD_Pos)                    /*!< 0x00000008 */
#define HRPWM_TZCTL2_TZAD_1                       (0x2UL<<HRPWM_TZCTL2_TZAD_Pos)                    /*!< 0x00000010 */
#define HRPWM_TZCTL2_TZAD_2                       (0x4UL<<HRPWM_TZCTL2_TZAD_Pos)                    /*!< 0x00000020 */
#define HRPWM_TZCTL2_TZBU_Pos                     (6U)
#define HRPWM_TZCTL2_TZBU_Msk                     (0x7UL<<HRPWM_TZCTL2_TZBU_Pos)                    /*!< 0x000001C0 */
#define HRPWM_TZCTL2_TZBU                         HRPWM_TZCTL2_TZBU_Msk
#define HRPWM_TZCTL2_TZBU_0                       (0x1UL<<HRPWM_TZCTL2_TZBU_Pos)                    /*!< 0x00000040 */
#define HRPWM_TZCTL2_TZBU_1                       (0x2UL<<HRPWM_TZCTL2_TZBU_Pos)                    /*!< 0x00000080 */
#define HRPWM_TZCTL2_TZBU_2                       (0x4UL<<HRPWM_TZCTL2_TZBU_Pos)                    /*!< 0x00000100 */
#define HRPWM_TZCTL2_TZBD_Pos                     (9U)
#define HRPWM_TZCTL2_TZBD_Msk                     (0x7UL<<HRPWM_TZCTL2_TZBD_Pos)                    /*!< 0x00000E00 */
#define HRPWM_TZCTL2_TZBD                         HRPWM_TZCTL2_TZBD_Msk
#define HRPWM_TZCTL2_TZBD_0                       (0x1UL<<HRPWM_TZCTL2_TZBD_Pos)                    /*!< 0x00000200 */
#define HRPWM_TZCTL2_TZBD_1                       (0x2UL<<HRPWM_TZCTL2_TZBD_Pos)                    /*!< 0x00000400 */
#define HRPWM_TZCTL2_TZBD_2                       (0x4UL<<HRPWM_TZCTL2_TZBD_Pos)                    /*!< 0x00000800 */
#define HRPWM_TZCTL2_ETZE_Pos                     (15U)
#define HRPWM_TZCTL2_ETZE_Msk                     (0x1UL<<HRPWM_TZCTL2_ETZE_Pos)                    /*!< 0x00008000 */
#define HRPWM_TZCTL2_ETZE                         HRPWM_TZCTL2_ETZE_Msk                             

/********************************* Bit definition for HRPWM_TZCTLDCA register ***************************************/
#define HRPWM_TZCTLDCA_DCAEVT1U_Pos               (0U)
#define HRPWM_TZCTLDCA_DCAEVT1U_Msk               (0x7UL<<HRPWM_TZCTLDCA_DCAEVT1U_Pos)              /*!< 0x00000007 */
#define HRPWM_TZCTLDCA_DCAEVT1U                   HRPWM_TZCTLDCA_DCAEVT1U_Msk
#define HRPWM_TZCTLDCA_DCAEVT1U_0                 (0x1UL<<HRPWM_TZCTLDCA_DCAEVT1U_Pos)              /*!< 0x00000001 */
#define HRPWM_TZCTLDCA_DCAEVT1U_1                 (0x2UL<<HRPWM_TZCTLDCA_DCAEVT1U_Pos)              /*!< 0x00000002 */
#define HRPWM_TZCTLDCA_DCAEVT1U_2                 (0x4UL<<HRPWM_TZCTLDCA_DCAEVT1U_Pos)              /*!< 0x00000004 */
#define HRPWM_TZCTLDCA_DCAEVT1D_Pos               (3U)
#define HRPWM_TZCTLDCA_DCAEVT1D_Msk               (0x7UL<<HRPWM_TZCTLDCA_DCAEVT1D_Pos)              /*!< 0x00000038 */
#define HRPWM_TZCTLDCA_DCAEVT1D                   HRPWM_TZCTLDCA_DCAEVT1D_Msk
#define HRPWM_TZCTLDCA_DCAEVT1D_0                 (0x1UL<<HRPWM_TZCTLDCA_DCAEVT1D_Pos)              /*!< 0x00000008 */
#define HRPWM_TZCTLDCA_DCAEVT1D_1                 (0x2UL<<HRPWM_TZCTLDCA_DCAEVT1D_Pos)              /*!< 0x00000010 */
#define HRPWM_TZCTLDCA_DCAEVT1D_2                 (0x4UL<<HRPWM_TZCTLDCA_DCAEVT1D_Pos)              /*!< 0x00000020 */
#define HRPWM_TZCTLDCA_DCAEVT2U_Pos               (6U)
#define HRPWM_TZCTLDCA_DCAEVT2U_Msk               (0x7UL<<HRPWM_TZCTLDCA_DCAEVT2U_Pos)              /*!< 0x000001C0 */
#define HRPWM_TZCTLDCA_DCAEVT2U                   HRPWM_TZCTLDCA_DCAEVT2U_Msk
#define HRPWM_TZCTLDCA_DCAEVT2U_0                 (0x1UL<<HRPWM_TZCTLDCA_DCAEVT2U_Pos)              /*!< 0x00000040 */
#define HRPWM_TZCTLDCA_DCAEVT2U_1                 (0x2UL<<HRPWM_TZCTLDCA_DCAEVT2U_Pos)              /*!< 0x00000080 */
#define HRPWM_TZCTLDCA_DCAEVT2U_2                 (0x4UL<<HRPWM_TZCTLDCA_DCAEVT2U_Pos)              /*!< 0x00000100 */
#define HRPWM_TZCTLDCA_DCAEVT2D_Pos               (9U)
#define HRPWM_TZCTLDCA_DCAEVT2D_Msk               (0x7UL<<HRPWM_TZCTLDCA_DCAEVT2D_Pos)              /*!< 0x00000E00 */
#define HRPWM_TZCTLDCA_DCAEVT2D                   HRPWM_TZCTLDCA_DCAEVT2D_Msk
#define HRPWM_TZCTLDCA_DCAEVT2D_0                 (0x1UL<<HRPWM_TZCTLDCA_DCAEVT2D_Pos)              /*!< 0x00000200 */
#define HRPWM_TZCTLDCA_DCAEVT2D_1                 (0x2UL<<HRPWM_TZCTLDCA_DCAEVT2D_Pos)              /*!< 0x00000400 */
#define HRPWM_TZCTLDCA_DCAEVT2D_2                 (0x4UL<<HRPWM_TZCTLDCA_DCAEVT2D_Pos)              /*!< 0x00000800 */

/********************************* Bit definition for HRPWM_TZCTLDCB register ***************************************/
#define HRPWM_TZCTLDCB_DCBEVT1U_Pos               (0U)
#define HRPWM_TZCTLDCB_DCBEVT1U_Msk               (0x7UL<<HRPWM_TZCTLDCB_DCBEVT1U_Pos)              /*!< 0x00000007 */
#define HRPWM_TZCTLDCB_DCBEVT1U                   HRPWM_TZCTLDCB_DCBEVT1U_Msk
#define HRPWM_TZCTLDCB_DCBEVT1U_0                 (0x1UL<<HRPWM_TZCTLDCB_DCBEVT1U_Pos)              /*!< 0x00000001 */
#define HRPWM_TZCTLDCB_DCBEVT1U_1                 (0x2UL<<HRPWM_TZCTLDCB_DCBEVT1U_Pos)              /*!< 0x00000002 */
#define HRPWM_TZCTLDCB_DCBEVT1U_2                 (0x4UL<<HRPWM_TZCTLDCB_DCBEVT1U_Pos)              /*!< 0x00000004 */
#define HRPWM_TZCTLDCB_DCBEVT1D_Pos               (3U)
#define HRPWM_TZCTLDCB_DCBEVT1D_Msk               (0x7UL<<HRPWM_TZCTLDCB_DCBEVT1D_Pos)              /*!< 0x00000038 */
#define HRPWM_TZCTLDCB_DCBEVT1D                   HRPWM_TZCTLDCB_DCBEVT1D_Msk
#define HRPWM_TZCTLDCB_DCBEVT1D_0                 (0x1UL<<HRPWM_TZCTLDCB_DCBEVT1D_Pos)              /*!< 0x00000008 */
#define HRPWM_TZCTLDCB_DCBEVT1D_1                 (0x2UL<<HRPWM_TZCTLDCB_DCBEVT1D_Pos)              /*!< 0x00000010 */
#define HRPWM_TZCTLDCB_DCBEVT1D_2                 (0x4UL<<HRPWM_TZCTLDCB_DCBEVT1D_Pos)              /*!< 0x00000020 */
#define HRPWM_TZCTLDCB_DCBEVT2U_Pos               (6U)
#define HRPWM_TZCTLDCB_DCBEVT2U_Msk               (0x7UL<<HRPWM_TZCTLDCB_DCBEVT2U_Pos)              /*!< 0x000001C0 */
#define HRPWM_TZCTLDCB_DCBEVT2U                   HRPWM_TZCTLDCB_DCBEVT2U_Msk
#define HRPWM_TZCTLDCB_DCBEVT2U_0                 (0x1UL<<HRPWM_TZCTLDCB_DCBEVT2U_Pos)              /*!< 0x00000040 */
#define HRPWM_TZCTLDCB_DCBEVT2U_1                 (0x2UL<<HRPWM_TZCTLDCB_DCBEVT2U_Pos)              /*!< 0x00000080 */
#define HRPWM_TZCTLDCB_DCBEVT2U_2                 (0x4UL<<HRPWM_TZCTLDCB_DCBEVT2U_Pos)              /*!< 0x00000100 */
#define HRPWM_TZCTLDCB_DCBEVT2D_Pos               (9U)
#define HRPWM_TZCTLDCB_DCBEVT2D_Msk               (0x7UL<<HRPWM_TZCTLDCB_DCBEVT2D_Pos)              /*!< 0x00000E00 */
#define HRPWM_TZCTLDCB_DCBEVT2D                   HRPWM_TZCTLDCB_DCBEVT2D_Msk
#define HRPWM_TZCTLDCB_DCBEVT2D_0                 (0x1UL<<HRPWM_TZCTLDCB_DCBEVT2D_Pos)              /*!< 0x00000200 */
#define HRPWM_TZCTLDCB_DCBEVT2D_1                 (0x2UL<<HRPWM_TZCTLDCB_DCBEVT2D_Pos)              /*!< 0x00000400 */
#define HRPWM_TZCTLDCB_DCBEVT2D_2                 (0x4UL<<HRPWM_TZCTLDCB_DCBEVT2D_Pos)              /*!< 0x00000800 */

