breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for HRPWM_TZEINT register *****************************************/
#define HRPWM_TZEINT_CBC_Pos                      (1U)
#define HRPWM_TZEINT_CBC_Msk                      (0x1UL<<HRPWM_TZEINT_CBC_Pos)                     /*!< 0x00000002 */
#define HRPWM_TZEINT_CBC                          HRPWM_TZEINT_CBC_Msk                              
#define HRPWM_TZEINT_OST_Pos                      (2U)
#define HRPWM_TZEINT_OST_Msk                      (0x1UL<<HRPWM_TZEINT_OST_Pos)                     /*!< 0x00000004 */
#define HRPWM_TZEINT_OST                          HRPWM_TZEINT_OST_Msk                              
#define HRPWM_TZEINT_DCAEVT1_Pos                  (3U)
#define HRPWM_TZEINT_DCAEVT1_Msk                  (0x1UL<<HRPWM_TZEINT_DCAEVT1_Pos)                 /*!< 0x00000008 */
#define HRPWM_TZEINT_DCAEVT1                      HRPWM_TZEINT_DCAEVT1_Msk                          
#define HRPWM_TZEINT_DCAEVT2_Pos                  (4U)
#define HRPWM_TZEINT_DCAEVT2_Msk                  (0x1UL<<HRPWM_TZEINT_DCAEVT2_Pos)                 /*!< 0x00000010 */
#define HRPWM_TZEINT_DCAEVT2                      HRPWM_TZEINT_DCAEVT2_Msk                          
#define HRPWM_TZEINT_DCBEVT1_Pos                  (5U)
#define HRPWM_TZEINT_DCBEVT1_Msk                  (0x1UL<<HRPWM_TZEINT_DCBEVT1_Pos)                 /*!< 0x00000020 */
#define HRPWM_TZEINT_DCBEVT1                      HRPWM_TZEINT_DCBEVT1_Msk                          
#define HRPWM_TZEINT_DCBEVT2_Pos                  (6U)
#define HRPWM_TZEINT_DCBEVT2_Msk                  (0x1UL<<HRPWM_TZEINT_DCBEVT2_Pos)                 /*!< 0x00000040 */
#define HRPWM_TZEINT_DCBEVT2                      HRPWM_TZEINT_DCBEVT2_Msk                          

/********************************* Bit definition for HRPWM_TZFLG register ******************************************/
#define HRPWM_TZFLG_INT_Pos                       (0U)
#define HRPWM_TZFLG_INT_Msk                       (0x1UL<<HRPWM_TZFLG_INT_Pos)                      /*!< 0x00000001 */
#define HRPWM_TZFLG_INT                           HRPWM_TZFLG_INT_Msk                               
#define HRPWM_TZFLG_CBC_Pos                       (1U)
#define HRPWM_TZFLG_CBC_Msk                       (0x1UL<<HRPWM_TZFLG_CBC_Pos)                      /*!< 0x00000002 */
#define HRPWM_TZFLG_CBC                           HRPWM_TZFLG_CBC_Msk                               
#define HRPWM_TZFLG_OST_Pos                       (2U)
#define HRPWM_TZFLG_OST_Msk                       (0x1UL<<HRPWM_TZFLG_OST_Pos)                      /*!< 0x00000004 */
#define HRPWM_TZFLG_OST                           HRPWM_TZFLG_OST_Msk                               
#define HRPWM_TZFLG_DCAEVT1_Pos                   (3U)
#define HRPWM_TZFLG_DCAEVT1_Msk                   (0x1UL<<HRPWM_TZFLG_DCAEVT1_Pos)                  /*!< 0x00000008 */
#define HRPWM_TZFLG_DCAEVT1                       HRPWM_TZFLG_DCAEVT1_Msk                           
#define HRPWM_TZFLG_DCAEVT2_Pos                   (4U)
#define HRPWM_TZFLG_DCAEVT2_Msk                   (0x1UL<<HRPWM_TZFLG_DCAEVT2_Pos)                  /*!< 0x00000010 */
#define HRPWM_TZFLG_DCAEVT2                       HRPWM_TZFLG_DCAEVT2_Msk                           
#define HRPWM_TZFLG_DCBEVT1_Pos                   (5U)
#define HRPWM_TZFLG_DCBEVT1_Msk                   (0x1UL<<HRPWM_TZFLG_DCBEVT1_Pos)                  /*!< 0x00000020 */
#define HRPWM_TZFLG_DCBEVT1                       HRPWM_TZFLG_DCBEVT1_Msk                           
#define HRPWM_TZFLG_DCBEVT2_Pos                   (6U)
#define HRPWM_TZFLG_DCBEVT2_Msk                   (0x1UL<<HRPWM_TZFLG_DCBEVT2_Pos)                  /*!< 0x00000040 */
#define HRPWM_TZFLG_DCBEVT2                       HRPWM_TZFLG_DCBEVT2_Msk                           

/********************************* Bit definition for HRPWM_TZCBCFLG register ***************************************/
#define HRPWM_TZCBCFLG_CBC1_Pos                   (0U)
#define HRPWM_TZCBCFLG_CBC1_Msk                   (0x1UL<<HRPWM_TZCBCFLG_CBC1_Pos)                  /*!< 0x00000001 */
#define HRPWM_TZCBCFLG_CBC1                       HRPWM_TZCBCFLG_CBC1_Msk                           
#define HRPWM_TZCBCFLG_CBC2_Pos                   (1U)
#define HRPWM_TZCBCFLG_CBC2_Msk                   (0x1UL<<HRPWM_TZCBCFLG_CBC2_Pos)                  /*!< 0x00000002 */
#define HRPWM_TZCBCFLG_CBC2                       HRPWM_TZCBCFLG_CBC2_Msk                           
#define HRPWM_TZCBCFLG_CBC3_Pos                   (2U)
#define HRPWM_TZCBCFLG_CBC3_Msk                   (0x1UL<<HRPWM_TZCBCFLG_CBC3_Pos)                  /*!< 0x00000004 */
#define HRPWM_TZCBCFLG_CBC3                       HRPWM_TZCBCFLG_CBC3_Msk                           
#define HRPWM_TZCBCFLG_CBC4_Pos                   (3U)
#define HRPWM_TZCBCFLG_CBC4_Msk                   (0x1UL<<HRPWM_TZCBCFLG_CBC4_Pos)                  /*!< 0x00000008 */
#define HRPWM_TZCBCFLG_CBC4                       HRPWM_TZCBCFLG_CBC4_Msk                           
#define HRPWM_TZCBCFLG_CBC5_Pos                   (4U)
#define HRPWM_TZCBCFLG_CBC5_Msk                   (0x1UL<<HRPWM_TZCBCFLG_CBC5_Pos)                  /*!< 0x00000010 */
#define HRPWM_TZCBCFLG_CBC5                       HRPWM_TZCBCFLG_CBC5_Msk                           
#define HRPWM_TZCBCFLG_CBC6_Pos                   (5U)
#define HRPWM_TZCBCFLG_CBC6_Msk                   (0x1UL<<HRPWM_TZCBCFLG_CBC6_Pos)                  /*!< 0x00000020 */
#define HRPWM_TZCBCFLG_CBC6                       HRPWM_TZCBCFLG_CBC6_Msk                           
#define HRPWM_TZCBCFLG_DCAEVT2_Pos                (6U)
#define HRPWM_TZCBCFLG_DCAEVT2_Msk                (0x1UL<<HRPWM_TZCBCFLG_DCAEVT2_Pos)               /*!< 0x00000040 */
#define HRPWM_TZCBCFLG_DCAEVT2                    HRPWM_TZCBCFLG_DCAEVT2_Msk                        
#define HRPWM_TZCBCFLG_DCBEVT2_Pos                (7U)
#define HRPWM_TZCBCFLG_DCBEVT2_Msk                (0x1UL<<HRPWM_TZCBCFLG_DCBEVT2_Pos)               /*!< 0x00000080 */
#define HRPWM_TZCBCFLG_DCBEVT2                    HRPWM_TZCBCFLG_DCBEVT2_Msk                        

/********************************* Bit definition for HRPWM_TZOSTFLG register ***************************************/
#define HRPWM_TZOSTFLG_OST1_Pos                   (0U)
#define HRPWM_TZOSTFLG_OST1_Msk                   (0x1UL<<HRPWM_TZOSTFLG_OST1_Pos)                  /*!< 0x00000001 */
#define HRPWM_TZOSTFLG_OST1                       HRPWM_TZOSTFLG_OST1_Msk                           
#define HRPWM_TZOSTFLG_OST2_Pos                   (1U)
#define HRPWM_TZOSTFLG_OST2_Msk                   (0x1UL<<HRPWM_TZOSTFLG_OST2_Pos)                  /*!< 0x00000002 */
#define HRPWM_TZOSTFLG_OST2                       HRPWM_TZOSTFLG_OST2_Msk                           
#define HRPWM_TZOSTFLG_OST3_Pos                   (2U)
#define HRPWM_TZOSTFLG_OST3_Msk                   (0x1UL<<HRPWM_TZOSTFLG_OST3_Pos)                  /*!< 0x00000004 */
#define HRPWM_TZOSTFLG_OST3                       HRPWM_TZOSTFLG_OST3_Msk                           
#define HRPWM_TZOSTFLG_OST4_Pos                   (3U)
#define HRPWM_TZOSTFLG_OST4_Msk                   (0x1UL<<HRPWM_TZOSTFLG_OST4_Pos)                  /*!< 0x00000008 */
#define HRPWM_TZOSTFLG_OST4                       HRPWM_TZOSTFLG_OST4_Msk                           
#define HRPWM_TZOSTFLG_OST5_Pos                   (4U)
#define HRPWM_TZOSTFLG_OST5_Msk                   (0x1UL<<HRPWM_TZOSTFLG_OST5_Pos)                  /*!< 0x00000010 */
#define HRPWM_TZOSTFLG_OST5                       HRPWM_TZOSTFLG_OST5_Msk                           
#define HRPWM_TZOSTFLG_OST6_Pos                   (5U)
#define HRPWM_TZOSTFLG_OST6_Msk                   (0x1UL<<HRPWM_TZOSTFLG_OST6_Pos)                  /*!< 0x00000020 */
#define HRPWM_TZOSTFLG_OST6                       HRPWM_TZOSTFLG_OST6_Msk                           
#define HRPWM_TZOSTFLG_DCAEVT1_Pos                (6U)
#define HRPWM_TZOSTFLG_DCAEVT1_Msk                (0x1UL<<HRPWM_TZOSTFLG_DCAEVT1_Pos)               /*!< 0x00000040 */
#define HRPWM_TZOSTFLG_DCAEVT1                    HRPWM_TZOSTFLG_DCAEVT1_Msk                        
#define HRPWM_TZOSTFLG_DCBEVT1_Pos                (7U)
#define HRPWM_TZOSTFLG_DCBEVT1_Msk                (0x1UL<<HRPWM_TZOSTFLG_DCBEVT1_Pos)               /*!< 0x00000080 */
#define HRPWM_TZOSTFLG_DCBEVT1                    HRPWM_TZOSTFLG_DCBEVT1_Msk                        

/********************************* Bit definition for HRPWM_TZCLR register ******************************************/
#define HRPWM_TZCLR_INT_Pos                       (0U)
#define HRPWM_TZCLR_INT_Msk                       (0x1UL<<HRPWM_TZCLR_INT_Pos)                      /*!< 0x00000001 */
#define HRPWM_TZCLR_INT                           HRPWM_TZCLR_INT_Msk                               
#define HRPWM_TZCLR_CBC_Pos                       (1U)
#define HRPWM_TZCLR_CBC_Msk                       (0x1UL<<HRPWM_TZCLR_CBC_Pos)                      /*!< 0x00000002 */
#define HRPWM_TZCLR_CBC                           HRPWM_TZCLR_CBC_Msk                               
#define HRPWM_TZCLR_OST_Pos                       (2U)
#define HRPWM_TZCLR_OST_Msk                       (0x1UL<<HRPWM_TZCLR_OST_Pos)                      /*!< 0x00000004 */
#define HRPWM_TZCLR_OST                           HRPWM_TZCLR_OST_Msk                               
#define HRPWM_TZCLR_DCAEVT1_Pos                   (3U)
#define HRPWM_TZCLR_DCAEVT1_Msk                   (0x1UL<<HRPWM_TZCLR_DCAEVT1_Pos)                  /*!< 0x00000008 */
#define HRPWM_TZCLR_DCAEVT1                       HRPWM_TZCLR_DCAEVT1_Msk                           
#define HRPWM_TZCLR_DCAEVT2_Pos                   (4U)
#define HRPWM_TZCLR_DCAEVT2_Msk                   (0x1UL<<HRPWM_TZCLR_DCAEVT2_Pos)                  /*!< 0x00000010 */
#define HRPWM_TZCLR_DCAEVT2                       HRPWM_TZCLR_DCAEVT2_Msk                           
#define HRPWM_TZCLR_DCBEVT1_Pos                   (5U)
#define HRPWM_TZCLR_DCBEVT1_Msk                   (0x1UL<<HRPWM_TZCLR_DCBEVT1_Pos)                  /*!< 0x00000020 */
#define HRPWM_TZCLR_DCBEVT1                       HRPWM_TZCLR_DCBEVT1_Msk                           
#define HRPWM_TZCLR_DCBEVT2_Pos                   (6U)
#define HRPWM_TZCLR_DCBEVT2_Msk                   (0x1UL<<HRPWM_TZCLR_DCBEVT2_Pos)                  /*!< 0x00000040 */
#define HRPWM_TZCLR_DCBEVT2                       HRPWM_TZCLR_DCBEVT2_Msk                           
#define HRPWM_TZCLR_CBCPULSE_Pos                  (14U)
#define HRPWM_TZCLR_CBCPULSE_Msk                  (0x3UL<<HRPWM_TZCLR_CBCPULSE_Pos)                 /*!< 0x0000C000 */
#define HRPWM_TZCLR_CBCPULSE                      HRPWM_TZCLR_CBCPULSE_Msk
#define HRPWM_TZCLR_CBCPULSE_0                    (0x1UL<<HRPWM_TZCLR_CBCPULSE_Pos)                 /*!< 0x00004000 */
#define HRPWM_TZCLR_CBCPULSE_1                    (0x2UL<<HRPWM_TZCLR_CBCPULSE_Pos)                 /*!< 0x00008000 */

/********************************* Bit definition for HRPWM_TZCBCCLR register ***************************************/
#define HRPWM_TZCBCCLR_CBC1_Pos                   (0U)
#define HRPWM_TZCBCCLR_CBC1_Msk                   (0x1UL<<HRPWM_TZCBCCLR_CBC1_Pos)                  /*!< 0x00000001 */
#define HRPWM_TZCBCCLR_CBC1                       HRPWM_TZCBCCLR_CBC1_Msk                           
#define HRPWM_TZCBCCLR_CBC2_Pos                   (1U)
#define HRPWM_TZCBCCLR_CBC2_Msk                   (0x1UL<<HRPWM_TZCBCCLR_CBC2_Pos)                  /*!< 0x00000002 */
#define HRPWM_TZCBCCLR_CBC2                       HRPWM_TZCBCCLR_CBC2_Msk                           
#define HRPWM_TZCBCCLR_CBC3_Pos                   (2U)
#define HRPWM_TZCBCCLR_CBC3_Msk                   (0x1UL<<HRPWM_TZCBCCLR_CBC3_Pos)                  /*!< 0x00000004 */
#define HRPWM_TZCBCCLR_CBC3                       HRPWM_TZCBCCLR_CBC3_Msk                           
#define HRPWM_TZCBCCLR_CBC4_Pos                   (3U)
#define HRPWM_TZCBCCLR_CBC4_Msk                   (0x1UL<<HRPWM_TZCBCCLR_CBC4_Pos)                  /*!< 0x00000008 */
#define HRPWM_TZCBCCLR_CBC4                       HRPWM_TZCBCCLR_CBC4_Msk                           
#define HRPWM_TZCBCCLR_CBC5_Pos                   (4U)
#define HRPWM_TZCBCCLR_CBC5_Msk                   (0x1UL<<HRPWM_TZCBCCLR_CBC5_Pos)                  /*!< 0x00000010 */
#define HRPWM_TZCBCCLR_CBC5                       HRPWM_TZCBCCLR_CBC5_Msk                           
#define HRPWM_TZCBCCLR_CBC6_Pos                   (5U)
#define HRPWM_TZCBCCLR_CBC6_Msk                   (0x1UL<<HRPWM_TZCBCCLR_CBC6_Pos)                  /*!< 0x00000020 */
#define HRPWM_TZCBCCLR_CBC6                       HRPWM_TZCBCCLR_CBC6_Msk                           
#define HRPWM_TZCBCCLR_DCAEVT2_Pos                (6U)
#define HRPWM_TZCBCCLR_DCAEVT2_Msk                (0x1UL<<HRPWM_TZCBCCLR_DCAEVT2_Pos)               /*!< 0x00000040 */
#define HRPWM_TZCBCCLR_DCAEVT2                    HRPWM_TZCBCCLR_DCAEVT2_Msk                        
#define HRPWM_TZCBCCLR_DCBEVT2_Pos                (7U)
#define HRPWM_TZCBCCLR_DCBEVT2_Msk                (0x1UL<<HRPWM_TZCBCCLR_DCBEVT2_Pos)               /*!< 0x00000080 */
#define HRPWM_TZCBCCLR_DCBEVT2                    HRPWM_TZCBCCLR_DCBEVT2_Msk                        

/********************************* Bit definition for HRPWM_TZOSTCLR register ***************************************/
#define HRPWM_TZOSTCLR_OST1_Pos                   (0U)
#define HRPWM_TZOSTCLR_OST1_Msk                   (0x1UL<<HRPWM_TZOSTCLR_OST1_Pos)                  /*!< 0x00000001 */
#define HRPWM_TZOSTCLR_OST1                       HRPWM_TZOSTCLR_OST1_Msk                           
#define HRPWM_TZOSTCLR_OST2_Pos                   (1U)
#define HRPWM_TZOSTCLR_OST2_Msk                   (0x1UL<<HRPWM_TZOSTCLR_OST2_Pos)                  /*!< 0x00000002 */
#define HRPWM_TZOSTCLR_OST2                       HRPWM_TZOSTCLR_OST2_Msk                           
#define HRPWM_TZOSTCLR_OST3_Pos                   (2U)
#define HRPWM_TZOSTCLR_OST3_Msk                   (0x1UL<<HRPWM_TZOSTCLR_OST3_Pos)                  /*!< 0x00000004 */
#define HRPWM_TZOSTCLR_OST3                       HRPWM_TZOSTCLR_OST3_Msk                           
#define HRPWM_TZOSTCLR_OST4_Pos                   (3U)
#define HRPWM_TZOSTCLR_OST4_Msk                   (0x1UL<<HRPWM_TZOSTCLR_OST4_Pos)                  /*!< 0x00000008 */
#define HRPWM_TZOSTCLR_OST4                       HRPWM_TZOSTCLR_OST4_Msk                           
#define HRPWM_TZOSTCLR_OST5_Pos                   (4U)
#define HRPWM_TZOSTCLR_OST5_Msk                   (0x1UL<<HRPWM_TZOSTCLR_OST5_Pos)                  /*!< 0x00000010 */
#define HRPWM_TZOSTCLR_OST5                       HRPWM_TZOSTCLR_OST5_Msk                           
#define HRPWM_TZOSTCLR_OST6_Pos                   (5U)
#define HRPWM_TZOSTCLR_OST6_Msk                   (0x1UL<<HRPWM_TZOSTCLR_OST6_Pos)                  /*!< 0x00000020 */
#define HRPWM_TZOSTCLR_OST6                       HRPWM_TZOSTCLR_OST6_Msk                           
#define HRPWM_TZOSTCLR_DCAEVT1_Pos                (6U)
#define HRPWM_TZOSTCLR_DCAEVT1_Msk                (0x1UL<<HRPWM_TZOSTCLR_DCAEVT1_Pos)               /*!< 0x00000040 */
#define HRPWM_TZOSTCLR_DCAEVT1                    HRPWM_TZOSTCLR_DCAEVT1_Msk                        
#define HRPWM_TZOSTCLR_DCBEVT1_Pos                (7U)
#define HRPWM_TZOSTCLR_DCBEVT1_Msk                (0x1UL<<HRPWM_TZOSTCLR_DCBEVT1_Pos)               /*!< 0x00000080 */
#define HRPWM_TZOSTCLR_DCBEVT1                    HRPWM_TZOSTCLR_DCBEVT1_Msk                        

