breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for HRPWM_TZFRC register ******************************************/
#define HRPWM_TZFRC_CBC_Pos                       (1U)
#define HRPWM_TZFRC_CBC_Msk                       (0x1UL<<HRPWM_TZFRC_CBC_Pos)                      /*!< 0x00000002 */
#define HRPWM_TZFRC_CBC                           HRPWM_TZFRC_CBC_Msk                               
#define HRPWM_TZFRC_OST_Pos                       (2U)
#define HRPWM_TZFRC_OST_Msk                       (0x1UL<<HRPWM_TZFRC_OST_Pos)                      /*!< 0x00000004 */
#define HRPWM_TZFRC_OST                           HRPWM_TZFRC_OST_Msk                               
#define HRPWM_TZFRC_DCAEVT1_Pos                   (3U)
#define HRPWM_TZFRC_DCAEVT1_Msk                   (0x1UL<<HRPWM_TZFRC_DCAEVT1_Pos)                  /*!< 0x00000008 */
#define HRPWM_TZFRC_DCAEVT1                       HRPWM_TZFRC_DCAEVT1_Msk                           
#define HRPWM_TZFRC_DCAEVT2_Pos                   (4U)
#define HRPWM_TZFRC_DCAEVT2_Msk                   (0x1UL<<HRPWM_TZFRC_DCAEVT2_Pos)                  /*!< 0x00000010 */
#define HRPWM_TZFRC_DCAEVT2                       HRPWM_TZFRC_DCAEVT2_Msk                           
#define HRPWM_TZFRC_DCBEVT1_Pos                   (5U)
#define HRPWM_TZFRC_DCBEVT1_Msk                   (0x1UL<<HRPWM_TZFRC_DCBEVT1_Pos)                  /*!< 0x00000020 */
#define HRPWM_TZFRC_DCBEVT1                       HRPWM_TZFRC_DCBEVT1_Msk                           
#define HRPWM_TZFRC_DCBEVT2_Pos                   (6U)
#define HRPWM_TZFRC_DCBEVT2_Msk                   (0x1UL<<HRPWM_TZFRC_DCBEVT2_Pos)                  /*!< 0x00000040 */
#define HRPWM_TZFRC_DCBEVT2                       HRPWM_TZFRC_DCBEVT2_Msk                           

/********************************* Bit definition for HRPWM_ETSEL register ******************************************/
#define HRPWM_ETSEL_INTSEL_Pos                    (0U)
#define HRPWM_ETSEL_INTSEL_Msk                    (0x7UL<<HRPWM_ETSEL_INTSEL_Pos)                   /*!< 0x00000007 */
#define HRPWM_ETSEL_INTSEL                        HRPWM_ETSEL_INTSEL_Msk
#define HRPWM_ETSEL_INTSEL_0                      (0x1UL<<HRPWM_ETSEL_INTSEL_Pos)                   /*!< 0x00000001 */
#define HRPWM_ETSEL_INTSEL_1                      (0x2UL<<HRPWM_ETSEL_INTSEL_Pos)                   /*!< 0x00000002 */
#define HRPWM_ETSEL_INTSEL_2                      (0x4UL<<HRPWM_ETSEL_INTSEL_Pos)                   /*!< 0x00000004 */
#define HRPWM_ETSEL_INTEN_Pos                     (3U)
#define HRPWM_ETSEL_INTEN_Msk                     (0x1UL<<HRPWM_ETSEL_INTEN_Pos)                    /*!< 0x00000008 */
#define HRPWM_ETSEL_INTEN                         HRPWM_ETSEL_INTEN_Msk                             
#define HRPWM_ETSEL_SOCASELCMP_Pos                (4U)
#define HRPWM_ETSEL_SOCASELCMP_Msk                (0x1UL<<HRPWM_ETSEL_SOCASELCMP_Pos)               /*!< 0x00000010 */
#define HRPWM_ETSEL_SOCASELCMP                    HRPWM_ETSEL_SOCASELCMP_Msk                        
#define HRPWM_ETSEL_SOCBSELCMP_Pos                (5U)
#define HRPWM_ETSEL_SOCBSELCMP_Msk                (0x1UL<<HRPWM_ETSEL_SOCBSELCMP_Pos)               /*!< 0x00000020 */
#define HRPWM_ETSEL_SOCBSELCMP                    HRPWM_ETSEL_SOCBSELCMP_Msk                        
#define HRPWM_ETSEL_INTSELCMP_Pos                 (6U)
#define HRPWM_ETSEL_INTSELCMP_Msk                 (0x1UL<<HRPWM_ETSEL_INTSELCMP_Pos)                /*!< 0x00000040 */
#define HRPWM_ETSEL_INTSELCMP                     HRPWM_ETSEL_INTSELCMP_Msk                         
#define HRPWM_ETSEL_SOCASEL_Pos                   (8U)
#define HRPWM_ETSEL_SOCASEL_Msk                   (0x7UL<<HRPWM_ETSEL_SOCASEL_Pos)                  /*!< 0x00000700 */
#define HRPWM_ETSEL_SOCASEL                       HRPWM_ETSEL_SOCASEL_Msk
#define HRPWM_ETSEL_SOCASEL_0                     (0x1UL<<HRPWM_ETSEL_SOCASEL_Pos)                  /*!< 0x00000100 */
#define HRPWM_ETSEL_SOCASEL_1                     (0x2UL<<HRPWM_ETSEL_SOCASEL_Pos)                  /*!< 0x00000200 */
#define HRPWM_ETSEL_SOCASEL_2                     (0x4UL<<HRPWM_ETSEL_SOCASEL_Pos)                  /*!< 0x00000400 */
#define HRPWM_ETSEL_SOCAEN_Pos                    (11U)
#define HRPWM_ETSEL_SOCAEN_Msk                    (0x1UL<<HRPWM_ETSEL_SOCAEN_Pos)                   /*!< 0x00000800 */
#define HRPWM_ETSEL_SOCAEN                        HRPWM_ETSEL_SOCAEN_Msk                            
#define HRPWM_ETSEL_SOCBSEL_Pos                   (12U)
#define HRPWM_ETSEL_SOCBSEL_Msk                   (0x7UL<<HRPWM_ETSEL_SOCBSEL_Pos)                  /*!< 0x00007000 */
#define HRPWM_ETSEL_SOCBSEL                       HRPWM_ETSEL_SOCBSEL_Msk
#define HRPWM_ETSEL_SOCBSEL_0                     (0x1UL<<HRPWM_ETSEL_SOCBSEL_Pos)                  /*!< 0x00001000 */
#define HRPWM_ETSEL_SOCBSEL_1                     (0x2UL<<HRPWM_ETSEL_SOCBSEL_Pos)                  /*!< 0x00002000 */
#define HRPWM_ETSEL_SOCBSEL_2                     (0x4UL<<HRPWM_ETSEL_SOCBSEL_Pos)                  /*!< 0x00004000 */
#define HRPWM_ETSEL_SOCBEN_Pos                    (15U)
#define HRPWM_ETSEL_SOCBEN_Msk                    (0x1UL<<HRPWM_ETSEL_SOCBEN_Pos)                   /*!< 0x00008000 */
#define HRPWM_ETSEL_SOCBEN                        HRPWM_ETSEL_SOCBEN_Msk                            

/********************************* Bit definition for HRPWM_ETPS register *******************************************/
#define HRPWM_ETPS_INTPRD_Pos                     (0U)
#define HRPWM_ETPS_INTPRD_Msk                     (0x3UL<<HRPWM_ETPS_INTPRD_Pos)                    /*!< 0x00000003 */
#define HRPWM_ETPS_INTPRD                         HRPWM_ETPS_INTPRD_Msk
#define HRPWM_ETPS_INTPRD_0                       (0x1UL<<HRPWM_ETPS_INTPRD_Pos)                    /*!< 0x00000001 */
#define HRPWM_ETPS_INTPRD_1                       (0x2UL<<HRPWM_ETPS_INTPRD_Pos)                    /*!< 0x00000002 */
#define HRPWM_ETPS_INTCNT_Pos                     (2U)
#define HRPWM_ETPS_INTCNT_Msk                     (0x3UL<<HRPWM_ETPS_INTCNT_Pos)                    /*!< 0x0000000C */
#define HRPWM_ETPS_INTCNT                         HRPWM_ETPS_INTCNT_Msk
#define HRPWM_ETPS_INTCNT_0                       (0x1UL<<HRPWM_ETPS_INTCNT_Pos)                    /*!< 0x00000004 */
#define HRPWM_ETPS_INTCNT_1                       (0x2UL<<HRPWM_ETPS_INTCNT_Pos)                    /*!< 0x00000008 */
#define HRPWM_ETPS_INTPSSEL_Pos                   (4U)
#define HRPWM_ETPS_INTPSSEL_Msk                   (0x1UL<<HRPWM_ETPS_INTPSSEL_Pos)                  /*!< 0x00000010 */
#define HRPWM_ETPS_INTPSSEL                       HRPWM_ETPS_INTPSSEL_Msk                           
#define HRPWM_ETPS_SOCPSSEL_Pos                   (5U)
#define HRPWM_ETPS_SOCPSSEL_Msk                   (0x1UL<<HRPWM_ETPS_SOCPSSEL_Pos)                  /*!< 0x00000020 */
#define HRPWM_ETPS_SOCPSSEL                       HRPWM_ETPS_SOCPSSEL_Msk                           
#define HRPWM_ETPS_SOCAPRD_Pos                    (8U)
#define HRPWM_ETPS_SOCAPRD_Msk                    (0x3UL<<HRPWM_ETPS_SOCAPRD_Pos)                   /*!< 0x00000300 */
#define HRPWM_ETPS_SOCAPRD                        HRPWM_ETPS_SOCAPRD_Msk
#define HRPWM_ETPS_SOCAPRD_0                      (0x1UL<<HRPWM_ETPS_SOCAPRD_Pos)                   /*!< 0x00000100 */
#define HRPWM_ETPS_SOCAPRD_1                      (0x2UL<<HRPWM_ETPS_SOCAPRD_Pos)                   /*!< 0x00000200 */
#define HRPWM_ETPS_SOCACNT_Pos                    (10U)
#define HRPWM_ETPS_SOCACNT_Msk                    (0x3UL<<HRPWM_ETPS_SOCACNT_Pos)                   /*!< 0x00000C00 */
#define HRPWM_ETPS_SOCACNT                        HRPWM_ETPS_SOCACNT_Msk
#define HRPWM_ETPS_SOCACNT_0                      (0x1UL<<HRPWM_ETPS_SOCACNT_Pos)                   /*!< 0x00000400 */
#define HRPWM_ETPS_SOCACNT_1                      (0x2UL<<HRPWM_ETPS_SOCACNT_Pos)                   /*!< 0x00000800 */
#define HRPWM_ETPS_SOCBPRD_Pos                    (12U)
#define HRPWM_ETPS_SOCBPRD_Msk                    (0x3UL<<HRPWM_ETPS_SOCBPRD_Pos)                   /*!< 0x00003000 */
#define HRPWM_ETPS_SOCBPRD                        HRPWM_ETPS_SOCBPRD_Msk
#define HRPWM_ETPS_SOCBPRD_0                      (0x1UL<<HRPWM_ETPS_SOCBPRD_Pos)                   /*!< 0x00001000 */
#define HRPWM_ETPS_SOCBPRD_1                      (0x2UL<<HRPWM_ETPS_SOCBPRD_Pos)                   /*!< 0x00002000 */
#define HRPWM_ETPS_SOCBCNT_Pos                    (14U)
#define HRPWM_ETPS_SOCBCNT_Msk                    (0x3UL<<HRPWM_ETPS_SOCBCNT_Pos)                   /*!< 0x0000C000 */
#define HRPWM_ETPS_SOCBCNT                        HRPWM_ETPS_SOCBCNT_Msk
#define HRPWM_ETPS_SOCBCNT_0                      (0x1UL<<HRPWM_ETPS_SOCBCNT_Pos)                   /*!< 0x00004000 */
#define HRPWM_ETPS_SOCBCNT_1                      (0x2UL<<HRPWM_ETPS_SOCBCNT_Pos)                   /*!< 0x00008000 */

/********************************* Bit definition for HRPWM_ETFLG register ******************************************/
#define HRPWM_ETFLG_INT_Pos                       (0U)
#define HRPWM_ETFLG_INT_Msk                       (0x1UL<<HRPWM_ETFLG_INT_Pos)                      /*!< 0x00000001 */
#define HRPWM_ETFLG_INT                           HRPWM_ETFLG_INT_Msk                               
#define HRPWM_ETFLG_SOCA_Pos                      (2U)
#define HRPWM_ETFLG_SOCA_Msk                      (0x1UL<<HRPWM_ETFLG_SOCA_Pos)                     /*!< 0x00000004 */
#define HRPWM_ETFLG_SOCA                          HRPWM_ETFLG_SOCA_Msk                              
#define HRPWM_ETFLG_SOCB_Pos                      (3U)
#define HRPWM_ETFLG_SOCB_Msk                      (0x1UL<<HRPWM_ETFLG_SOCB_Pos)                     /*!< 0x00000008 */
#define HRPWM_ETFLG_SOCB                          HRPWM_ETFLG_SOCB_Msk                              

/********************************* Bit definition for HRPWM_ETCLR register ******************************************/
#define HRPWM_ETCLR_INT_Pos                       (0U)
#define HRPWM_ETCLR_INT_Msk                       (0x1UL<<HRPWM_ETCLR_INT_Pos)                      /*!< 0x00000001 */
#define HRPWM_ETCLR_INT                           HRPWM_ETCLR_INT_Msk                               
#define HRPWM_ETCLR_SOCA_Pos                      (2U)
#define HRPWM_ETCLR_SOCA_Msk                      (0x1UL<<HRPWM_ETCLR_SOCA_Pos)                     /*!< 0x00000004 */
#define HRPWM_ETCLR_SOCA                          HRPWM_ETCLR_SOCA_Msk                              
#define HRPWM_ETCLR_SOCB_Pos                      (3U)
#define HRPWM_ETCLR_SOCB_Msk                      (0x1UL<<HRPWM_ETCLR_SOCB_Pos)                     /*!< 0x00000008 */
#define HRPWM_ETCLR_SOCB                          HRPWM_ETCLR_SOCB_Msk                              

/********************************* Bit definition for HRPWM_ETFRC register ******************************************/
#define HRPWM_ETFRC_INT_Pos                       (0U)
#define HRPWM_ETFRC_INT_Msk                       (0x1UL<<HRPWM_ETFRC_INT_Pos)                      /*!< 0x00000001 */
#define HRPWM_ETFRC_INT                           HRPWM_ETFRC_INT_Msk                               
#define HRPWM_ETFRC_SOCA_Pos                      (2U)
#define HRPWM_ETFRC_SOCA_Msk                      (0x1UL<<HRPWM_ETFRC_SOCA_Pos)                     /*!< 0x00000004 */
#define HRPWM_ETFRC_SOCA                          HRPWM_ETFRC_SOCA_Msk                              
#define HRPWM_ETFRC_SOCB_Pos                      (3U)
#define HRPWM_ETFRC_SOCB_Msk                      (0x1UL<<HRPWM_ETFRC_SOCB_Pos)                     /*!< 0x00000008 */
#define HRPWM_ETFRC_SOCB                          HRPWM_ETFRC_SOCB_Msk                              

/********************************* Bit definition for HRPWM_ETINTPS register ****************************************/
#define HRPWM_ETINTPS_INTPRD2_Pos                 (0U)
#define HRPWM_ETINTPS_INTPRD2_Msk                 (0xFUL<<HRPWM_ETINTPS_INTPRD2_Pos)                /*!< 0x0000000F */
#define HRPWM_ETINTPS_INTPRD2                     HRPWM_ETINTPS_INTPRD2_Msk
#define HRPWM_ETINTPS_INTPRD2_0                   (0x1UL<<HRPWM_ETINTPS_INTPRD2_Pos)                /*!< 0x00000001 */
#define HRPWM_ETINTPS_INTPRD2_1                   (0x2UL<<HRPWM_ETINTPS_INTPRD2_Pos)                /*!< 0x00000002 */
#define HRPWM_ETINTPS_INTPRD2_2                   (0x4UL<<HRPWM_ETINTPS_INTPRD2_Pos)                /*!< 0x00000004 */
#define HRPWM_ETINTPS_INTPRD2_3                   (0x8UL<<HRPWM_ETINTPS_INTPRD2_Pos)                /*!< 0x00000008 */
#define HRPWM_ETINTPS_INTCNT2_Pos                 (4U)
#define HRPWM_ETINTPS_INTCNT2_Msk                 (0xFUL<<HRPWM_ETINTPS_INTCNT2_Pos)                /*!< 0x000000F0 */
#define HRPWM_ETINTPS_INTCNT2                     HRPWM_ETINTPS_INTCNT2_Msk
#define HRPWM_ETINTPS_INTCNT2_0                   (0x1UL<<HRPWM_ETINTPS_INTCNT2_Pos)                /*!< 0x00000010 */
#define HRPWM_ETINTPS_INTCNT2_1                   (0x2UL<<HRPWM_ETINTPS_INTCNT2_Pos)                /*!< 0x00000020 */
#define HRPWM_ETINTPS_INTCNT2_2                   (0x4UL<<HRPWM_ETINTPS_INTCNT2_Pos)                /*!< 0x00000040 */
#define HRPWM_ETINTPS_INTCNT2_3                   (0x8UL<<HRPWM_ETINTPS_INTCNT2_Pos)                /*!< 0x00000080 */

/********************************* Bit definition for HRPWM_ETSOCPS register ****************************************/
#define HRPWM_ETSOCPS_SOCAPRD2_Pos                (0U)
#define HRPWM_ETSOCPS_SOCAPRD2_Msk                (0xFUL<<HRPWM_ETSOCPS_SOCAPRD2_Pos)               /*!< 0x0000000F */
#define HRPWM_ETSOCPS_SOCAPRD2                    HRPWM_ETSOCPS_SOCAPRD2_Msk
#define HRPWM_ETSOCPS_SOCAPRD2_0                  (0x1UL<<HRPWM_ETSOCPS_SOCAPRD2_Pos)               /*!< 0x00000001 */
#define HRPWM_ETSOCPS_SOCAPRD2_1                  (0x2UL<<HRPWM_ETSOCPS_SOCAPRD2_Pos)               /*!< 0x00000002 */
#define HRPWM_ETSOCPS_SOCAPRD2_2                  (0x4UL<<HRPWM_ETSOCPS_SOCAPRD2_Pos)               /*!< 0x00000004 */
#define HRPWM_ETSOCPS_SOCAPRD2_3                  (0x8UL<<HRPWM_ETSOCPS_SOCAPRD2_Pos)               /*!< 0x00000008 */
#define HRPWM_ETSOCPS_SOCACNT2_Pos                (4U)
#define HRPWM_ETSOCPS_SOCACNT2_Msk                (0xFUL<<HRPWM_ETSOCPS_SOCACNT2_Pos)               /*!< 0x000000F0 */
#define HRPWM_ETSOCPS_SOCACNT2                    HRPWM_ETSOCPS_SOCACNT2_Msk
#define HRPWM_ETSOCPS_SOCACNT2_0                  (0x1UL<<HRPWM_ETSOCPS_SOCACNT2_Pos)               /*!< 0x00000010 */
#define HRPWM_ETSOCPS_SOCACNT2_1                  (0x2UL<<HRPWM_ETSOCPS_SOCACNT2_Pos)               /*!< 0x00000020 */
#define HRPWM_ETSOCPS_SOCACNT2_2                  (0x4UL<<HRPWM_ETSOCPS_SOCACNT2_Pos)               /*!< 0x00000040 */
#define HRPWM_ETSOCPS_SOCACNT2_3                  (0x8UL<<HRPWM_ETSOCPS_SOCACNT2_Pos)               /*!< 0x00000080 */
#define HRPWM_ETSOCPS_SOCBPRD2_Pos                (8U)
#define HRPWM_ETSOCPS_SOCBPRD2_Msk                (0xFUL<<HRPWM_ETSOCPS_SOCBPRD2_Pos)               /*!< 0x00000F00 */
#define HRPWM_ETSOCPS_SOCBPRD2                    HRPWM_ETSOCPS_SOCBPRD2_Msk
#define HRPWM_ETSOCPS_SOCBPRD2_0                  (0x1UL<<HRPWM_ETSOCPS_SOCBPRD2_Pos)               /*!< 0x00000100 */
#define HRPWM_ETSOCPS_SOCBPRD2_1                  (0x2UL<<HRPWM_ETSOCPS_SOCBPRD2_Pos)               /*!< 0x00000200 */
#define HRPWM_ETSOCPS_SOCBPRD2_2                  (0x4UL<<HRPWM_ETSOCPS_SOCBPRD2_Pos)               /*!< 0x00000400 */
#define HRPWM_ETSOCPS_SOCBPRD2_3                  (0x8UL<<HRPWM_ETSOCPS_SOCBPRD2_Pos)               /*!< 0x00000800 */
#define HRPWM_ETSOCPS_SOCBCNT2_Pos                (12U)
#define HRPWM_ETSOCPS_SOCBCNT2_Msk                (0xFUL<<HRPWM_ETSOCPS_SOCBCNT2_Pos)               /*!< 0x0000F000 */
#define HRPWM_ETSOCPS_SOCBCNT2                    HRPWM_ETSOCPS_SOCBCNT2_Msk
#define HRPWM_ETSOCPS_SOCBCNT2_0                  (0x1UL<<HRPWM_ETSOCPS_SOCBCNT2_Pos)               /*!< 0x00001000 */
#define HRPWM_ETSOCPS_SOCBCNT2_1                  (0x2UL<<HRPWM_ETSOCPS_SOCBCNT2_Pos)               /*!< 0x00002000 */
#define HRPWM_ETSOCPS_SOCBCNT2_2                  (0x4UL<<HRPWM_ETSOCPS_SOCBCNT2_Pos)               /*!< 0x00004000 */
#define HRPWM_ETSOCPS_SOCBCNT2_3                  (0x8UL<<HRPWM_ETSOCPS_SOCBCNT2_Pos)               /*!< 0x00008000 */

/********************************* Bit definition for HRPWM_ETCNTINITCTL register ***********************************/
#define HRPWM_ETCNTINITCTL_INTINITFRC_Pos         (10U)
#define HRPWM_ETCNTINITCTL_INTINITFRC_Msk         (0x1UL<<HRPWM_ETCNTINITCTL_INTINITFRC_Pos)        /*!< 0x00000400 */
#define HRPWM_ETCNTINITCTL_INTINITFRC             HRPWM_ETCNTINITCTL_INTINITFRC_Msk                 
#define HRPWM_ETCNTINITCTL_SOCAINITFRC_Pos        (11U)
#define HRPWM_ETCNTINITCTL_SOCAINITFRC_Msk        (0x1UL<<HRPWM_ETCNTINITCTL_SOCAINITFRC_Pos)       /*!< 0x00000800 */
#define HRPWM_ETCNTINITCTL_SOCAINITFRC            HRPWM_ETCNTINITCTL_SOCAINITFRC_Msk                
#define HRPWM_ETCNTINITCTL_SOCBINITFRC_Pos        (12U)
#define HRPWM_ETCNTINITCTL_SOCBINITFRC_Msk        (0x1UL<<HRPWM_ETCNTINITCTL_SOCBINITFRC_Pos)       /*!< 0x00001000 */
#define HRPWM_ETCNTINITCTL_SOCBINITFRC            HRPWM_ETCNTINITCTL_SOCBINITFRC_Msk                
#define HRPWM_ETCNTINITCTL_INTINTEN_Pos           (13U)
#define HRPWM_ETCNTINITCTL_INTINTEN_Msk           (0x1UL<<HRPWM_ETCNTINITCTL_INTINTEN_Pos)          /*!< 0x00002000 */
#define HRPWM_ETCNTINITCTL_INTINTEN               HRPWM_ETCNTINITCTL_INTINTEN_Msk                   
#define HRPWM_ETCNTINITCTL_SOCAINTEN_Pos          (14U)
#define HRPWM_ETCNTINITCTL_SOCAINTEN_Msk          (0x1UL<<HRPWM_ETCNTINITCTL_SOCAINTEN_Pos)         /*!< 0x00004000 */
#define HRPWM_ETCNTINITCTL_SOCAINTEN              HRPWM_ETCNTINITCTL_SOCAINTEN_Msk                  
#define HRPWM_ETCNTINITCTL_SOCBINTEN_Pos          (15U)
#define HRPWM_ETCNTINITCTL_SOCBINTEN_Msk          (0x1UL<<HRPWM_ETCNTINITCTL_SOCBINTEN_Pos)         /*!< 0x00008000 */
#define HRPWM_ETCNTINITCTL_SOCBINTEN              HRPWM_ETCNTINITCTL_SOCBINTEN_Msk                  

/********************************* Bit definition for HRPWM_ETCNTINIT register **************************************/
#define HRPWM_ETCNTINIT_INTINT_Pos                (0U)
#define HRPWM_ETCNTINIT_INTINT_Msk                (0xFUL<<HRPWM_ETCNTINIT_INTINT_Pos)               /*!< 0x0000000F */
#define HRPWM_ETCNTINIT_INTINT                    HRPWM_ETCNTINIT_INTINT_Msk
#define HRPWM_ETCNTINIT_INTINT_0                  (0x1UL<<HRPWM_ETCNTINIT_INTINT_Pos)               /*!< 0x00000001 */
#define HRPWM_ETCNTINIT_INTINT_1                  (0x2UL<<HRPWM_ETCNTINIT_INTINT_Pos)               /*!< 0x00000002 */
#define HRPWM_ETCNTINIT_INTINT_2                  (0x4UL<<HRPWM_ETCNTINIT_INTINT_Pos)               /*!< 0x00000004 */
#define HRPWM_ETCNTINIT_INTINT_3                  (0x8UL<<HRPWM_ETCNTINIT_INTINT_Pos)               /*!< 0x00000008 */
#define HRPWM_ETCNTINIT_SOCAINT_Pos               (4U)
#define HRPWM_ETCNTINIT_SOCAINT_Msk               (0xFUL<<HRPWM_ETCNTINIT_SOCAINT_Pos)              /*!< 0x000000F0 */
#define HRPWM_ETCNTINIT_SOCAINT                   HRPWM_ETCNTINIT_SOCAINT_Msk
#define HRPWM_ETCNTINIT_SOCAINT_0                 (0x1UL<<HRPWM_ETCNTINIT_SOCAINT_Pos)              /*!< 0x00000010 */
#define HRPWM_ETCNTINIT_SOCAINT_1                 (0x2UL<<HRPWM_ETCNTINIT_SOCAINT_Pos)              /*!< 0x00000020 */
#define HRPWM_ETCNTINIT_SOCAINT_2                 (0x4UL<<HRPWM_ETCNTINIT_SOCAINT_Pos)              /*!< 0x00000040 */
#define HRPWM_ETCNTINIT_SOCAINT_3                 (0x8UL<<HRPWM_ETCNTINIT_SOCAINT_Pos)              /*!< 0x00000080 */
#define HRPWM_ETCNTINIT_SOCBINT_Pos               (8U)
#define HRPWM_ETCNTINIT_SOCBINT_Msk               (0xFUL<<HRPWM_ETCNTINIT_SOCBINT_Pos)              /*!< 0x00000F00 */
#define HRPWM_ETCNTINIT_SOCBINT                   HRPWM_ETCNTINIT_SOCBINT_Msk
#define HRPWM_ETCNTINIT_SOCBINT_0                 (0x1UL<<HRPWM_ETCNTINIT_SOCBINT_Pos)              /*!< 0x00000100 */
#define HRPWM_ETCNTINIT_SOCBINT_1                 (0x2UL<<HRPWM_ETCNTINIT_SOCBINT_Pos)              /*!< 0x00000200 */
#define HRPWM_ETCNTINIT_SOCBINT_2                 (0x4UL<<HRPWM_ETCNTINIT_SOCBINT_Pos)              /*!< 0x00000400 */
#define HRPWM_ETCNTINIT_SOCBINT_3                 (0x8UL<<HRPWM_ETCNTINIT_SOCBINT_Pos)              /*!< 0x00000800 */

/********************************* Bit definition for HRPWM_DCTRIPSEL register **************************************/
#define HRPWM_DCTRIPSEL_DCAHCOMPSEL_Pos           (0U)
#define HRPWM_DCTRIPSEL_DCAHCOMPSEL_Msk           (0xFUL<<HRPWM_DCTRIPSEL_DCAHCOMPSEL_Pos)          /*!< 0x0000000F */
#define HRPWM_DCTRIPSEL_DCAHCOMPSEL               HRPWM_DCTRIPSEL_DCAHCOMPSEL_Msk
#define HRPWM_DCTRIPSEL_DCAHCOMPSEL_0             (0x1UL<<HRPWM_DCTRIPSEL_DCAHCOMPSEL_Pos)          /*!< 0x00000001 */
#define HRPWM_DCTRIPSEL_DCAHCOMPSEL_1             (0x2UL<<HRPWM_DCTRIPSEL_DCAHCOMPSEL_Pos)          /*!< 0x00000002 */
#define HRPWM_DCTRIPSEL_DCAHCOMPSEL_2             (0x4UL<<HRPWM_DCTRIPSEL_DCAHCOMPSEL_Pos)          /*!< 0x00000004 */
#define HRPWM_DCTRIPSEL_DCAHCOMPSEL_3             (0x8UL<<HRPWM_DCTRIPSEL_DCAHCOMPSEL_Pos)          /*!< 0x00000008 */
#define HRPWM_DCTRIPSEL_DCALCOMPSEL_Pos           (4U)
#define HRPWM_DCTRIPSEL_DCALCOMPSEL_Msk           (0xFUL<<HRPWM_DCTRIPSEL_DCALCOMPSEL_Pos)          /*!< 0x000000F0 */
#define HRPWM_DCTRIPSEL_DCALCOMPSEL               HRPWM_DCTRIPSEL_DCALCOMPSEL_Msk
#define HRPWM_DCTRIPSEL_DCALCOMPSEL_0             (0x1UL<<HRPWM_DCTRIPSEL_DCALCOMPSEL_Pos)          /*!< 0x00000010 */
#define HRPWM_DCTRIPSEL_DCALCOMPSEL_1             (0x2UL<<HRPWM_DCTRIPSEL_DCALCOMPSEL_Pos)          /*!< 0x00000020 */
#define HRPWM_DCTRIPSEL_DCALCOMPSEL_2             (0x4UL<<HRPWM_DCTRIPSEL_DCALCOMPSEL_Pos)          /*!< 0x00000040 */
#define HRPWM_DCTRIPSEL_DCALCOMPSEL_3             (0x8UL<<HRPWM_DCTRIPSEL_DCALCOMPSEL_Pos)          /*!< 0x00000080 */
#define HRPWM_DCTRIPSEL_DCBHCOMPSEL_Pos           (8U)
#define HRPWM_DCTRIPSEL_DCBHCOMPSEL_Msk           (0xFUL<<HRPWM_DCTRIPSEL_DCBHCOMPSEL_Pos)          /*!< 0x00000F00 */
#define HRPWM_DCTRIPSEL_DCBHCOMPSEL               HRPWM_DCTRIPSEL_DCBHCOMPSEL_Msk
#define HRPWM_DCTRIPSEL_DCBHCOMPSEL_0             (0x1UL<<HRPWM_DCTRIPSEL_DCBHCOMPSEL_Pos)          /*!< 0x00000100 */
#define HRPWM_DCTRIPSEL_DCBHCOMPSEL_1             (0x2UL<<HRPWM_DCTRIPSEL_DCBHCOMPSEL_Pos)          /*!< 0x00000200 */
#define HRPWM_DCTRIPSEL_DCBHCOMPSEL_2             (0x4UL<<HRPWM_DCTRIPSEL_DCBHCOMPSEL_Pos)          /*!< 0x00000400 */
#define HRPWM_DCTRIPSEL_DCBHCOMPSEL_3             (0x8UL<<HRPWM_DCTRIPSEL_DCBHCOMPSEL_Pos)          /*!< 0x00000800 */
#define HRPWM_DCTRIPSEL_DCBLCOMPSEL_Pos           (12U)
#define HRPWM_DCTRIPSEL_DCBLCOMPSEL_Msk           (0xFUL<<HRPWM_DCTRIPSEL_DCBLCOMPSEL_Pos)          /*!< 0x0000F000 */
#define HRPWM_DCTRIPSEL_DCBLCOMPSEL               HRPWM_DCTRIPSEL_DCBLCOMPSEL_Msk
#define HRPWM_DCTRIPSEL_DCBLCOMPSEL_0             (0x1UL<<HRPWM_DCTRIPSEL_DCBLCOMPSEL_Pos)          /*!< 0x00001000 */
#define HRPWM_DCTRIPSEL_DCBLCOMPSEL_1             (0x2UL<<HRPWM_DCTRIPSEL_DCBLCOMPSEL_Pos)          /*!< 0x00002000 */
#define HRPWM_DCTRIPSEL_DCBLCOMPSEL_2             (0x4UL<<HRPWM_DCTRIPSEL_DCBLCOMPSEL_Pos)          /*!< 0x00004000 */
#define HRPWM_DCTRIPSEL_DCBLCOMPSEL_3             (0x8UL<<HRPWM_DCTRIPSEL_DCBLCOMPSEL_Pos)          /*!< 0x00008000 */

