breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for HRPWM_DCACTL register *****************************************/
#define HRPWM_DCACTL_EVT1SRCSEL_Pos               (0U)
#define HRPWM_DCACTL_EVT1SRCSEL_Msk               (0x1UL<<HRPWM_DCACTL_EVT1SRCSEL_Pos)              /*!< 0x00000001 */
#define HRPWM_DCACTL_EVT1SRCSEL                   HRPWM_DCACTL_EVT1SRCSEL_Msk                       
#define HRPWM_DCACTL_EVT1FRCSYNCSEL_Pos           (1U)
#define HRPWM_DCACTL_EVT1FRCSYNCSEL_Msk           (0x1UL<<HRPWM_DCACTL_EVT1FRCSYNCSEL_Pos)          /*!< 0x00000002 */
#define HRPWM_DCACTL_EVT1FRCSYNCSEL               HRPWM_DCACTL_EVT1FRCSYNCSEL_Msk                   
#define HRPWM_DCACTL_EVT1SOCE_Pos                 (2U)
#define HRPWM_DCACTL_EVT1SOCE_Msk                 (0x1UL<<HRPWM_DCACTL_EVT1SOCE_Pos)                /*!< 0x00000004 */
#define HRPWM_DCACTL_EVT1SOCE                     HRPWM_DCACTL_EVT1SOCE_Msk                         
#define HRPWM_DCACTL_EVT1SYNCE_Pos                (3U)
#define HRPWM_DCACTL_EVT1SYNCE_Msk                (0x1UL<<HRPWM_DCACTL_EVT1SYNCE_Pos)               /*!< 0x00000008 */
#define HRPWM_DCACTL_EVT1SYNCE                    HRPWM_DCACTL_EVT1SYNCE_Msk                        
#define HRPWM_DCACTL_EVT2SRCSEL_Pos               (8U)
#define HRPWM_DCACTL_EVT2SRCSEL_Msk               (0x1UL<<HRPWM_DCACTL_EVT2SRCSEL_Pos)              /*!< 0x00000100 */
#define HRPWM_DCACTL_EVT2SRCSEL                   HRPWM_DCACTL_EVT2SRCSEL_Msk                       
#define HRPWM_DCACTL_EVT2FRCSYNCSEL_Pos           (9U)
#define HRPWM_DCACTL_EVT2FRCSYNCSEL_Msk           (0x1UL<<HRPWM_DCACTL_EVT2FRCSYNCSEL_Pos)          /*!< 0x00000200 */
#define HRPWM_DCACTL_EVT2FRCSYNCSEL               HRPWM_DCACTL_EVT2FRCSYNCSEL_Msk                   

/********************************* Bit definition for HRPWM_DCBCTL register *****************************************/
#define HRPWM_DCBCTL_EVT1SRCSEL_Pos               (0U)
#define HRPWM_DCBCTL_EVT1SRCSEL_Msk               (0x1UL<<HRPWM_DCBCTL_EVT1SRCSEL_Pos)              /*!< 0x00000001 */
#define HRPWM_DCBCTL_EVT1SRCSEL                   HRPWM_DCBCTL_EVT1SRCSEL_Msk                       
#define HRPWM_DCBCTL_EVT1FRCSYNCSEL_Pos           (1U)
#define HRPWM_DCBCTL_EVT1FRCSYNCSEL_Msk           (0x1UL<<HRPWM_DCBCTL_EVT1FRCSYNCSEL_Pos)          /*!< 0x00000002 */
#define HRPWM_DCBCTL_EVT1FRCSYNCSEL               HRPWM_DCBCTL_EVT1FRCSYNCSEL_Msk                   
#define HRPWM_DCBCTL_EVT1SOCE_Pos                 (2U)
#define HRPWM_DCBCTL_EVT1SOCE_Msk                 (0x1UL<<HRPWM_DCBCTL_EVT1SOCE_Pos)                /*!< 0x00000004 */
#define HRPWM_DCBCTL_EVT1SOCE                     HRPWM_DCBCTL_EVT1SOCE_Msk                         
#define HRPWM_DCBCTL_EVT1SYNCE_Pos                (3U)
#define HRPWM_DCBCTL_EVT1SYNCE_Msk                (0x1UL<<HRPWM_DCBCTL_EVT1SYNCE_Pos)               /*!< 0x00000008 */
#define HRPWM_DCBCTL_EVT1SYNCE                    HRPWM_DCBCTL_EVT1SYNCE_Msk                        
#define HRPWM_DCBCTL_EVT2SRCSEL_Pos               (8U)
#define HRPWM_DCBCTL_EVT2SRCSEL_Msk               (0x1UL<<HRPWM_DCBCTL_EVT2SRCSEL_Pos)              /*!< 0x00000100 */
#define HRPWM_DCBCTL_EVT2SRCSEL                   HRPWM_DCBCTL_EVT2SRCSEL_Msk                       
#define HRPWM_DCBCTL_EVT2FRCSYNCSEL_Pos           (9U)
#define HRPWM_DCBCTL_EVT2FRCSYNCSEL_Msk           (0x1UL<<HRPWM_DCBCTL_EVT2FRCSYNCSEL_Pos)          /*!< 0x00000200 */
#define HRPWM_DCBCTL_EVT2FRCSYNCSEL               HRPWM_DCBCTL_EVT2FRCSYNCSEL_Msk                   

/********************************* Bit definition for HRPWM_DCFCTL register *****************************************/
#define HRPWM_DCFCTL_SRCSEL_Pos                   (0U)
#define HRPWM_DCFCTL_SRCSEL_Msk                   (0x3UL<<HRPWM_DCFCTL_SRCSEL_Pos)                  /*!< 0x00000003 */
#define HRPWM_DCFCTL_SRCSEL                       HRPWM_DCFCTL_SRCSEL_Msk
#define HRPWM_DCFCTL_SRCSEL_0                     (0x1UL<<HRPWM_DCFCTL_SRCSEL_Pos)                  /*!< 0x00000001 */
#define HRPWM_DCFCTL_SRCSEL_1                     (0x2UL<<HRPWM_DCFCTL_SRCSEL_Pos)                  /*!< 0x00000002 */
#define HRPWM_DCFCTL_BLANKE_Pos                   (2U)
#define HRPWM_DCFCTL_BLANKE_Msk                   (0x1UL<<HRPWM_DCFCTL_BLANKE_Pos)                  /*!< 0x00000004 */
#define HRPWM_DCFCTL_BLANKE                       HRPWM_DCFCTL_BLANKE_Msk                           
#define HRPWM_DCFCTL_BLANKINV_Pos                 (3U)
#define HRPWM_DCFCTL_BLANKINV_Msk                 (0x1UL<<HRPWM_DCFCTL_BLANKINV_Pos)                /*!< 0x00000008 */
#define HRPWM_DCFCTL_BLANKINV                     HRPWM_DCFCTL_BLANKINV_Msk                         
#define HRPWM_DCFCTL_PULSESEL_Pos                 (4U)
#define HRPWM_DCFCTL_PULSESEL_Msk                 (0x3UL<<HRPWM_DCFCTL_PULSESEL_Pos)                /*!< 0x00000030 */
#define HRPWM_DCFCTL_PULSESEL                     HRPWM_DCFCTL_PULSESEL_Msk
#define HRPWM_DCFCTL_PULSESEL_0                   (0x1UL<<HRPWM_DCFCTL_PULSESEL_Pos)                /*!< 0x00000010 */
#define HRPWM_DCFCTL_PULSESEL_1                   (0x2UL<<HRPWM_DCFCTL_PULSESEL_Pos)                /*!< 0x00000020 */
#define HRPWM_DCFCTL_EDGEFILTSEL_Pos              (6U)
#define HRPWM_DCFCTL_EDGEFILTSEL_Msk              (0x1UL<<HRPWM_DCFCTL_EDGEFILTSEL_Pos)             /*!< 0x00000040 */
#define HRPWM_DCFCTL_EDGEFILTSEL                  HRPWM_DCFCTL_EDGEFILTSEL_Msk                      
#define HRPWM_DCFCTL_EDGEMODE_Pos                 (8U)
#define HRPWM_DCFCTL_EDGEMODE_Msk                 (0x3UL<<HRPWM_DCFCTL_EDGEMODE_Pos)                /*!< 0x00000300 */
#define HRPWM_DCFCTL_EDGEMODE                     HRPWM_DCFCTL_EDGEMODE_Msk
#define HRPWM_DCFCTL_EDGEMODE_0                   (0x1UL<<HRPWM_DCFCTL_EDGEMODE_Pos)                /*!< 0x00000100 */
#define HRPWM_DCFCTL_EDGEMODE_1                   (0x2UL<<HRPWM_DCFCTL_EDGEMODE_Pos)                /*!< 0x00000200 */
#define HRPWM_DCFCTL_EDGECOUNT_Pos                (10U)
#define HRPWM_DCFCTL_EDGECOUNT_Msk                (0x7UL<<HRPWM_DCFCTL_EDGECOUNT_Pos)               /*!< 0x00001C00 */
#define HRPWM_DCFCTL_EDGECOUNT                    HRPWM_DCFCTL_EDGECOUNT_Msk
#define HRPWM_DCFCTL_EDGECOUNT_0                  (0x1UL<<HRPWM_DCFCTL_EDGECOUNT_Pos)               /*!< 0x00000400 */
#define HRPWM_DCFCTL_EDGECOUNT_1                  (0x2UL<<HRPWM_DCFCTL_EDGECOUNT_Pos)               /*!< 0x00000800 */
#define HRPWM_DCFCTL_EDGECOUNT_2                  (0x4UL<<HRPWM_DCFCTL_EDGECOUNT_Pos)               /*!< 0x00001000 */
#define HRPWM_DCFCTL_EDGESTATUS_Pos               (13U)
#define HRPWM_DCFCTL_EDGESTATUS_Msk               (0x7UL<<HRPWM_DCFCTL_EDGESTATUS_Pos)              /*!< 0x0000E000 */
#define HRPWM_DCFCTL_EDGESTATUS                   HRPWM_DCFCTL_EDGESTATUS_Msk
#define HRPWM_DCFCTL_EDGESTATUS_0                 (0x1UL<<HRPWM_DCFCTL_EDGESTATUS_Pos)              /*!< 0x00002000 */
#define HRPWM_DCFCTL_EDGESTATUS_1                 (0x2UL<<HRPWM_DCFCTL_EDGESTATUS_Pos)              /*!< 0x00004000 */
#define HRPWM_DCFCTL_EDGESTATUS_2                 (0x4UL<<HRPWM_DCFCTL_EDGESTATUS_Pos)              /*!< 0x00008000 */

/********************************* Bit definition for HRPWM_DCCAPCTL register ***************************************/
#define HRPWM_DCCAPCTL_CAPE_Pos                   (0U)
#define HRPWM_DCCAPCTL_CAPE_Msk                   (0x1UL<<HRPWM_DCCAPCTL_CAPE_Pos)                  /*!< 0x00000001 */
#define HRPWM_DCCAPCTL_CAPE                       HRPWM_DCCAPCTL_CAPE_Msk                           
#define HRPWM_DCCAPCTL_SHDWMODE_Pos               (1U)
#define HRPWM_DCCAPCTL_SHDWMODE_Msk               (0x1UL<<HRPWM_DCCAPCTL_SHDWMODE_Pos)              /*!< 0x00000002 */
#define HRPWM_DCCAPCTL_SHDWMODE                   HRPWM_DCCAPCTL_SHDWMODE_Msk                       
#define HRPWM_DCCAPCTL_CAPSTS_Pos                 (13U)
#define HRPWM_DCCAPCTL_CAPSTS_Msk                 (0x1UL<<HRPWM_DCCAPCTL_CAPSTS_Pos)                /*!< 0x00002000 */
#define HRPWM_DCCAPCTL_CAPSTS                     HRPWM_DCCAPCTL_CAPSTS_Msk                         
#define HRPWM_DCCAPCTL_CAPCLR_Pos                 (14U)
#define HRPWM_DCCAPCTL_CAPCLR_Msk                 (0x1UL<<HRPWM_DCCAPCTL_CAPCLR_Pos)                /*!< 0x00004000 */
#define HRPWM_DCCAPCTL_CAPCLR                     HRPWM_DCCAPCTL_CAPCLR_Msk                         
#define HRPWM_DCCAPCTL_CAPMODE_Pos                (15U)
#define HRPWM_DCCAPCTL_CAPMODE_Msk                (0x1UL<<HRPWM_DCCAPCTL_CAPMODE_Pos)               /*!< 0x00008000 */
#define HRPWM_DCCAPCTL_CAPMODE                    HRPWM_DCCAPCTL_CAPMODE_Msk                        

/********************************* Bit definition for HRPWM_DCFOFFSET register **************************************/
#define HRPWM_DCFOFFSET_DCFOFFSET_Pos             (0U)
#define HRPWM_DCFOFFSET_DCFOFFSET_Msk             (0xFFFFUL<<HRPWM_DCFOFFSET_DCFOFFSET_Pos)         /*!< 0x0000FFFF */
#define HRPWM_DCFOFFSET_DCFOFFSET                 HRPWM_DCFOFFSET_DCFOFFSET_Msk

/********************************* Bit definition for HRPWM_DCFOFFSETCNT register ***********************************/
#define HRPWM_DCFOFFSETCNT_DCFOFFSETCNT_Pos       (0U)
#define HRPWM_DCFOFFSETCNT_DCFOFFSETCNT_Msk       (0xFFFFUL<<HRPWM_DCFOFFSETCNT_DCFOFFSETCNT_Pos)   /*!< 0x0000FFFF */
#define HRPWM_DCFOFFSETCNT_DCFOFFSETCNT           HRPWM_DCFOFFSETCNT_DCFOFFSETCNT_Msk

/********************************* Bit definition for HRPWM_DCFWINDOW register **************************************/
#define HRPWM_DCFWINDOW_DCFWINDOW_Pos             (0U)
#define HRPWM_DCFWINDOW_DCFWINDOW_Msk             (0xFFFFUL<<HRPWM_DCFWINDOW_DCFWINDOW_Pos)         /*!< 0x0000FFFF */
#define HRPWM_DCFWINDOW_DCFWINDOW                 HRPWM_DCFWINDOW_DCFWINDOW_Msk

/********************************* Bit definition for HRPWM_DCFWINDOWCNT register ***********************************/
#define HRPWM_DCFWINDOWCNT_DCFWINDOWCNT_Pos       (0U)
#define HRPWM_DCFWINDOWCNT_DCFWINDOWCNT_Msk       (0xFFFFUL<<HRPWM_DCFWINDOWCNT_DCFWINDOWCNT_Pos)   /*!< 0x0000FFFF */
#define HRPWM_DCFWINDOWCNT_DCFWINDOWCNT           HRPWM_DCFWINDOWCNT_DCFWINDOWCNT_Msk

/********************************* Bit definition for HRPWM_DCCAP register ******************************************/
#define HRPWM_DCCAP_DCCAP_Pos                     (0U)
#define HRPWM_DCCAP_DCCAP_Msk                     (0xFFFFUL<<HRPWM_DCCAP_DCCAP_Pos)                 /*!< 0x0000FFFF */
#define HRPWM_DCCAP_DCCAP                         HRPWM_DCCAP_DCCAP_Msk

