breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for HRPWM_DCAHTRIPSEL register ************************************/
#define HRPWM_DCAHTRIPSEL_TRIPINPUT1_Pos          (0U)
#define HRPWM_DCAHTRIPSEL_TRIPINPUT1_Msk          (0x1UL<<HRPWM_DCAHTRIPSEL_TRIPINPUT1_Pos)         /*!< 0x00000001 */
#define HRPWM_DCAHTRIPSEL_TRIPINPUT1              HRPWM_DCAHTRIPSEL_TRIPINPUT1_Msk                  
#define HRPWM_DCAHTRIPSEL_TRIPINPUT2_Pos          (1U)
#define HRPWM_DCAHTRIPSEL_TRIPINPUT2_Msk          (0x1UL<<HRPWM_DCAHTRIPSEL_TRIPINPUT2_Pos)         /*!< 0x00000002 */
#define HRPWM_DCAHTRIPSEL_TRIPINPUT2              HRPWM_DCAHTRIPSEL_TRIPINPUT2_Msk                  
#define HRPWM_DCAHTRIPSEL_TRIPINPUT3_Pos          (2U)
#define HRPWM_DCAHTRIPSEL_TRIPINPUT3_Msk          (0x1UL<<HRPWM_DCAHTRIPSEL_TRIPINPUT3_Pos)         /*!< 0x00000004 */
#define HRPWM_DCAHTRIPSEL_TRIPINPUT3              HRPWM_DCAHTRIPSEL_TRIPINPUT3_Msk                  
#define HRPWM_DCAHTRIPSEL_TRIPINPUT4_Pos          (3U)
#define HRPWM_DCAHTRIPSEL_TRIPINPUT4_Msk          (0x1UL<<HRPWM_DCAHTRIPSEL_TRIPINPUT4_Pos)         /*!< 0x00000008 */
#define HRPWM_DCAHTRIPSEL_TRIPINPUT4              HRPWM_DCAHTRIPSEL_TRIPINPUT4_Msk                  
#define HRPWM_DCAHTRIPSEL_TRIPINPUT5_Pos          (4U)
#define HRPWM_DCAHTRIPSEL_TRIPINPUT5_Msk          (0x1UL<<HRPWM_DCAHTRIPSEL_TRIPINPUT5_Pos)         /*!< 0x00000010 */
#define HRPWM_DCAHTRIPSEL_TRIPINPUT5              HRPWM_DCAHTRIPSEL_TRIPINPUT5_Msk                  
#define HRPWM_DCAHTRIPSEL_TRIPINPUT6_Pos          (5U)
#define HRPWM_DCAHTRIPSEL_TRIPINPUT6_Msk          (0x1UL<<HRPWM_DCAHTRIPSEL_TRIPINPUT6_Pos)         /*!< 0x00000020 */
#define HRPWM_DCAHTRIPSEL_TRIPINPUT6              HRPWM_DCAHTRIPSEL_TRIPINPUT6_Msk                  
#define HRPWM_DCAHTRIPSEL_TRIPINPUT7_Pos          (6U)
#define HRPWM_DCAHTRIPSEL_TRIPINPUT7_Msk          (0x1UL<<HRPWM_DCAHTRIPSEL_TRIPINPUT7_Pos)         /*!< 0x00000040 */
#define HRPWM_DCAHTRIPSEL_TRIPINPUT7              HRPWM_DCAHTRIPSEL_TRIPINPUT7_Msk                  
#define HRPWM_DCAHTRIPSEL_TRIPINPUT8_Pos          (7U)
#define HRPWM_DCAHTRIPSEL_TRIPINPUT8_Msk          (0x1UL<<HRPWM_DCAHTRIPSEL_TRIPINPUT8_Pos)         /*!< 0x00000080 */
#define HRPWM_DCAHTRIPSEL_TRIPINPUT8              HRPWM_DCAHTRIPSEL_TRIPINPUT8_Msk                  
#define HRPWM_DCAHTRIPSEL_TRIPINPUT9_Pos          (8U)
#define HRPWM_DCAHTRIPSEL_TRIPINPUT9_Msk          (0x1UL<<HRPWM_DCAHTRIPSEL_TRIPINPUT9_Pos)         /*!< 0x00000100 */
#define HRPWM_DCAHTRIPSEL_TRIPINPUT9              HRPWM_DCAHTRIPSEL_TRIPINPUT9_Msk                  
#define HRPWM_DCAHTRIPSEL_TRIPINPUT10_Pos         (9U)
#define HRPWM_DCAHTRIPSEL_TRIPINPUT10_Msk         (0x1UL<<HRPWM_DCAHTRIPSEL_TRIPINPUT10_Pos)        /*!< 0x00000200 */
#define HRPWM_DCAHTRIPSEL_TRIPINPUT10             HRPWM_DCAHTRIPSEL_TRIPINPUT10_Msk                 
#define HRPWM_DCAHTRIPSEL_TRIPINPUT11_Pos         (10U)
#define HRPWM_DCAHTRIPSEL_TRIPINPUT11_Msk         (0x1UL<<HRPWM_DCAHTRIPSEL_TRIPINPUT11_Pos)        /*!< 0x00000400 */
#define HRPWM_DCAHTRIPSEL_TRIPINPUT11             HRPWM_DCAHTRIPSEL_TRIPINPUT11_Msk                 
#define HRPWM_DCAHTRIPSEL_TRIPINPUT12_Pos         (11U)
#define HRPWM_DCAHTRIPSEL_TRIPINPUT12_Msk         (0x1UL<<HRPWM_DCAHTRIPSEL_TRIPINPUT12_Pos)        /*!< 0x00000800 */
#define HRPWM_DCAHTRIPSEL_TRIPINPUT12             HRPWM_DCAHTRIPSEL_TRIPINPUT12_Msk                 
#define HRPWM_DCAHTRIPSEL_TRIPINPUT14_Pos         (13U)
#define HRPWM_DCAHTRIPSEL_TRIPINPUT14_Msk         (0x1UL<<HRPWM_DCAHTRIPSEL_TRIPINPUT14_Pos)        /*!< 0x00002000 */
#define HRPWM_DCAHTRIPSEL_TRIPINPUT14             HRPWM_DCAHTRIPSEL_TRIPINPUT14_Msk                 
#define HRPWM_DCAHTRIPSEL_TRIPINPUT15_Pos         (14U)
#define HRPWM_DCAHTRIPSEL_TRIPINPUT15_Msk         (0x1UL<<HRPWM_DCAHTRIPSEL_TRIPINPUT15_Pos)        /*!< 0x00004000 */
#define HRPWM_DCAHTRIPSEL_TRIPINPUT15             HRPWM_DCAHTRIPSEL_TRIPINPUT15_Msk                 

/********************************* Bit definition for HRPWM_DCALTRIPSEL register ************************************/
#define HRPWM_DCALTRIPSEL_TRIPINPUT1_Pos          (0U)
#define HRPWM_DCALTRIPSEL_TRIPINPUT1_Msk          (0x1UL<<HRPWM_DCALTRIPSEL_TRIPINPUT1_Pos)         /*!< 0x00000001 */
#define HRPWM_DCALTRIPSEL_TRIPINPUT1              HRPWM_DCALTRIPSEL_TRIPINPUT1_Msk                  
#define HRPWM_DCALTRIPSEL_TRIPINPUT2_Pos          (1U)
#define HRPWM_DCALTRIPSEL_TRIPINPUT2_Msk          (0x1UL<<HRPWM_DCALTRIPSEL_TRIPINPUT2_Pos)         /*!< 0x00000002 */
#define HRPWM_DCALTRIPSEL_TRIPINPUT2              HRPWM_DCALTRIPSEL_TRIPINPUT2_Msk                  
#define HRPWM_DCALTRIPSEL_TRIPINPUT3_Pos          (2U)
#define HRPWM_DCALTRIPSEL_TRIPINPUT3_Msk          (0x1UL<<HRPWM_DCALTRIPSEL_TRIPINPUT3_Pos)         /*!< 0x00000004 */
#define HRPWM_DCALTRIPSEL_TRIPINPUT3              HRPWM_DCALTRIPSEL_TRIPINPUT3_Msk                  
#define HRPWM_DCALTRIPSEL_TRIPINPUT4_Pos          (3U)
#define HRPWM_DCALTRIPSEL_TRIPINPUT4_Msk          (0x1UL<<HRPWM_DCALTRIPSEL_TRIPINPUT4_Pos)         /*!< 0x00000008 */
#define HRPWM_DCALTRIPSEL_TRIPINPUT4              HRPWM_DCALTRIPSEL_TRIPINPUT4_Msk                  
#define HRPWM_DCALTRIPSEL_TRIPINPUT5_Pos          (4U)
#define HRPWM_DCALTRIPSEL_TRIPINPUT5_Msk          (0x1UL<<HRPWM_DCALTRIPSEL_TRIPINPUT5_Pos)         /*!< 0x00000010 */
#define HRPWM_DCALTRIPSEL_TRIPINPUT5              HRPWM_DCALTRIPSEL_TRIPINPUT5_Msk                  
#define HRPWM_DCALTRIPSEL_TRIPINPUT6_Pos          (5U)
#define HRPWM_DCALTRIPSEL_TRIPINPUT6_Msk          (0x1UL<<HRPWM_DCALTRIPSEL_TRIPINPUT6_Pos)         /*!< 0x00000020 */
#define HRPWM_DCALTRIPSEL_TRIPINPUT6              HRPWM_DCALTRIPSEL_TRIPINPUT6_Msk                  
#define HRPWM_DCALTRIPSEL_TRIPINPUT7_Pos          (6U)
#define HRPWM_DCALTRIPSEL_TRIPINPUT7_Msk          (0x1UL<<HRPWM_DCALTRIPSEL_TRIPINPUT7_Pos)         /*!< 0x00000040 */
#define HRPWM_DCALTRIPSEL_TRIPINPUT7              HRPWM_DCALTRIPSEL_TRIPINPUT7_Msk                  
#define HRPWM_DCALTRIPSEL_TRIPINPUT8_Pos          (7U)
#define HRPWM_DCALTRIPSEL_TRIPINPUT8_Msk          (0x1UL<<HRPWM_DCALTRIPSEL_TRIPINPUT8_Pos)         /*!< 0x00000080 */
#define HRPWM_DCALTRIPSEL_TRIPINPUT8              HRPWM_DCALTRIPSEL_TRIPINPUT8_Msk                  
#define HRPWM_DCALTRIPSEL_TRIPINPUT9_Pos          (8U)
#define HRPWM_DCALTRIPSEL_TRIPINPUT9_Msk          (0x1UL<<HRPWM_DCALTRIPSEL_TRIPINPUT9_Pos)         /*!< 0x00000100 */
#define HRPWM_DCALTRIPSEL_TRIPINPUT9              HRPWM_DCALTRIPSEL_TRIPINPUT9_Msk                  
#define HRPWM_DCALTRIPSEL_TRIPINPUT10_Pos         (9U)
#define HRPWM_DCALTRIPSEL_TRIPINPUT10_Msk         (0x1UL<<HRPWM_DCALTRIPSEL_TRIPINPUT10_Pos)        /*!< 0x00000200 */
#define HRPWM_DCALTRIPSEL_TRIPINPUT10             HRPWM_DCALTRIPSEL_TRIPINPUT10_Msk                 
#define HRPWM_DCALTRIPSEL_TRIPINPUT11_Pos         (10U)
#define HRPWM_DCALTRIPSEL_TRIPINPUT11_Msk         (0x1UL<<HRPWM_DCALTRIPSEL_TRIPINPUT11_Pos)        /*!< 0x00000400 */
#define HRPWM_DCALTRIPSEL_TRIPINPUT11             HRPWM_DCALTRIPSEL_TRIPINPUT11_Msk                 
#define HRPWM_DCALTRIPSEL_TRIPINPUT12_Pos         (11U)
#define HRPWM_DCALTRIPSEL_TRIPINPUT12_Msk         (0x1UL<<HRPWM_DCALTRIPSEL_TRIPINPUT12_Pos)        /*!< 0x00000800 */
#define HRPWM_DCALTRIPSEL_TRIPINPUT12             HRPWM_DCALTRIPSEL_TRIPINPUT12_Msk                 
#define HRPWM_DCALTRIPSEL_TRIPINPUT14_Pos         (13U)
#define HRPWM_DCALTRIPSEL_TRIPINPUT14_Msk         (0x1UL<<HRPWM_DCALTRIPSEL_TRIPINPUT14_Pos)        /*!< 0x00002000 */
#define HRPWM_DCALTRIPSEL_TRIPINPUT14             HRPWM_DCALTRIPSEL_TRIPINPUT14_Msk                 
#define HRPWM_DCALTRIPSEL_TRIPINPUT15_Pos         (14U)
#define HRPWM_DCALTRIPSEL_TRIPINPUT15_Msk         (0x1UL<<HRPWM_DCALTRIPSEL_TRIPINPUT15_Pos)        /*!< 0x00004000 */
#define HRPWM_DCALTRIPSEL_TRIPINPUT15             HRPWM_DCALTRIPSEL_TRIPINPUT15_Msk                 

/********************************* Bit definition for HRPWM_DCBHTRIPSEL register ************************************/
#define HRPWM_DCBHTRIPSEL_TRIPINPUT1_Pos          (0U)
#define HRPWM_DCBHTRIPSEL_TRIPINPUT1_Msk          (0x1UL<<HRPWM_DCBHTRIPSEL_TRIPINPUT1_Pos)         /*!< 0x00000001 */
#define HRPWM_DCBHTRIPSEL_TRIPINPUT1              HRPWM_DCBHTRIPSEL_TRIPINPUT1_Msk                  
#define HRPWM_DCBHTRIPSEL_TRIPINPUT2_Pos          (1U)
#define HRPWM_DCBHTRIPSEL_TRIPINPUT2_Msk          (0x1UL<<HRPWM_DCBHTRIPSEL_TRIPINPUT2_Pos)         /*!< 0x00000002 */
#define HRPWM_DCBHTRIPSEL_TRIPINPUT2              HRPWM_DCBHTRIPSEL_TRIPINPUT2_Msk                  
#define HRPWM_DCBHTRIPSEL_TRIPINPUT3_Pos          (2U)
#define HRPWM_DCBHTRIPSEL_TRIPINPUT3_Msk          (0x1UL<<HRPWM_DCBHTRIPSEL_TRIPINPUT3_Pos)         /*!< 0x00000004 */
#define HRPWM_DCBHTRIPSEL_TRIPINPUT3              HRPWM_DCBHTRIPSEL_TRIPINPUT3_Msk                  
#define HRPWM_DCBHTRIPSEL_TRIPINPUT4_Pos          (3U)
#define HRPWM_DCBHTRIPSEL_TRIPINPUT4_Msk          (0x1UL<<HRPWM_DCBHTRIPSEL_TRIPINPUT4_Pos)         /*!< 0x00000008 */
#define HRPWM_DCBHTRIPSEL_TRIPINPUT4              HRPWM_DCBHTRIPSEL_TRIPINPUT4_Msk                  
#define HRPWM_DCBHTRIPSEL_TRIPINPUT5_Pos          (4U)
#define HRPWM_DCBHTRIPSEL_TRIPINPUT5_Msk          (0x1UL<<HRPWM_DCBHTRIPSEL_TRIPINPUT5_Pos)         /*!< 0x00000010 */
#define HRPWM_DCBHTRIPSEL_TRIPINPUT5              HRPWM_DCBHTRIPSEL_TRIPINPUT5_Msk                  
#define HRPWM_DCBHTRIPSEL_TRIPINPUT6_Pos          (5U)
#define HRPWM_DCBHTRIPSEL_TRIPINPUT6_Msk          (0x1UL<<HRPWM_DCBHTRIPSEL_TRIPINPUT6_Pos)         /*!< 0x00000020 */
#define HRPWM_DCBHTRIPSEL_TRIPINPUT6              HRPWM_DCBHTRIPSEL_TRIPINPUT6_Msk                  
#define HRPWM_DCBHTRIPSEL_TRIPINPUT7_Pos          (6U)
#define HRPWM_DCBHTRIPSEL_TRIPINPUT7_Msk          (0x1UL<<HRPWM_DCBHTRIPSEL_TRIPINPUT7_Pos)         /*!< 0x00000040 */
#define HRPWM_DCBHTRIPSEL_TRIPINPUT7              HRPWM_DCBHTRIPSEL_TRIPINPUT7_Msk                  
#define HRPWM_DCBHTRIPSEL_TRIPINPUT8_Pos          (7U)
#define HRPWM_DCBHTRIPSEL_TRIPINPUT8_Msk          (0x1UL<<HRPWM_DCBHTRIPSEL_TRIPINPUT8_Pos)         /*!< 0x00000080 */
#define HRPWM_DCBHTRIPSEL_TRIPINPUT8              HRPWM_DCBHTRIPSEL_TRIPINPUT8_Msk                  
#define HRPWM_DCBHTRIPSEL_TRIPINPUT9_Pos          (8U)
#define HRPWM_DCBHTRIPSEL_TRIPINPUT9_Msk          (0x1UL<<HRPWM_DCBHTRIPSEL_TRIPINPUT9_Pos)         /*!< 0x00000100 */
#define HRPWM_DCBHTRIPSEL_TRIPINPUT9              HRPWM_DCBHTRIPSEL_TRIPINPUT9_Msk                  
#define HRPWM_DCBHTRIPSEL_TRIPINPUT10_Pos         (9U)
#define HRPWM_DCBHTRIPSEL_TRIPINPUT10_Msk         (0x1UL<<HRPWM_DCBHTRIPSEL_TRIPINPUT10_Pos)        /*!< 0x00000200 */
#define HRPWM_DCBHTRIPSEL_TRIPINPUT10             HRPWM_DCBHTRIPSEL_TRIPINPUT10_Msk                 
#define HRPWM_DCBHTRIPSEL_TRIPINPUT11_Pos         (10U)
#define HRPWM_DCBHTRIPSEL_TRIPINPUT11_Msk         (0x1UL<<HRPWM_DCBHTRIPSEL_TRIPINPUT11_Pos)        /*!< 0x00000400 */
#define HRPWM_DCBHTRIPSEL_TRIPINPUT11             HRPWM_DCBHTRIPSEL_TRIPINPUT11_Msk                 
#define HRPWM_DCBHTRIPSEL_TRIPINPUT12_Pos         (11U)
#define HRPWM_DCBHTRIPSEL_TRIPINPUT12_Msk         (0x1UL<<HRPWM_DCBHTRIPSEL_TRIPINPUT12_Pos)        /*!< 0x00000800 */
#define HRPWM_DCBHTRIPSEL_TRIPINPUT12             HRPWM_DCBHTRIPSEL_TRIPINPUT12_Msk                 
#define HRPWM_DCBHTRIPSEL_TRIPINPUT14_Pos         (13U)
#define HRPWM_DCBHTRIPSEL_TRIPINPUT14_Msk         (0x1UL<<HRPWM_DCBHTRIPSEL_TRIPINPUT14_Pos)        /*!< 0x00002000 */
#define HRPWM_DCBHTRIPSEL_TRIPINPUT14             HRPWM_DCBHTRIPSEL_TRIPINPUT14_Msk                 
#define HRPWM_DCBHTRIPSEL_TRIPINPUT15_Pos         (14U)
#define HRPWM_DCBHTRIPSEL_TRIPINPUT15_Msk         (0x1UL<<HRPWM_DCBHTRIPSEL_TRIPINPUT15_Pos)        /*!< 0x00004000 */
#define HRPWM_DCBHTRIPSEL_TRIPINPUT15             HRPWM_DCBHTRIPSEL_TRIPINPUT15_Msk                 

/********************************* Bit definition for HRPWM_DCBLTRIPSEL register ************************************/
#define HRPWM_DCBLTRIPSEL_TRIPINPUT1_Pos          (0U)
#define HRPWM_DCBLTRIPSEL_TRIPINPUT1_Msk          (0x1UL<<HRPWM_DCBLTRIPSEL_TRIPINPUT1_Pos)         /*!< 0x00000001 */
#define HRPWM_DCBLTRIPSEL_TRIPINPUT1              HRPWM_DCBLTRIPSEL_TRIPINPUT1_Msk                  
#define HRPWM_DCBLTRIPSEL_TRIPINPUT2_Pos          (1U)
#define HRPWM_DCBLTRIPSEL_TRIPINPUT2_Msk          (0x1UL<<HRPWM_DCBLTRIPSEL_TRIPINPUT2_Pos)         /*!< 0x00000002 */
#define HRPWM_DCBLTRIPSEL_TRIPINPUT2              HRPWM_DCBLTRIPSEL_TRIPINPUT2_Msk                  
#define HRPWM_DCBLTRIPSEL_TRIPINPUT3_Pos          (2U)
#define HRPWM_DCBLTRIPSEL_TRIPINPUT3_Msk          (0x1UL<<HRPWM_DCBLTRIPSEL_TRIPINPUT3_Pos)         /*!< 0x00000004 */
#define HRPWM_DCBLTRIPSEL_TRIPINPUT3              HRPWM_DCBLTRIPSEL_TRIPINPUT3_Msk                  
#define HRPWM_DCBLTRIPSEL_TRIPINPUT4_Pos          (3U)
#define HRPWM_DCBLTRIPSEL_TRIPINPUT4_Msk          (0x1UL<<HRPWM_DCBLTRIPSEL_TRIPINPUT4_Pos)         /*!< 0x00000008 */
#define HRPWM_DCBLTRIPSEL_TRIPINPUT4              HRPWM_DCBLTRIPSEL_TRIPINPUT4_Msk                  
#define HRPWM_DCBLTRIPSEL_TRIPINPUT5_Pos          (4U)
#define HRPWM_DCBLTRIPSEL_TRIPINPUT5_Msk          (0x1UL<<HRPWM_DCBLTRIPSEL_TRIPINPUT5_Pos)         /*!< 0x00000010 */
#define HRPWM_DCBLTRIPSEL_TRIPINPUT5              HRPWM_DCBLTRIPSEL_TRIPINPUT5_Msk                  
#define HRPWM_DCBLTRIPSEL_TRIPINPUT6_Pos          (5U)
#define HRPWM_DCBLTRIPSEL_TRIPINPUT6_Msk          (0x1UL<<HRPWM_DCBLTRIPSEL_TRIPINPUT6_Pos)         /*!< 0x00000020 */
#define HRPWM_DCBLTRIPSEL_TRIPINPUT6              HRPWM_DCBLTRIPSEL_TRIPINPUT6_Msk                  
#define HRPWM_DCBLTRIPSEL_TRIPINPUT7_Pos          (6U)
#define HRPWM_DCBLTRIPSEL_TRIPINPUT7_Msk          (0x1UL<<HRPWM_DCBLTRIPSEL_TRIPINPUT7_Pos)         /*!< 0x00000040 */
#define HRPWM_DCBLTRIPSEL_TRIPINPUT7              HRPWM_DCBLTRIPSEL_TRIPINPUT7_Msk                  
#define HRPWM_DCBLTRIPSEL_TRIPINPUT8_Pos          (7U)
#define HRPWM_DCBLTRIPSEL_TRIPINPUT8_Msk          (0x1UL<<HRPWM_DCBLTRIPSEL_TRIPINPUT8_Pos)         /*!< 0x00000080 */
#define HRPWM_DCBLTRIPSEL_TRIPINPUT8              HRPWM_DCBLTRIPSEL_TRIPINPUT8_Msk                  
#define HRPWM_DCBLTRIPSEL_TRIPINPUT9_Pos          (8U)
#define HRPWM_DCBLTRIPSEL_TRIPINPUT9_Msk          (0x1UL<<HRPWM_DCBLTRIPSEL_TRIPINPUT9_Pos)         /*!< 0x00000100 */
#define HRPWM_DCBLTRIPSEL_TRIPINPUT9              HRPWM_DCBLTRIPSEL_TRIPINPUT9_Msk                  
#define HRPWM_DCBLTRIPSEL_TRIPINPUT10_Pos         (9U)
#define HRPWM_DCBLTRIPSEL_TRIPINPUT10_Msk         (0x1UL<<HRPWM_DCBLTRIPSEL_TRIPINPUT10_Pos)        /*!< 0x00000200 */
#define HRPWM_DCBLTRIPSEL_TRIPINPUT10             HRPWM_DCBLTRIPSEL_TRIPINPUT10_Msk                 
#define HRPWM_DCBLTRIPSEL_TRIPINPUT11_Pos         (10U)
#define HRPWM_DCBLTRIPSEL_TRIPINPUT11_Msk         (0x1UL<<HRPWM_DCBLTRIPSEL_TRIPINPUT11_Pos)        /*!< 0x00000400 */
#define HRPWM_DCBLTRIPSEL_TRIPINPUT11             HRPWM_DCBLTRIPSEL_TRIPINPUT11_Msk                 
#define HRPWM_DCBLTRIPSEL_TRIPINPUT12_Pos         (11U)
#define HRPWM_DCBLTRIPSEL_TRIPINPUT12_Msk         (0x1UL<<HRPWM_DCBLTRIPSEL_TRIPINPUT12_Pos)        /*!< 0x00000800 */
#define HRPWM_DCBLTRIPSEL_TRIPINPUT12             HRPWM_DCBLTRIPSEL_TRIPINPUT12_Msk                 
#define HRPWM_DCBLTRIPSEL_TRIPINPUT14_Pos         (13U)
#define HRPWM_DCBLTRIPSEL_TRIPINPUT14_Msk         (0x1UL<<HRPWM_DCBLTRIPSEL_TRIPINPUT14_Pos)        /*!< 0x00002000 */
#define HRPWM_DCBLTRIPSEL_TRIPINPUT14             HRPWM_DCBLTRIPSEL_TRIPINPUT14_Msk                 
#define HRPWM_DCBLTRIPSEL_TRIPINPUT15_Pos         (14U)
#define HRPWM_DCBLTRIPSEL_TRIPINPUT15_Msk         (0x1UL<<HRPWM_DCBLTRIPSEL_TRIPINPUT15_Pos)        /*!< 0x00004000 */
#define HRPWM_DCBLTRIPSEL_TRIPINPUT15             HRPWM_DCBLTRIPSEL_TRIPINPUT15_Msk                 

