breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/********************************* Bit definition for HRPWM_PWMLOCK register ****************************************/
#define HRPWM_PWMLOCK_HRLOCK_Pos                  (0U)
#define HRPWM_PWMLOCK_HRLOCK_Msk                  (0x1UL<<HRPWM_PWMLOCK_HRLOCK_Pos)                 /*!< 0x00000001 */
#define HRPWM_PWMLOCK_HRLOCK                      HRPWM_PWMLOCK_HRLOCK_Msk                          
#define HRPWM_PWMLOCK_GLLOCK_Pos                  (1U)
#define HRPWM_PWMLOCK_GLLOCK_Msk                  (0x1UL<<HRPWM_PWMLOCK_GLLOCK_Pos)                 /*!< 0x00000002 */
#define HRPWM_PWMLOCK_GLLOCK                      HRPWM_PWMLOCK_GLLOCK_Msk                          
#define HRPWM_PWMLOCK_TZCFGLOCK_Pos               (2U)
#define HRPWM_PWMLOCK_TZCFGLOCK_Msk               (0x1UL<<HRPWM_PWMLOCK_TZCFGLOCK_Pos)              /*!< 0x00000004 */
#define HRPWM_PWMLOCK_TZCFGLOCK                   HRPWM_PWMLOCK_TZCFGLOCK_Msk                       
#define HRPWM_PWMLOCK_TZCLRLOCK_Pos               (3U)
#define HRPWM_PWMLOCK_TZCLRLOCK_Msk               (0x1UL<<HRPWM_PWMLOCK_TZCLRLOCK_Pos)              /*!< 0x00000008 */
#define HRPWM_PWMLOCK_TZCLRLOCK                   HRPWM_PWMLOCK_TZCLRLOCK_Msk                       
#define HRPWM_PWMLOCK_DCLOCK_Pos                  (4U)
#define HRPWM_PWMLOCK_DCLOCK_Msk                  (0x1UL<<HRPWM_PWMLOCK_DCLOCK_Pos)                 /*!< 0x00000010 */
#define HRPWM_PWMLOCK_DCLOCK                      HRPWM_PWMLOCK_DCLOCK_Msk                          
#define HRPWM_PWMLOCK_KEY_Pos                     (16U)
#define HRPWM_PWMLOCK_KEY_Msk                     (0xFFFFUL<<HRPWM_PWMLOCK_KEY_Pos)                 /*!< 0xFFFF0000 */
#define HRPWM_PWMLOCK_KEY                         HRPWM_PWMLOCK_KEY_Msk

/********************************* Bit definition for HRPWM_HWVDELVAL register **************************************/
#define HRPWM_HWVDELVAL_HWVDELVAL_Pos             (0U)
#define HRPWM_HWVDELVAL_HWVDELVAL_Msk             (0xFFFFUL<<HRPWM_HWVDELVAL_HWVDELVAL_Pos)         /*!< 0x0000FFFF */
#define HRPWM_HWVDELVAL_HWVDELVAL                 HRPWM_HWVDELVAL_HWVDELVAL_Msk

/********************************* Bit definition for HRPWM_VCNTVAL register ****************************************/
#define HRPWM_VCNTVAL_VCNTVAL_Pos                 (0U)
#define HRPWM_VCNTVAL_VCNTVAL_Msk                 (0xFFFFUL<<HRPWM_VCNTVAL_VCNTVAL_Pos)             /*!< 0x0000FFFF */
#define HRPWM_VCNTVAL_VCNTVAL                     HRPWM_VCNTVAL_VCNTVAL_Msk



/****************************** ADC Instances *********************************/
#define IS_ADC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == ADC1)

 #define IS_ADC_COMMON_INSTANCE(INSTANCE) ((INSTANCE) == ADC_COMMON)

#define IS_ADC_MULTIMODE_MASTER_INSTANCE(INSTANCE) ((INSTANCE) == ADC1)

#define IS_ADC_DMA_CAPABILITY_INSTANCE(INSTANCE) ((INSTANCE) == ADC1)

/****************************** COMP Instances *******************************/
#define IS_COMP_ALL_INSTANCE(INSTANCE) (((INSTANCE) == COMP1) || \
                                        ((INSTANCE) == COMP2))

#define IS_COMP_COMMON_INSTANCE(INSTANCE) ((INSTANCE) == COMP12_COMMON)

/****************************** OPA Instances *******************************/
#define IS_OPA_ALL_INSTANCE(INSTANCE) (((INSTANCE) == OPA1) || \
                                       ((INSTANCE) == OPA2))

/****************************** CRC Instances *******************************/
#define IS_CRC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == CRC)

/****************************** DBGMCU Instances *******************************/
#define IS_DBGMCU_ALL_INSTANCE(INSTANCE) ((INSTANCE) == DBGMCU)

/****************************** DMA Instances *********************************/
#define IS_DMA_ALL_INSTANCE(INSTANCE) (((INSTANCE) == DMA1_Channel1) || \
                                       ((INSTANCE) == DMA1_Channel2) || \
                                       ((INSTANCE) == DMA1_Channel3) || \
                                       ((INSTANCE) == DMA1_Channel4) || \
                                       ((INSTANCE) == DMA1_Channel5) || \
                                       ((INSTANCE) == DMA1_Channel6) || \
                                       ((INSTANCE) == DMA1_Channel7) || \
                                       ((INSTANCE) == DMA1_Channel8))

/****************************** EXTI Instances ********************************/
#define IS_EXTI_ALL_INSTANCE(INSTANCE) ((INSTANCE) == EXTI)

/****************************** FLASH Instances ********************************/
#define IS_FLASH_ALL_INSTANCE(INSTANCE) ((INSTANCE) == FLASH)

/******************************* GPIO Instances *******************************/
#define IS_GPIO_ALL_INSTANCE(INSTANCE) (((INSTANCE) == GPIOA) || \
                                        ((INSTANCE) == GPIOB) || \
                                        ((INSTANCE) == GPIOC) || \
                                        ((INSTANCE) == GPIOD))

/**************************** GPIO Alternate Function Instances ***************/
#define IS_GPIO_AF_INSTANCE(INSTANCE) IS_GPIO_ALL_INSTANCE(INSTANCE)

/**************************** GPIO Lock Instances *****************************/
#define IS_GPIO_LOCK_INSTANCE(INSTANCE) IS_GPIO_ALL_INSTANCE(INSTANCE)

/******************************** I2C Instances *******************************/
#define IS_I2C_ALL_INSTANCE(INSTANCE) (((INSTANCE) == I2C1) || \
                                       ((INSTANCE) == I2C2))

/********************* I2C WAKEUP FROMSTOP Instances **************************/
#define IS_I2C_WAKEUP_FROMSTOP_INSTANCE(INSTANCE) (((INSTANCE) == I2C1) || \
                                                   ((INSTANCE) == I2C2))

/******************************* SMBUS Instances ******************************/
#define IS_SMBUS_ALL_INSTANCE         IS_I2C_ALL_INSTANCE

/****************************** PWR Instances ********************************/
#define IS_PWR_ALL_INSTANCE(INSTANCE) ((INSTANCE) == PWR)

/****************************** RTC Instances ********************************/
#define IS_RTC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == RTC)

/******************************** I2S Instances *******************************/
#define IS_I2S_ALL_INSTANCE(INSTANCE) (((INSTANCE) == SPI1) || \
                                       ((INSTANCE) == SPI2))

