breaveboy/AiKeyBoard/Project/.pack/Puya/PY32F4xx_DFP.1.0.6/Drivers/CMSIS/Device/PUYA/PY32F4xx/Include/py32f420xc.h
/************ PWM Instances : DMA requests generation (PWMx_DIER.UDE) *********/
#define IS_PWM_DMA_INSTANCE(INSTANCE)     (((INSTANCE) == PWM1) || ((INSTANCE) == PWM2) || ((INSTANCE) == PWM3) || ((INSTANCE) == PWM4) ) 

/************ PWM Instances : DMA requests generation (PWMx_DIER.OCxDE) *******/
#define IS_PWM_DMA_OC_INSTANCE(INSTANCE)  (((INSTANCE) == PWM1) || ((INSTANCE) == PWM2) || ((INSTANCE) == PWM3) || ((INSTANCE) == PWM4) ) 

/******************** PWM Instances : DMA burst feature ***********************/
#define IS_PWM_DMABURST_INSTANCE(INSTANCE)  (((INSTANCE) == PWM1) || ((INSTANCE) == PWM2) || ((INSTANCE) == PWM3) || ((INSTANCE) == PWM4) ) 

/******************* PWM Instances : output(s) available **********************/
#define IS_PWM_OCX_INSTANCE(INSTANCE, CHANNEL) \
    ((((INSTANCE) == PWM1) || ((INSTANCE) == PWM2) || ((INSTANCE) == PWM3) || ((INSTANCE) == PWM4)) &&                  \
     (((CHANNEL) == PWM_CHANNEL_1) ||          \
      ((CHANNEL) == PWM_CHANNEL_2) ||          \
      ((CHANNEL) == PWM_CHANNEL_3) ||          \
      ((CHANNEL) == PWM_CHANNEL_4)))

/****************** PWM Instances : supporting complementary output(s) ********/
#define IS_PWM_OCXN_INSTANCE(INSTANCE, CHANNEL) \
    ((((INSTANCE) == PWM1) || ((INSTANCE) == PWM2) || ((INSTANCE) == PWM3)) &&                   \
     (((CHANNEL) == PWM_CHANNEL_1) ||           \
      ((CHANNEL) == PWM_CHANNEL_2)))

/****************** PWM Instances : supporting clock division *****************/
#define IS_PWM_CLOCK_DIVISION_INSTANCE(INSTANCE)  (((INSTANCE) == PWM1) || ((INSTANCE) == PWM2) || ((INSTANCE) == PWM3) || ((INSTANCE) == PWM4) ) 

/****** PWM Instances : supporting external clock mode *******/
#define IS_PWM_CLOCKSOURCE_ETRMODE_INSTANCE(INSTANCE) (((INSTANCE) == PWM1) || ((INSTANCE) == PWM2) || ((INSTANCE) == PWM3) || ((INSTANCE) == PWM4) ) 

/****************** PWM Instances : supporting counting mode selection ********/
#define IS_PWM_COUNTER_MODE_SELECT_INSTANCE(INSTANCE)  (((INSTANCE) == PWM1) || ((INSTANCE) == PWM2) || ((INSTANCE) == PWM3) || ((INSTANCE) == PWM4) ) 

/****************** PWM Instances : remapping capability **********************/
#define IS_PWM_REMAP_INSTANCE(INSTANCE)    (((INSTANCE) == PWM1) || ((INSTANCE) == PWM2) || ((INSTANCE) == PWM3) || ((INSTANCE) == PWM4) ) 

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __PY32F420xB_H */

